#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Andrewsarchus_AnimBlueprint.Andrewsarchus_AnimBlueprint_C.BlueprintPlayAnimationEvent
	 */
	struct UAndrewsarchus_AnimBlueprint_C_BlueprintPlayAnimationEvent_Params
	{
	public:
		class UAnimMontage*                                        AnimationMontage;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      PlayRate;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      playedAnimLength;                                        // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Andrewsarchus_AnimBlueprint.Andrewsarchus_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_AnimGraphNode_BlendListByBool_A6C9F03943E623D58E74718FC9C68401
	 */
	struct UAndrewsarchus_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_AnimGraphNode_BlendListByBool_A6C9F03943E623D58E74718FC9C68401_Params
	{	};

	/**
	 * Function Andrewsarchus_AnimBlueprint.Andrewsarchus_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_AnimGraphNode_ModifyBone_20BD7D5B4373D25F59595796A9324475
	 */
	struct UAndrewsarchus_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_AnimGraphNode_ModifyBone_20BD7D5B4373D25F59595796A9324475_Params
	{	};

	/**
	 * Function Andrewsarchus_AnimBlueprint.Andrewsarchus_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_AnimGraphNode_BlendListByBool_BFDB9F974438E2E50B69FC91F2F9D9AE
	 */
	struct UAndrewsarchus_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_AnimGraphNode_BlendListByBool_BFDB9F974438E2E50B69FC91F2F9D9AE_Params
	{	};

	/**
	 * Function Andrewsarchus_AnimBlueprint.Andrewsarchus_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_AnimGraphNode_BlendListByBool_584DEAF74F680F147ABA7281AB4A9C03
	 */
	struct UAndrewsarchus_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_AnimGraphNode_BlendListByBool_584DEAF74F680F147ABA7281AB4A9C03_Params
	{	};

	/**
	 * Function Andrewsarchus_AnimBlueprint.Andrewsarchus_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_AnimGraphNode_ApplyAdditive_4A30AB734C1890766837F781A89385E5
	 */
	struct UAndrewsarchus_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_AnimGraphNode_ApplyAdditive_4A30AB734C1890766837F781A89385E5_Params
	{	};

	/**
	 * Function Andrewsarchus_AnimBlueprint.Andrewsarchus_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_AnimGraphNode_ApplyAdditive_0D6D7BF244D6693D074D6295FCA86D3A
	 */
	struct UAndrewsarchus_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_AnimGraphNode_ApplyAdditive_0D6D7BF244D6693D074D6295FCA86D3A_Params
	{	};

	/**
	 * Function Andrewsarchus_AnimBlueprint.Andrewsarchus_AnimBlueprint_C.BlueprintUpdateAnimation
	 */
	struct UAndrewsarchus_AnimBlueprint_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Andrewsarchus_AnimBlueprint.Andrewsarchus_AnimBlueprint_C.ExecuteUbergraph_Andrewsarchus_AnimBlueprint
	 */
	struct UAndrewsarchus_AnimBlueprint_C_ExecuteUbergraph_Andrewsarchus_AnimBlueprint_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
