#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass BaseHumanAnimBP.BaseHumanAnimBP_C
	 * Size -> 0x4C90 (FullSize[0x4FD0] - InheritedSize[0x0340])
	 */
	class UBaseHumanAnimBP_C : public UAnimInstance
	{
	public:
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_FF86BF7749F8707B753C9BB28EAFD18E; // 0x0340(0x0090)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_7E40A9C34B033ED3910326AA03CB3619; // 0x03D0(0x0060)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_BC50A0DA43AD743E02EB4AAF804610F6; // 0x0430(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_7012E4B54B148CE3A995E686F37CC809; // 0x0478(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_246DAA3649BBD4D671329E8D23CFBE2F; // 0x04C0(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_ECA1240C4E825464C51892886C9B0E01; // 0x0510(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_F5B759D0427A53CAAECCA69A514A0DCA; // 0x0590(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_A12208234EAEDE29677B6298056CF6AA; // 0x0610(0x0050)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_7B689378459B5C9210868D93163A2190;     // 0x0660(0x0058)
		struct FAnimNode_RotationOffsetBlendSpace                  AnimGraphNode_RotationOffsetBlendSpace_A44F9AD946BD5D4329353F94C7E62882; // 0x06B8(0x0118)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_41AD558A4B0CA239C4AD7A86BECE9626; // 0x07D0(0x00A0)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_35D8FDC3431B16FDB1DACCB99536FDB9;     // 0x0870(0x0058)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_D06984AD4E61567B30C1C6BDF00501D6; // 0x08C8(0x0060)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_C026749542ABC46B549BA0AD6EB4028E; // 0x0928(0x0048)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_39BC807841E70CF7638F968EA9542E85; // 0x0970(0x0100)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_F06A6E5843CB7750E8C2499F7AAB80AB; // 0x0A70(0x00D0)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_0A07221C47150231CEBA05989E491256; // 0x0B40(0x0048)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_51543B044818AB1A255F0596B347A38D; // 0x0B88(0x0048)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_EBB615BD44EB698C1739638EF44BCB66; // 0x0BD0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_91FBD3BD4D1E7128D7B64588393E75D3; // 0x0C50(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_556DE73A4E707562E3B0BCA257FC1A27; // 0x0CA0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9470FDAD41F70F5BA32716BE8D952CA7; // 0x0D20(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_FD650C904FC7EFA01587D289F46A8A4A; // 0x0D70(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_7F8BE4174DFE9E650D76A5B1BF823AEC; // 0x0DF0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_2AEFAA124DCB7F16C90E8D909CDB5B24; // 0x0E70(0x0050)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_1273F8674C895306B4D4AE9835B5C35F; // 0x0EC0(0x0100)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_4E9CEFB24B5B73705706BCBC7D0741A7; // 0x0FC0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_D0FB361A474C4BE436DBABB3E65F636B; // 0x1040(0x0050)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_0B13E4D948430A3E8F9179B2A1C2943E; // 0x1090(0x0100)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_98196DFD47748B539CE554BBAC11A3A9;     // 0x1190(0x0058)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_A8C3C8C94B963398CEE00AB43DB4BE03; // 0x11E8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_13E6328D4D9F48B5B5DD78B8E6BDA169; // 0x1268(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_0770C9E145D642F327AC509B41736BE2; // 0x12B8(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_D1E988554AC0373879F917AAC2FAB152; // 0x1338(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_F8CA1DE443D32EA9A5BA8BB8DA75D87D; // 0x13B8(0x0050)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_EE54DB984677DE45E521B19B31528830; // 0x1408(0x0050)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_6A2A0AA446FBC982953778A257604003; // 0x1458(0x00A0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9D13880D4A6D09B58D30E5B2F4FCE77C; // 0x14F8(0x0050)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_D2B0ADA04648B59DB2D4308ACD449F10; // 0x1548(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_4DFC7C3845631E2ACE633AA0116D8063; // 0x1598(0x0080)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_0C5807324E4FFE1350123189D0EB70D3;     // 0x1618(0x0058)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_D0444806431E6DA64E9AE2AFF30C7469;     // 0x1670(0x0058)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_842E80474F26231326E786B60EFC8268; // 0x16C8(0x0080)
		struct FAnimNode_MultiFabrik                               AnimGraphNode_MultiFabrik_8DB78B7E43EC96574D4921A4797BC261; // 0x1748(0x0068)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_83FBBB054203DAD789F74BA165A2A0FB; // 0x17B0(0x0080)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_2FC9F116491D1F07BF4292B85BBF0485; // 0x1830(0x0048)
		unsigned char                                              UnknownData_RSN5[0x8];                                   // 0x1878(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_E360668B4B335B9F46DC04BAD7B40E27; // 0x1880(0x00D0)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_FB8A227148C9C2643271CCA82DC4A28B; // 0x1950(0x0080)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_9AA7006349FCCC455FE29CA7CFD903FF; // 0x19D0(0x0060)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_B578714542788833DCA20C986B920B6F; // 0x1A30(0x00D0)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_A7A49ECD428AEA87C71CFE82D64A9B1F; // 0x1B00(0x0048)
		struct FAnimNode_MultiFabrik                               AnimGraphNode_MultiFabrik_AAAC4B3B4D9E680ECBD0A89CFDD6FD5E; // 0x1B48(0x0068)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_1259B0864CAB794FFF5A90B2DB9DF5E9; // 0x1BB0(0x00D0)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_A3C1E18F41B0CA30A783329B5B98124B; // 0x1C80(0x0048)
		unsigned char                                              UnknownData_4B27[0x8];                                   // 0x1CC8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_1D1B659E409CD38175382FB68A99254F; // 0x1CD0(0x00D0)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_570D0A6D4DA5357D12B4D58C23EE530B; // 0x1DA0(0x00D0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_8BD8916F4F22606B43ECD58383DC25C1; // 0x1E70(0x0050)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_AB267268447F16582E884BA2251AE17C; // 0x1EC0(0x0050)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_3381ECA747D2CAAEB84FD6A5FD737B94;     // 0x1F10(0x0058)
		struct FAnimNode_ModifyBones                               AnimGraphNode_ModifyBones_C8775B5F40BCE761F239F6BC0F0DD0B5; // 0x1F68(0x0060)
		struct FAnimNode_ModifyBones                               AnimGraphNode_ModifyBones_166E88DE46032C4F5B6FFFA617DEC520; // 0x1FC8(0x0060)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_0DBC818447FFABF5EA50328FB851DFE3; // 0x2028(0x0080)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_E8D48D564DB4C3D18FACA4B797C27888; // 0x20A8(0x0060)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_071B3810488EE2A6EBF46D871BC75696; // 0x2108(0x0048)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_7B60D41A4B1D3D8C1B5E7E8163B6F01F; // 0x2150(0x0080)
		struct FAnimNode_RotationOffsetBlendSpace                  AnimGraphNode_RotationOffsetBlendSpace_628E1E24493CAE0F6E0C7C933ECE8445; // 0x21D0(0x0118)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_97A82C3842DF6508811CBFABCBC37F83; // 0x22E8(0x0048)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_A87A27D846DF93556328108D19D0CC71; // 0x2330(0x0060)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_262954744E0D33CD773F5589CDAC9201; // 0x2390(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_B9966DA64A994892B9F194AF313B4AC7; // 0x23D8(0x0048)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_CD58F2714E34EB0E6A03519CBC94A608; // 0x2420(0x0080)
		struct FAnimNode_BlendListByInt                            AnimGraphNode_BlendListByInt_AF8F4F684BDDAA20E6C3E0944E287B38; // 0x24A0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_062C2DF14D0525445947EF87B9F31549; // 0x2520(0x0050)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_A4F4C6AA42EA3D8949909AACB5CC3B99; // 0x2570(0x0050)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_1FDC6B264D2A0FC00A9E85BB74D97B22; // 0x25C0(0x0050)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_40C015634D94E0B062AD3485F0BA60F9; // 0x2610(0x00D0)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_C3AF1F7E4BB9F06F6A3F44A2389E8CBC; // 0x26E0(0x0048)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_2D0DC922479729B0C77590A0F58F68B5; // 0x2728(0x0048)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_D00E36134486952B6FC683AF3C932862; // 0x2770(0x0080)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_607375834F040FCEBFBC3084558B824D; // 0x27F0(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_B9291E804A926E345C152AA622AA0C4B;     // 0x2838(0x0058)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_8AD6961F48B4CA0A14FD6280AAD26940; // 0x2890(0x0070)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_A9EB7FF14D5E7BB47D175DB8AA2E9159; // 0x2900(0x0080)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_FEE9EE70477EF8B02DAA4F8D8826CB02; // 0x2980(0x0060)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_71229BFB4E2CC041F7977BB25425515C; // 0x29E0(0x0050)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_5EFB393E47EB1635EFA03094D84E02D4; // 0x2A30(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_69723AD14E54CA7D10FF7899256652E5; // 0x2A78(0x0048)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_E6B944074706C39D2C5988B0F2E15851; // 0x2AC0(0x0080)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_4C48BBF04523CA692532A4BDEB2454E0; // 0x2B40(0x0048)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_65B98ADF4DA1AE5E28E38BB7F078ED98; // 0x2B88(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_386841C24418D754C69826851579BF6E; // 0x2C08(0x0050)
		struct FAnimNode_RotationOffsetBlendSpace                  AnimGraphNode_RotationOffsetBlendSpace_F37F6E364733EA96DE10549DB5DA7970; // 0x2C58(0x0118)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_853DBF524B4AC115C6FAE2A4A56A2027; // 0x2D70(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_ECF503894797EA5708BAC0BD24F3BF37; // 0x2DC0(0x0080)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_88A6A0A94DDB7C022D4ED3A1541AAC52; // 0x2E40(0x0070)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_2C3603984EB7D8F6535AF2B1AB4EAD4C; // 0x2EB0(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_626584B448D31E19750278A0D43665CE; // 0x2F00(0x0080)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_E543BFF8400546FB3C2AD2B38F70F440; // 0x2F80(0x0060)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_1C5993A54AD38416F15F55AA113FE7FC; // 0x2FE0(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_D6824F7041510B4D32D9C9973C35BE9C; // 0x3028(0x0048)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_E47FFB3B49405638F054698D19C62400; // 0x3070(0x0060)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_72D41C584300B27EE2CD98B8596B1D79; // 0x30D0(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_F44C55F84D95F0FC5753D7B86929B85C; // 0x3118(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_1446309548B37547CAEB58BB8D13FB8F;     // 0x3160(0x0058)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_5B5E0810457105C10E8C98A5E31974BA; // 0x31B8(0x00A0)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_677DF9E344C209C6246406A12725D46D; // 0x3258(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_62479E3E4A0B46DC55941CB0E28F8AF4; // 0x32D8(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_5C58F9EB40CDC26D68D6139AD4E90390; // 0x3328(0x0080)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_8EB8620449A66ADA12577BBFF9B4ADCB; // 0x33A8(0x0060)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_CAB64D6A4C14B09E331CDD8CF0C06D93; // 0x3408(0x0048)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_CC2A571D470F7BA55B7A82A97F604E15; // 0x3450(0x00A0)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_B0B97BF949F3214A7674FCAEF22BC30C; // 0x34F0(0x0048)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_249554A8478EE07718E0B9905D374600; // 0x3538(0x0060)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_9CB10E854FEDEB8E5EC466AA60B96CCB; // 0x3598(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_61859A6C4805A3E2F81B9DA81098857F; // 0x35E0(0x0048)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_CAEC392747DF89DBD8FFB5912F820BC6; // 0x3628(0x0080)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_BFC18780495FC1E930B25C95E47C30ED; // 0x36A8(0x00A0)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_3455BB9C400CBC5B7A51CD83101AEF8D; // 0x3748(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_633B1D28478F11390676698B17E885AB; // 0x3790(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_32C9728C45557FA4B74BAE86BDED6E29; // 0x37E0(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_DFD72034478D9BAB85014FA918BCF985; // 0x3860(0x0080)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_FBF47479444057112D301CBD18C9C755; // 0x38E0(0x0100)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_2075AA844949A18E0F908DAA62E732F7; // 0x39E0(0x0060)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_3CB161A84BFCC1D4CCEAB1AB9124FE93; // 0x3A40(0x0080)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_07AAC19E447039D5C069DAA85FCE266D; // 0x3AC0(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_95B870CE4825FA520201D49324A81692; // 0x3B08(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_9A8D334A4EF9C1EDB66680B897A86180; // 0x3B50(0x0048)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_443F8BE5479884B6260C9F81AF0C3668; // 0x3B98(0x00A0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_AC0A909746FE4BB532BCFBAAC945D78D; // 0x3C38(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_Root_8CFCF04445465B4B76D012B41C09901A;     // 0x3C88(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_F9CC3B374303EF6D580CDD889C8BC5D3; // 0x3CD0(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_CD304AF54F7DC29AEF5B8C8B6F2C3943; // 0x3D18(0x0048)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_93E34FE54E7C22EA1DD64E87C8FB4E5A; // 0x3D60(0x0060)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_15E6B7CD498CF377E011E1A34C03C867; // 0x3DC0(0x0048)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_B2138A24429B78E50078F8808B996776; // 0x3E08(0x0070)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_88DD6B524B5448A55E24DBBD3D552524; // 0x3E78(0x0080)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_1CB5D1B94C2F977DBE7457B1EF264198; // 0x3EF8(0x0060)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_A332B39147025300B904799F757B7C68; // 0x3F58(0x0100)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_3C1775364E5F204F562106A240017EC4; // 0x4058(0x0100)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_0DC160784A62D5968117D2957FA417FD; // 0x4158(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_8B507C824BCEB9733667DF8169CD402C; // 0x41D8(0x0080)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_F68D3E2C44E2E38E5841B58EA67B564B; // 0x4258(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_211758AA43C83DCE6A907F9352FC4DE5; // 0x42A0(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_939AFA5D49AE5F90D0AF6ABFC45543E3; // 0x42E8(0x0048)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_C5E368E742EB49C723169EBE32ED7164; // 0x4330(0x00A0)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_32AAA0074945C4E14F5F678C7131DE39; // 0x43D0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_F72FED93430DD09CF916FAB3BC15F278; // 0x4450(0x0050)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_D7D5120F4ADD23314A6899B777316B45; // 0x44A0(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_3F56F06147401793405D638AB564CD14;     // 0x44E8(0x0058)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_B2061EBD4897AD945C56D9B128215E51; // 0x4540(0x0048)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_1A1AA0AC4F5574DA6220318F21BB91D5; // 0x4588(0x00A0)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_603DE793450ABC058EAC0C842A094D6A; // 0x4628(0x0080)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_1D9C4D994A046559484601840F16784A; // 0x46A8(0x0048)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_9C975FA4438E49D37296769160225C14; // 0x46F0(0x0100)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_24D6F0A045D17884EC333A93C92118D3; // 0x47F0(0x0080)
		struct FAnimNode_BlendListByInt                            AnimGraphNode_BlendListByInt_B321878D41887BC8AE76B6B4FDA631D9; // 0x4870(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_8D57F4494F9F04210F96BCB3A520B16D; // 0x48F0(0x0050)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_17E3268840C110C4CD693EB51C2D4C92; // 0x4940(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_33CA490D435FB4E882FB919954E63B20; // 0x4990(0x0080)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_AB01CCD748A168C353363989ADA9693D; // 0x4A10(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_0370716341F6049C213F9883A624AC28; // 0x4A58(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_9FE0E71D46AD78B7531017B72BB950C7; // 0x4AA0(0x0048)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_023F3BCF4DF53D0B8910C88D1CFB0D3D; // 0x4AE8(0x00A0)
		unsigned char                                              PhysicsMode;                                             // 0x4B88(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bSprinting;                                              // 0x4B89(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bMoving;                                                 // 0x4B8A(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_X9OG[0x1];                                   // 0x4B8B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Direction;                                               // 0x4B8C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      AimPitch;                                                // 0x4B90(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      AimYaw;                                                  // 0x4B94(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      RightLeft;                                               // 0x4B98(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      ForwardBack;                                             // 0x4B9C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FRotator                                            RootRotOffset;                                           // 0x4BA0(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bTurning;                                                // 0x4BAC(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_S7S7[0x3];                                   // 0x4BAD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      TurnSpeed;                                               // 0x4BB0(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bCrouched;                                               // 0x4BB4(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bProne;                                                  // 0x4BB5(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_ONYE[0x2];                                   // 0x4BB6(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             RootLocOffset;                                           // 0x4BB8(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      MovementAnimRate;                                        // 0x4BC4(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsRiding;                                               // 0x4BC8(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_SDAV[0x7];                                   // 0x4BC9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimSequence*                                       RidingAnimSeq;                                           // 0x4BD0(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class UAnimSequence*                                       RidingMoveAnimSeq;                                       // 0x4BD8(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      RidingDinoSpeedRatio;                                    // 0x4BE0(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bRidingIsDinoMoving;                                     // 0x4BE4(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bBlinking;                                               // 0x4BE5(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_6XU2[0x2];                                   // 0x4BE6(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		double                                                     LastTimeSwimmingDouble;                                  // 0x4BE8(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsCarried;                                              // 0x4BF0(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseAlternateAimOffset;                                  // 0x4BF1(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_MTR0[0x2];                                   // 0x4BF2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AimOffsetYawSpeed;                                       // 0x4BF4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bIsClimbing;                                             // 0x4BF8(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_Z2JL[0x3];                                   // 0x4BF9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    ClimbingInt;                                             // 0x4BFC(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      MovementSpeedFastPower;                                  // 0x4C00(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      MovementSpeedFastStartPowerRatio;                        // 0x4C04(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      CurrentAimPitchBlend;                                    // 0x4C08(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseTargetingAnim;                                       // 0x4C0C(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsTargeting;                                            // 0x4C0D(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bDisableAimInProne;                                      // 0x4C0E(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseBallistaAimOffset;                                   // 0x4C0F(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      BallistaYaw;                                             // 0x4C10(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FVector                                             LastLadderLocation;                                      // 0x4C14(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class UAnimSequence*                                       AlternateStandingAnimSeq;                                // 0x4C20(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseAlternateStandingAnim;                               // 0x4C28(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_QFW6[0x7];                                   // 0x4C29(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimSequence*                                       AdditiveStandingAnimSeq;                                 // 0x4C30(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      AdditiveLoopAnimWeight;                                  // 0x4C38(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseAdditiveStandingAnim;                                // 0x4C3C(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_4HPI[0x3];                                   // 0x4C3D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AdditiveStandingBlendIn;                                 // 0x4C40(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      AdditiveStandingBlendOut;                                // 0x4C44(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      AlternateStandingBlendIn;                                // 0x4C48(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      AlternateStandingBlendOut;                               // 0x4C4C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsCarriedAsPassenger;                                   // 0x4C50(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_LVMM[0x3];                                   // 0x4C51(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AimOffsetAlpha;                                          // 0x4C54(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsGliding;                                              // 0x4C58(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_SZ13[0x7];                                   // 0x4C59(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAnimSequence*                                       GlidingAnimSeq;                                          // 0x4C60(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUsingMountedWeapon;                                     // 0x4C68(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bCharacterAdditiveAnimationIsNonAdditive;                // 0x4C69(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseAltBlendSpace_Falling;                               // 0x4C6A(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseAltBlendSpace_Swimming;                              // 0x4C6B(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bHasFistsEquipped;                                       // 0x4C6C(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       HasValidClimbingTarget;                                  // 0x4C6D(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_QWAN[0x2];                                   // 0x4C6E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ClimbingFallingLeftRight;                                // 0x4C70(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      ClimbingFallingForwardBack;                              // 0x4C74(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsUsingGliderSuit;                                      // 0x4C78(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsUsingGliderSuit_Diving;                               // 0x4C79(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_FS68[0x2];                                   // 0x4C7A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      GliderSuit_LeftRight;                                    // 0x4C7C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      GliderSuit_UpDown;                                       // 0x4C80(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      RequiredGlidingRotaitonDeltaToPlayTurnAnims;             // 0x4C84(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      GliderSuitTurnInterpSpeed;                               // 0x4C88(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FRotator                                            GliderSuit_RemoteClientDesiredRotation;                  // 0x4C8C(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bClimbingPickDefaultBackToFallingBlends;                 // 0x4C98(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_QS60[0x7];                                   // 0x4C99(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             NewEventDispatcher;                                      // 0x4CA0(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable
		class UBlendSpace*                                         OverrideBlendSpace;                                      // 0x4CB0(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class APrimalCharacter*                                    primalChar;                                              // 0x4CB8(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor
		int32_t                                                    IdleAnimIndex;                                           // 0x4CC0(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Subtract_FloatFloat_ReturnValue;                // 0x4CC4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Subtract_FloatFloat_ReturnValue2;               // 0x4CC8(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue;                 // 0x4CCC(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_1JSS[0x3];                                   // 0x4CCD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_Subtract_FloatFloat_ReturnValue3;               // 0x4CD0(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue;                // 0x4CD4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue;                    // 0x4CD8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_C77W[0x3];                                   // 0x4CD9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_Subtract_FloatFloat_ReturnValue4;               // 0x4CDC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		double                                                     CallFunc_GetGameTimeInSeconds_ReturnValue;               // 0x4CE0(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_EqualEqual_ByteByte_ReturnValue;                // 0x4CE8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_EqualEqual_ByteByte_ReturnValue2;               // 0x4CE9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsDedicatedServer_ReturnValue;                  // 0x4CEA(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue2;                // 0x4CEB(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_CDJ0[0x4];                                   // 0x4CEC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		double                                                     CallFunc_Subtract_DoubleDouble_ReturnValue;              // 0x4CF0(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue2;               // 0x4CF8(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Conv_DoubleToFloat_ReturnValue;                 // 0x4CFC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Subtract_FloatFloat_ReturnValue5;               // 0x4D00(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue3;                // 0x4D04(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue4;                // 0x4D05(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_0UUW[0x2];                                   // 0x4D06(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue3;               // 0x4D08(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Add_FloatFloat_ReturnValue;                     // 0x4D0C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsDedicatedServer_ReturnValue2;                 // 0x4D10(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue;                        // 0x4D11(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_TDFX[0x2];                                   // 0x4D12(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_GetWorldDeltaSeconds_ReturnValue;               // 0x4D14(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue4;               // 0x4D18(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Lerp_ReturnValue;                               // 0x4D1C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Add_FloatFloat_ReturnValue2;                    // 0x4D20(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_FClamp_ReturnValue;                             // 0x4D24(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_GetWorldDeltaSeconds_ReturnValue2;              // 0x4D28(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue5;               // 0x4D2C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Add_FloatFloat_ReturnValue3;                    // 0x4D30(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_FClamp_ReturnValue2;                            // 0x4D34(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsDedicatedServer_ReturnValue3;                 // 0x4D38(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_ZQ5N[0x3];                                   // 0x4D39(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_GetWorldDeltaSeconds_ReturnValue3;              // 0x4D3C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue6;               // 0x4D40(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue7;               // 0x4D44(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue2;                       // 0x4D48(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_TIU5[0x7];                                   // 0x4D49(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class APawn*                                               CallFunc_TryGetPawnOwner_ReturnValue;                    // 0x4D50(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      K2Node_Event_DeltaTimeX;                                 // 0x4D58(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_GJ3K[0x4];                                   // 0x4D5C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AShooterCharacter*                                   K2Node_DynamicCast_AsShooterCharacter;                   // 0x4D60(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast_CastSuccess;                          // 0x4D68(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_AQU8[0x7];                                   // 0x4D69(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class APrimalCharacter*                                    K2Node_DynamicCast_AsPrimalCharacter;                    // 0x4D70(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast2_CastSuccess;                         // 0x4D78(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_GetAdditiveStandingAnimNonAdditive_ReturnValue; // 0x4D79(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_U64L[0x2];                                   // 0x4D7A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRotator                                            CallFunc_K2_GetActorRotation_ReturnValue;                // 0x4D7C(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FVector                                             CallFunc_GetVelocity_ReturnValue;                        // 0x4D88(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FRotator                                            CallFunc_NegateRotator_ReturnValue;                      // 0x4D94(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FRotator                                            CallFunc_Conv_VectorToRotator_ReturnValue;               // 0x4DA0(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FRotator                                            CallFunc_GetAimOffsets_RootRotOffset;                    // 0x4DAC(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_GetAimOffsets_TheRootYawSpeed;                  // 0x4DB8(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FVector                                             CallFunc_GetAimOffsets_RootLocOffset;                    // 0x4DBC(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FRotator                                            CallFunc_GetAimOffsets_ReturnValue;                      // 0x4DC8(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FRotator                                            CallFunc_ComposeRotators_ReturnValue;                    // 0x4DD4(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakRot_Pitch;                                 // 0x4DE0(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakRot_Yaw;                                   // 0x4DE4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakRot_Roll;                                  // 0x4DE8(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FVector                                             CallFunc_GetForwardVector_ReturnValue;                   // 0x4DEC(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Divide_FloatFloat_ReturnValue;                  // 0x4DF8(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_X;                                  // 0x4DFC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Y;                                  // 0x4E00(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Z;                                  // 0x4E04(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue8;               // 0x4E08(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue9;               // 0x4E0C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Add_FloatFloat_ReturnValue4;                    // 0x4E10(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Add_FloatFloat_ReturnValue5;                    // 0x4E14(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue10;              // 0x4E18(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Divide_FloatFloat_ReturnValue2;                 // 0x4E1C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Add_FloatFloat_ReturnValue6;                    // 0x4E20(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue11;              // 0x4E24(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Add_FloatFloat_ReturnValue7;                    // 0x4E28(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakRot_Pitch2;                                // 0x4E2C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakRot_Yaw2;                                  // 0x4E30(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakRot_Roll2;                                 // 0x4E34(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Subtract_FloatFloat_ReturnValue6;               // 0x4E38(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
