#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Buff_MinigunHUD.Buff_MinigunHUD_C.DrawBuffFloatingHUD
	 */
	struct ABuff_MinigunHUD_C_DrawBuffFloatingHUD_Params
	{
	public:
		int32_t                                                    BuffIndex;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_AW1Z[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AShooterHUD*                                         HUD;                                                     // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      CenterX;                                                 // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      CenterY;                                                 // 0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      DrawScale;                                               // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Buff_MinigunHUD.Buff_MinigunHUD_C.BPGetHUDElements
	 */
	struct ABuff_MinigunHUD_C_BPGetHUDElements_Params
	{
	public:
		class APlayerController*                                   ForPC;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		TArray<struct FHUDElement>                                 OutElements;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor)
	};

	/**
	 * Function Buff_MinigunHUD.Buff_MinigunHUD_C.UserConstructionScript
	 */
	struct ABuff_MinigunHUD_C_UserConstructionScript_Params
	{	};

	/**
	 * Function Buff_MinigunHUD.Buff_MinigunHUD_C.ReceiveTick
	 */
	struct ABuff_MinigunHUD_C_ReceiveTick_Params
	{
	public:
		float                                                      DeltaSeconds;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Buff_MinigunHUD.Buff_MinigunHUD_C.ReceiveBeginPlay
	 */
	struct ABuff_MinigunHUD_C_ReceiveBeginPlay_Params
	{	};

	/**
	 * Function Buff_MinigunHUD.Buff_MinigunHUD_C.ExecuteUbergraph_Buff_MinigunHUD
	 */
	struct ABuff_MinigunHUD_C_ExecuteUbergraph_Buff_MinigunHUD_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
