#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function DinoBlueprintBase_RootBoneName.DinoBlueprintBase_RootBoneName_C.BlueprintPlayAnimationEvent
	 */
	struct UDinoBlueprintBase_RootBoneName_C_BlueprintPlayAnimationEvent_Params
	{
	public:
		class UAnimMontage*                                        AnimationMontage;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      PlayRate;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      playedAnimLength;                                        // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function DinoBlueprintBase_RootBoneName.DinoBlueprintBase_RootBoneName_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_AnimGraphNode_BlendListByBool_38F8792D4D32CFE5BFA190BF08221493
	 */
	struct UDinoBlueprintBase_RootBoneName_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_AnimGraphNode_BlendListByBool_38F8792D4D32CFE5BFA190BF08221493_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootBoneName.DinoBlueprintBase_RootBoneName_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_AnimGraphNode_ModifyBone_56222541459155F8905484836A2BC9F8
	 */
	struct UDinoBlueprintBase_RootBoneName_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_AnimGraphNode_ModifyBone_56222541459155F8905484836A2BC9F8_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootBoneName.DinoBlueprintBase_RootBoneName_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_AnimGraphNode_BlendListByBool_4C8A824841EB977EF5EEF79FC0F2DC67
	 */
	struct UDinoBlueprintBase_RootBoneName_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_AnimGraphNode_BlendListByBool_4C8A824841EB977EF5EEF79FC0F2DC67_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootBoneName.DinoBlueprintBase_RootBoneName_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_AnimGraphNode_BlendListByBool_2A69076B409A6A5A4503CBB734CDA6E8
	 */
	struct UDinoBlueprintBase_RootBoneName_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_AnimGraphNode_BlendListByBool_2A69076B409A6A5A4503CBB734CDA6E8_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootBoneName.DinoBlueprintBase_RootBoneName_C.BlueprintUpdateAnimation
	 */
	struct UDinoBlueprintBase_RootBoneName_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function DinoBlueprintBase_RootBoneName.DinoBlueprintBase_RootBoneName_C.ExecuteUbergraph_DinoBlueprintBase_RootBoneName
	 */
	struct UDinoBlueprintBase_RootBoneName_C_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
