#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function DinoBlueprintBase_RootTransformIK_FullFlight.DinoBlueprintBase_RootTransformIK_FullFlight_C.BlueprintPlayAnimationEvent
	 */
	struct UDinoBlueprintBase_RootTransformIK_FullFlight_C_BlueprintPlayAnimationEvent_Params
	{
	public:
		class UAnimMontage*                                        AnimationMontage;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      PlayRate;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      playedAnimLength;                                        // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function DinoBlueprintBase_RootTransformIK_FullFlight.DinoBlueprintBase_RootTransformIK_FullFlight_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_AnimGraphNode_SequencePlayer_861B8C9A48B17123EA662587129D1B0E
	 */
	struct UDinoBlueprintBase_RootTransformIK_FullFlight_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_AnimGraphNode_SequencePlayer_861B8C9A48B17123EA662587129D1B0E_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootTransformIK_FullFlight.DinoBlueprintBase_RootTransformIK_FullFlight_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_AnimGraphNode_SequencePlayer_50DE56E948A16B9770145DA206C68925
	 */
	struct UDinoBlueprintBase_RootTransformIK_FullFlight_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_AnimGraphNode_SequencePlayer_50DE56E948A16B9770145DA206C68925_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootTransformIK_FullFlight.DinoBlueprintBase_RootTransformIK_FullFlight_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_AnimGraphNode_SequencePlayer_F3DCD1CD4592E2B0312D8A90CC4830E4
	 */
	struct UDinoBlueprintBase_RootTransformIK_FullFlight_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_AnimGraphNode_SequencePlayer_F3DCD1CD4592E2B0312D8A90CC4830E4_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootTransformIK_FullFlight.DinoBlueprintBase_RootTransformIK_FullFlight_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_AnimGraphNode_SequencePlayer_54606F22470CD4B7DB94329CD2D8C166
	 */
	struct UDinoBlueprintBase_RootTransformIK_FullFlight_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_AnimGraphNode_SequencePlayer_54606F22470CD4B7DB94329CD2D8C166_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootTransformIK_FullFlight.DinoBlueprintBase_RootTransformIK_FullFlight_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_AnimGraphNode_SequencePlayer_CD0078114CAA20D2FE5ACBA15186C1C6
	 */
	struct UDinoBlueprintBase_RootTransformIK_FullFlight_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_AnimGraphNode_SequencePlayer_CD0078114CAA20D2FE5ACBA15186C1C6_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootTransformIK_FullFlight.DinoBlueprintBase_RootTransformIK_FullFlight_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_AnimGraphNode_SequencePlayer_B87F7E5D49707F8F5FFC3384A2AAD3CB
	 */
	struct UDinoBlueprintBase_RootTransformIK_FullFlight_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_AnimGraphNode_SequencePlayer_B87F7E5D49707F8F5FFC3384A2AAD3CB_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootTransformIK_FullFlight.DinoBlueprintBase_RootTransformIK_FullFlight_C.BlueprintUpdateAnimation
	 */
	struct UDinoBlueprintBase_RootTransformIK_FullFlight_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function DinoBlueprintBase_RootTransformIK_FullFlight.DinoBlueprintBase_RootTransformIK_FullFlight_C.ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight
	 */
	struct UDinoBlueprintBase_RootTransformIK_FullFlight_C_ExecuteUbergraph_DinoBlueprintBase_RootTransformIK_FullFlight_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
