#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function DinoBlueprintBase_RootBoneName_ZipLine.DinoBlueprintBase_RootBoneName_ZipLine_C.GetZiplineBlendY
	 */
	struct UDinoBlueprintBase_RootBoneName_ZipLine_C_GetZiplineBlendY_Params
	{
	public:
		class APrimalDinoCharacter*                                Dino;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      BlendY;                                                  // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_M2H5[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

	/**
	 * Function DinoBlueprintBase_RootBoneName_ZipLine.DinoBlueprintBase_RootBoneName_ZipLine_C.BlueprintPlayAnimationEvent
	 */
	struct UDinoBlueprintBase_RootBoneName_ZipLine_C_BlueprintPlayAnimationEvent_Params
	{
	public:
		class UAnimMontage*                                        AnimationMontage;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      PlayRate;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      playedAnimLength;                                        // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function DinoBlueprintBase_RootBoneName_ZipLine.DinoBlueprintBase_RootBoneName_ZipLine_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_ZipLine_AnimGraphNode_BlendListByBool_3ED13717438C56FC63E209A85B1420C1
	 */
	struct UDinoBlueprintBase_RootBoneName_ZipLine_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_ZipLine_AnimGraphNode_BlendListByBool_3ED13717438C56FC63E209A85B1420C1_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootBoneName_ZipLine.DinoBlueprintBase_RootBoneName_ZipLine_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_ZipLine_AnimGraphNode_ModifyBone_D21CDEDF484976322F5FCEB70F39D181
	 */
	struct UDinoBlueprintBase_RootBoneName_ZipLine_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_ZipLine_AnimGraphNode_ModifyBone_D21CDEDF484976322F5FCEB70F39D181_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootBoneName_ZipLine.DinoBlueprintBase_RootBoneName_ZipLine_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_ZipLine_AnimGraphNode_BlendListByBool_E82445754652FDD46FC314B3A264BAF9
	 */
	struct UDinoBlueprintBase_RootBoneName_ZipLine_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_ZipLine_AnimGraphNode_BlendListByBool_E82445754652FDD46FC314B3A264BAF9_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootBoneName_ZipLine.DinoBlueprintBase_RootBoneName_ZipLine_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_ZipLine_AnimGraphNode_BlendListByBool_CFED515446982B7C3EC317BF21286C4A
	 */
	struct UDinoBlueprintBase_RootBoneName_ZipLine_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_ZipLine_AnimGraphNode_BlendListByBool_CFED515446982B7C3EC317BF21286C4A_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootBoneName_ZipLine.DinoBlueprintBase_RootBoneName_ZipLine_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_ZipLine_AnimGraphNode_BlendListByBool_68E7573C4CC7B5430F2C8F907C8CC387
	 */
	struct UDinoBlueprintBase_RootBoneName_ZipLine_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_ZipLine_AnimGraphNode_BlendListByBool_68E7573C4CC7B5430F2C8F907C8CC387_Params
	{	};

	/**
	 * Function DinoBlueprintBase_RootBoneName_ZipLine.DinoBlueprintBase_RootBoneName_ZipLine_C.BlueprintUpdateAnimation
	 */
	struct UDinoBlueprintBase_RootBoneName_ZipLine_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function DinoBlueprintBase_RootBoneName_ZipLine.DinoBlueprintBase_RootBoneName_ZipLine_C.ExecuteUbergraph_DinoBlueprintBase_RootBoneName_ZipLine
	 */
	struct UDinoBlueprintBase_RootBoneName_ZipLine_C_ExecuteUbergraph_DinoBlueprintBase_RootBoneName_ZipLine_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
