#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function DinoBlueprintBase_MovementBlendSpace_Zipline.DinoBlueprintBase_MovementBlendSpace_Zipline_C.BlueprintPlayAnimationEvent
	 */
	struct UDinoBlueprintBase_MovementBlendSpace_Zipline_C_BlueprintPlayAnimationEvent_Params
	{
	public:
		class UAnimMontage*                                        AnimationMontage;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      PlayRate;                                                // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      playedAnimLength;                                        // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function DinoBlueprintBase_MovementBlendSpace_Zipline.DinoBlueprintBase_MovementBlendSpace_Zipline_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_MovementBlendSpace_Zipline_AnimGraphNode_ModifyBone_F2D3ACB3431B58836261D88158DA2F6C
	 */
	struct UDinoBlueprintBase_MovementBlendSpace_Zipline_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_MovementBlendSpace_Zipline_AnimGraphNode_ModifyBone_F2D3ACB3431B58836261D88158DA2F6C_Params
	{	};

	/**
	 * Function DinoBlueprintBase_MovementBlendSpace_Zipline.DinoBlueprintBase_MovementBlendSpace_Zipline_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_MovementBlendSpace_Zipline_AnimGraphNode_BlendListByBool_AB3B397E4D48BF2B557FD981F1CBAD39
	 */
	struct UDinoBlueprintBase_MovementBlendSpace_Zipline_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_MovementBlendSpace_Zipline_AnimGraphNode_BlendListByBool_AB3B397E4D48BF2B557FD981F1CBAD39_Params
	{	};

	/**
	 * Function DinoBlueprintBase_MovementBlendSpace_Zipline.DinoBlueprintBase_MovementBlendSpace_Zipline_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_MovementBlendSpace_Zipline_AnimGraphNode_BlendListByBool_B4E458FB439CECAAF8A4688B720D7D21
	 */
	struct UDinoBlueprintBase_MovementBlendSpace_Zipline_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_MovementBlendSpace_Zipline_AnimGraphNode_BlendListByBool_B4E458FB439CECAAF8A4688B720D7D21_Params
	{	};

	/**
	 * Function DinoBlueprintBase_MovementBlendSpace_Zipline.DinoBlueprintBase_MovementBlendSpace_Zipline_C.EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_MovementBlendSpace_Zipline_AnimGraphNode_BlendListByBool_D67A7F884B88D7A0F6B827A6BF785351
	 */
	struct UDinoBlueprintBase_MovementBlendSpace_Zipline_C_EvaluateGraphExposedInputs_ExecuteUbergraph_DinoBlueprintBase_MovementBlendSpace_Zipline_AnimGraphNode_BlendListByBool_D67A7F884B88D7A0F6B827A6BF785351_Params
	{	};

	/**
	 * Function DinoBlueprintBase_MovementBlendSpace_Zipline.DinoBlueprintBase_MovementBlendSpace_Zipline_C.BlueprintUpdateAnimation
	 */
	struct UDinoBlueprintBase_MovementBlendSpace_Zipline_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function DinoBlueprintBase_MovementBlendSpace_Zipline.DinoBlueprintBase_MovementBlendSpace_Zipline_C.ExecuteUbergraph_DinoBlueprintBase_MovementBlendSpace_Zipline
	 */
	struct UDinoBlueprintBase_MovementBlendSpace_Zipline_C_ExecuteUbergraph_DinoBlueprintBase_MovementBlendSpace_Zipline_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
