#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ExtinctionDayCycle_Interface.ExtinctionDayCycle_Interface_C.GetVar_KKArenaAscenscionLoc
	 */
	struct UExtinctionDayCycle_Interface_C_GetVar_KKArenaAscenscionLoc_Params
	{
	public:
		class AActor*                                              SSPoint;                                                 // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ExtinctionDayCycle_Interface.ExtinctionDayCycle_Interface_C.GetVar_DKArenaLoc
	 */
	struct UExtinctionDayCycle_Interface_C_GetVar_DKArenaLoc_Params
	{
	public:
		class AActor*                                              Value;                                                   // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ExtinctionDayCycle_Interface.ExtinctionDayCycle_Interface_C.GetVar_IsBossElectricalStormActive
	 */
	struct UExtinctionDayCycle_Interface_C_GetVar_IsBossElectricalStormActive_Params
	{
	public:
		bool                                                       Value;                                                   // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ExtinctionDayCycle_Interface.ExtinctionDayCycle_Interface_C.GetVar_KKArenaLoc
	 */
	struct UExtinctionDayCycle_Interface_C_GetVar_KKArenaLoc_Params
	{
	public:
		class AActor*                                              ServerPoint;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ExtinctionDayCycle_Interface.ExtinctionDayCycle_Interface_C.GetVar_FKArenaLoc
	 */
	struct UExtinctionDayCycle_Interface_C_GetVar_FKArenaLoc_Params
	{
	public:
		class AActor*                                              ServerPoint;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ExtinctionDayCycle_Interface.ExtinctionDayCycle_Interface_C.GetVar_IKArenaLoc
	 */
	struct UExtinctionDayCycle_Interface_C_GetVar_IKArenaLoc_Params
	{
	public:
		class AActor*                                              ServerPoint;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ExtinctionDayCycle_Interface.ExtinctionDayCycle_Interface_C.SetVar_Boss_ElectricalStormActive
	 */
	struct UExtinctionDayCycle_Interface_C_SetVar_Boss_ElectricalStormActive_Params
	{
	public:
		bool                                                       Value;                                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
