#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass FPV_TekPistol_AnimBP.FPV_TekPistol_AnimBP_C
	 * Size -> 0x0D9C (FullSize[0x10DC] - InheritedSize[0x0340])
	 */
	class UFPV_TekPistol_AnimBP_C : public UAnimInstance
	{
	public:
		struct FAnimNode_Root                                      AnimGraphNode_Root_4B97E29F419BD71965B1BC9B3E07791C;     // 0x0340(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_42F41B4F47C777324CC6BD850BFE1612;     // 0x0388(0x0058)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_7C74F70C4ECFF5974130828590EB2750; // 0x03E0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_539F24184EAFC42D47FF3CBA7D1D6CAC; // 0x0418(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_8FD16419469938AD47EE69BFB4BEAD53; // 0x0450(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_D5879DBB4E62804ECBA1FC94E00BF750; // 0x04A0(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_48BE00F14F5DFB9A613A75A62B765185; // 0x04E8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_99E4EAFF4F832A3E72CF4E8262A1E9DC; // 0x0538(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_ADD408E44B602D96A278FA8B61E00337; // 0x0580(0x0080)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_52ECC5C142C606EC6BDF96AFECFD73BA; // 0x0600(0x0070)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_B3300F4E49C44523FD0AF084B60E79FA; // 0x0670(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_3146132C4299489CF5EC34AF79535503; // 0x06A8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_6B731E954AEFFB7677AF64AA163C992F; // 0x06E0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_64F368EC4000A4D20938C3BB7FCC9A92; // 0x0718(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2C80AE0F436F84B28AF6C792705289D2; // 0x0750(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_4E18CD1141EE6D697F9EB79E350E6E83; // 0x0788(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_294F611F4F3F4BDCCCE587946A180868; // 0x07C0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_89A0DA3B4924859DCD3246A52523936C; // 0x07F8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_371B37EA498FFEBB78C8269E33CDE190; // 0x0830(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_7A39C7F64313184413C348B42E4D8187; // 0x0868(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_CB1BF33B437B1053DC84DF8A895FC0CC; // 0x08B8(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_778C6D2C4B363014810097AAF3B5FF02; // 0x0900(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_0D82BC3D4D499FA81B75C4B1AE8EE847; // 0x0950(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_B0BB1B2040C7E1E5A200EF91977D5450; // 0x0998(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_2B4396094E9CC3FAF59FF9847F5CA4E8; // 0x09E8(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_556363774B994AED720C3AB003B2F725; // 0x0A30(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_3D9728D445396129E18F3689FCFA1E88; // 0x0A80(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_4217D6644C5DAAFE9FE5ADA08778414A; // 0x0AC8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_DCBD98504398BD7575D915AA985613BC; // 0x0B18(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_D9342F824FE2B1121B8877B663D407C8; // 0x0B60(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_E7EACF4C413DECEE44F43EA68A213271; // 0x0BB0(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_E56B5C714C8BC6A8FA573EBB2C964FBF; // 0x0BF8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_F60879DF4E1ADFE4745FE58DB54A7972; // 0x0C48(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_693D10ED4D11844F91CDEA9E714191D5; // 0x0C90(0x0080)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_9481F87E4419CE880ADBC6BA241490C5; // 0x0D10(0x0070)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_239721674DF1EC913176FBA515F3C8CF; // 0x0D80(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_CBB467B545E6D143E27B9B898F9D86F0; // 0x0DB8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_848E1BC548B11725BD2ECFA4B2071000; // 0x0DF0(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_15D48E38482D538D98AECAA0F45E6627; // 0x0E28(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_75D4A77C4E1E599C33E1318A4B85F1D4; // 0x0E78(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_A46383DE482CD125A5BD84B50FC6C92E; // 0x0EC0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_976F45B243CB123905C729B1F5880384; // 0x0F10(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_703F628746826461A85AD28F918B9876; // 0x0F58(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_DA833D174A87A0AA3D79C6A86B246E76; // 0x0FA8(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_979CE2624145F7CF7CA28C89EF87F1EF; // 0x0FF0(0x0080)
		bool                                                       IsRunning;                                               // 0x1070(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsMoving;                                               // 0x1071(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsTargeting;                                             // 0x1072(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsFiring;                                                // 0x1073(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		int32_t                                                    FireMode;                                                // 0x1074(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       WasFiring;                                               // 0x1078(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_EqualEqual_IntInt_ReturnValue;                  // 0x1079(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NotEqual_IntInt_ReturnValue;                    // 0x107A(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NotEqual_IntInt_ReturnValue2;                   // 0x107B(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NotEqual_IntInt_ReturnValue3;                   // 0x107C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue;                        // 0x107D(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue2;                       // 0x107E(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue;                          // 0x107F(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue;      // 0x1080(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_LessEqual_FloatFloat_ReturnValue;               // 0x1084(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_RB2Q[0x3];                                   // 0x1085(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue2;     // 0x1088(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue;                    // 0x108C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_Y1HR[0x3];                                   // 0x108D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue3;     // 0x1090(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue2;                   // 0x1094(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_4562[0x3];                                   // 0x1095(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_GetAnimAssetPlayerTimeFromEnd_ReturnValue4;     // 0x1098(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_EqualEqual_IntInt_ReturnValue2;                 // 0x109C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue3;                   // 0x109D(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_8NLX[0x2];                                   // 0x109E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      K2Node_Event_DeltaTimeX;                                 // 0x10A0(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_GBUN[0x4];                                   // 0x10A4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              CallFunc_GetOwningActor_ReturnValue;                     // 0x10A8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_EqualEqual_IntInt_ReturnValue3;                 // 0x10B0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_NTP8[0x7];                                   // 0x10B1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AWeapTekPistol_C*                                    K2Node_DynamicCast_AsWeapTekPistol_C;                    // 0x10B8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast_CastSuccess;                          // 0x10C0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_Y0CF[0x7];                                   // 0x10C1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AShooterCharacter*                                   CallFunc_GetPawnOwner_ReturnValue;                       // 0x10C8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AShooterCharacter*                                   K2Node_DynamicCast_AsShooterCharacter;                   // 0x10D0(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast2_CastSuccess;                         // 0x10D8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsFiring_ReturnValue;                           // 0x10D9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsTargeting_ReturnValue;                        // 0x10DA(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsRunning_ReturnValue;                          // 0x10DB(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor

	public:
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_TekPistol_AnimBP_AnimGraphNode_TransitionResult_B3300F4E49C44523FD0AF084B60E79FA();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_TekPistol_AnimBP_AnimGraphNode_TransitionResult_3146132C4299489CF5EC34AF79535503();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_TekPistol_AnimBP_AnimGraphNode_TransitionResult_6B731E954AEFFB7677AF64AA163C992F();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_TekPistol_AnimBP_AnimGraphNode_TransitionResult_64F368EC4000A4D20938C3BB7FCC9A92();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_TekPistol_AnimBP_AnimGraphNode_TransitionResult_2C80AE0F436F84B28AF6C792705289D2();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_TekPistol_AnimBP_AnimGraphNode_TransitionResult_4E18CD1141EE6D697F9EB79E350E6E83();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_TekPistol_AnimBP_AnimGraphNode_TransitionResult_294F611F4F3F4BDCCCE587946A180868();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_TekPistol_AnimBP_AnimGraphNode_TransitionResult_89A0DA3B4924859DCD3246A52523936C();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_TekPistol_AnimBP_AnimGraphNode_TransitionResult_371B37EA498FFEBB78C8269E33CDE190();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_TekPistol_AnimBP_AnimGraphNode_TransitionResult_239721674DF1EC913176FBA515F3C8CF();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPV_TekPistol_AnimBP_AnimGraphNode_TransitionResult_CBB467B545E6D143E27B9B898F9D86F0();
		void BlueprintUpdateAnimation(float DeltaTimeX);
		void AnimNotify_StartedFiring();
		void ExecuteUbergraph_FPV_TekPistol_AnimBP(int32_t EntryPoint);
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
