#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass FPVBowWeaponAnimBP_Base.FPVBowWeaponAnimBP_Base_C
	 * Size -> 0x0C09 (FullSize[0x0F49] - InheritedSize[0x0340])
	 */
	class UFPVBowWeaponAnimBP_Base_C : public UAnimInstance
	{
	public:
		struct FAnimNode_Root                                      AnimGraphNode_Root_8B3E6A184D0F789C583A7A8BB5802D75;     // 0x0340(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_D4BCED4948943FB4708A8595D7A6895C;     // 0x0388(0x0058)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_AEF2BA5A4042F9D69C58BAA876B1F5A8; // 0x03E0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_70AAF5374540A980EDAFBFB4DCD12759; // 0x0418(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_369A22314C227388044F8A992A7B300E; // 0x0450(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_A63150474A7D240CB8EE1785CD69A22F; // 0x0488(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_BA50D6D14B502C2A3AB64CB47FD0E0FC; // 0x04C0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_C0765BF94BD666F6B17C03A709017E43; // 0x04F8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_215ECB794AEE51A41CF8AA97BFECC07C; // 0x0530(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_BDAF7B904BCA4A88C79DF296465BCC74; // 0x0568(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_C10CCAF54986B57937A9A5977CCE1001; // 0x05A0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2C6C975F49C178D864AB1388789D12DF; // 0x05D8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_63057C144C787BD24C8028A18994D903; // 0x0610(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_E3E30B02400E3D3329B3B895145F8A52; // 0x0648(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_14AB4FF54A5BBB81E639ADBE975D0560; // 0x0680(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1695A180497447D7F440CCA49CEA949A; // 0x06B8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1125554B4CA2977F6FA0F9A82AD1FAE4; // 0x06F0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_150C709B4AE479CB61D2028BEFB2D94C; // 0x0728(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_61886F45495D0A80E8098AB6E5030414; // 0x0760(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_0B23D42D41F4F17C6AF0E7947E7FD2E4; // 0x0798(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_895F71EA440639BA0068028AB60F242A; // 0x07D0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1D36E30F46F5F27AEF3022A1ED659933; // 0x0808(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_F011FD694FB233B0CD19BD917CC7A802; // 0x0840(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_AF6547174F799B0139F291800AD4039B; // 0x0878(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_DDC28E5D414AEEE0BA267EB3FA396CE4; // 0x08B0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_2DFBF36F491EAA24F538ED9D83DC2D7D; // 0x0900(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_619FAAA440A8A9FF1C98AABF6991C960; // 0x0948(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_F04FA56E411303EF1601DE92C3CB8E1C; // 0x0998(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_28224E00443AD38EA206DB97AC9A71D3; // 0x09E0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_3A4A333A4178509B4BF021BCB76168F1; // 0x0A30(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_DAF4040247A2A44BC32968A08CA7FACD; // 0x0A78(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_1EB1FCD343EC8FFC8BB7CA864CE7E7AC; // 0x0AC8(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_7AAE18A348CC7824505B1C99963BC957; // 0x0B10(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_FD910892443A9EC56B27E5BF49AFCE32; // 0x0B60(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_114075E346C919F354A12E8EAAB4FA19; // 0x0BA8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_484AFC8E4FBA83181734AB9081D10D49; // 0x0BF8(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_180E644A48EB1D16778E8CA78A1ACC16; // 0x0C40(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_3DC3CB224A5DF691750CEC8398956A9A; // 0x0C90(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_80DF21F343FE4D5C9E3C42B25E03C0D5; // 0x0CD8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_70A6B7E24C8A8983FF07A685ECC2CDDB; // 0x0D28(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_38BC80654E4736BA75FCB18826BA1CF2; // 0x0D70(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_A169200C4556602FAE351194B05F0223; // 0x0DC0(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_58A7664E469AFD82E16F4097D391BFC2; // 0x0E08(0x0080)
		bool                                                       IsRunning;                                               // 0x0E88(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsPullingString;                                         // 0x0E89(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsTargeting;                                             // 0x0E8A(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsMoving;                                                // 0x0E8B(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       DidFireWeapon;                                           // 0x0E8C(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       NoAmmoToReload;                                          // 0x0E8D(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       ReturnToIdle;                                            // 0x0E8E(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsLastArrow;                                             // 0x0E8F(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       HasPlayedReload;                                         // 0x0E90(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_E1MU[0x3];                                   // 0x0E91(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue; // 0x0E94(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue;                    // 0x0E98(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue;                         // 0x0E99(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue;                        // 0x0E9A(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue2;                       // 0x0E9B(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue;                          // 0x0E9C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue3;                       // 0x0E9D(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue2;                        // 0x0E9E(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue2;                         // 0x0E9F(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue4;                       // 0x0EA0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue3;                         // 0x0EA1(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue3;                        // 0x0EA2(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue5;                       // 0x0EA3(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue4;                        // 0x0EA4(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue5;                        // 0x0EA5(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue6;                       // 0x0EA6(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue6;                        // 0x0EA7(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue7;                        // 0x0EA8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue7;                       // 0x0EA9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue4;                         // 0x0EAA(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue8;                        // 0x0EAB(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue8;                       // 0x0EAC(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue9;                        // 0x0EAD(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue9;                       // 0x0EAE(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue10;                       // 0x0EAF(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue10;                      // 0x0EB0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue11;                       // 0x0EB1(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue11;                      // 0x0EB2(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue5;                         // 0x0EB3(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue12;                      // 0x0EB4(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue12;                       // 0x0EB5(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue13;                      // 0x0EB6(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue13;                       // 0x0EB7(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue14;                      // 0x0EB8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue14;                       // 0x0EB9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_C3VC[0x2];                                   // 0x0EBA(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue2; // 0x0EBC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue2;                   // 0x0EC0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue15;                       // 0x0EC1(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue15;                      // 0x0EC2(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue6;                         // 0x0EC3(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue3; // 0x0EC4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      K2Node_Event_DeltaTimeX;                                 // 0x0EC8(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue3;                   // 0x0ECC(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_PZT6[0x3];                                   // 0x0ECD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              CallFunc_GetOwningActor_ReturnValue;                     // 0x0ED0(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AShooterWeapon*                                      K2Node_DynamicCast_AsShooterWeapon;                      // 0x0ED8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast_CastSuccess;                          // 0x0EE0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_1I3X[0x7];                                   // 0x0EE1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class APrimalWeaponBow*                                    K2Node_DynamicCast_AsPrimalWeaponBow;                    // 0x0EE8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast2_CastSuccess;                         // 0x0EF0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_FHFK[0x7];                                   // 0x0EF1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AShooterCharacter*                                   CallFunc_GetPawnOwner_ReturnValue;                       // 0x0EF8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AShooterCharacter*                                   K2Node_DynamicCast_AsShooterCharacter;                   // 0x0F00(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast3_CastSuccess;                         // 0x0F08(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_LessEqual_IntInt_ReturnValue;                   // 0x0F09(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_5NDG[0x2];                                   // 0x0F0A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             CallFunc_GetVelocity_ReturnValue;                        // 0x0F0C(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsTargeting_ReturnValue;                        // 0x0F18(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_65KC[0x3];                                   // 0x0F19(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_BreakVector_X;                                  // 0x0F1C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Y;                                  // 0x0F20(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Z;                                  // 0x0F24(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FVector2D                                           CallFunc_MakeVector2D_ReturnValue;                       // 0x0F28(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsRunning_ReturnValue;                          // 0x0F30(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_NERU[0x3];                                   // 0x0F31(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_VSize2D_ReturnValue;                            // 0x0F34(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue;                 // 0x0F38(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue16;                      // 0x0F39(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_3CGW[0x6];                                   // 0x0F3A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USkeletalMeshComponent*                              CallFunc_GetOwningComponent_ReturnValue;                 // 0x0F40(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NotEqual_BoolBool_ReturnValue;                  // 0x0F48(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor

	public:
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_AEF2BA5A4042F9D69C58BAA876B1F5A8();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_369A22314C227388044F8A992A7B300E();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_C0765BF94BD666F6B17C03A709017E43();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_215ECB794AEE51A41CF8AA97BFECC07C();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_BDAF7B904BCA4A88C79DF296465BCC74();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_C10CCAF54986B57937A9A5977CCE1001();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_2C6C975F49C178D864AB1388789D12DF();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_63057C144C787BD24C8028A18994D903();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_E3E30B02400E3D3329B3B895145F8A52();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_14AB4FF54A5BBB81E639ADBE975D0560();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_1695A180497447D7F440CCA49CEA949A();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_1125554B4CA2977F6FA0F9A82AD1FAE4();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_150C709B4AE479CB61D2028BEFB2D94C();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVBowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_F011FD694FB233B0CD19BD917CC7A802();
		void BlueprintUpdateAnimation(float DeltaTimeX);
		void AnimNotify_EnterIdle();
		void AnimNotify_EnterTargetIdle();
		void AnimNotify_EndPullString();
		void ExecuteUbergraph_FPVBowWeaponAnimBP_Base(int32_t EntryPoint);
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
