#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass FPVMapGPSAnimBP_Base.FPVMapGPSAnimBP_Base_C
	 * Size -> 0x1038 (FullSize[0x1378] - InheritedSize[0x0340])
	 */
	class UFPVMapGPSAnimBP_Base_C : public UAnimInstance
	{
	public:
		struct FAnimNode_Root                                      AnimGraphNode_Root_92C33DB94AE42E615CA178B52C96381F;     // 0x0340(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_8467A7B34970006200E181A60A787E1A;     // 0x0388(0x0058)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_AAD76DAC4111E1C8AE802E8F26608C6E;     // 0x03E0(0x0058)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_71D81FA4453DDC8B30570DA29785E127;     // 0x0438(0x0058)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_A42688A74334AB1F35CBF18C5C58769F; // 0x0490(0x00A0)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_2269F22A4234AB0FE07B40A72D6D85CD; // 0x0530(0x00A0)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_08AF22DA46003970A461128749A11F15; // 0x05D0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_EAE19FFD4899C9C243F548B39D8F27D2; // 0x0608(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_77BCEC364353213817B9DF8A576E721F; // 0x0640(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_547CC58549F77D9E9D9BD5AC0332C707; // 0x0678(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_14ACF88240F429CA4DE3439ABC12DB1E; // 0x06B0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9ECDA5C148069D085913059FB36268BE; // 0x06E8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_BD08C26F486D452C00585F843B0716A2; // 0x0720(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_BA3E0FC74AD5124A57FA07B1A70423FB; // 0x0758(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_350DFC854342720CE5BF82BFE1395845; // 0x0790(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_20C392EF44C258E4A3C806AEB3861190; // 0x07E0(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_CBB828934431E1CC8AAF47BC54B26723; // 0x0828(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_110170744E6B852A2310709E424E8D69; // 0x0878(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_494BD34D48A1D157AEA817A5834481D9; // 0x08C0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_4130975A45E9089A653A279A8A692B87; // 0x0910(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_F125C57940555B8111A34E85BFA1B3E2; // 0x0958(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_E187C02A47B0C28B1E23A8A45BEECDE7; // 0x09A8(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_8DDC51094F138AE813692583426CC88A; // 0x09F0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_827174404A7012E3C44AD88C119026DE; // 0x0A40(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_D2423B4D4ADD3BE13152ADAC2CD8493A; // 0x0A88(0x0080)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_AEA7F918401C8648AE8250A68B5C452C; // 0x0B08(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_F275C1214128F61DFB3279B626EFBE39; // 0x0B40(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_7839A1F943204DA9D26189B81D108C51; // 0x0B78(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_DCBE31A34953F26F8F8905A3C1D74BE8; // 0x0BB0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_F8ABB7DD4627AB1E1BAD0FAAFA619292; // 0x0BE8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_731F73444D606F03870433A2179EF44A; // 0x0C20(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_E5961A454A3EA281CFCB8997E71BA272; // 0x0C58(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_E758020D472144D73CA75BB01C44B32F; // 0x0C90(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_FA67D78E42B3A3C44C75D7A7EAFD97BC; // 0x0CC8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_F32D4CF04704F585A915E8B2D35EA1F0; // 0x0D00(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_C463379E4A057B71285BF6AA565DB9F7; // 0x0D38(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_A30AAAA64B873DC50AB224B96519328A; // 0x0D70(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_785D31DC41D63D3B97EA128933B28D67; // 0x0DA8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_352ABF16457B7F6291B4D1990BE5A767; // 0x0DE0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9C331171449138BC12F277B698898CC5; // 0x0E18(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_605426964F362CC29321D6B214E51FF3; // 0x0E50(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_2985FDF6424F4369541FF4988955FAD8; // 0x0EA0(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_7377C73F4F0F38E1EF9310A391D030F6; // 0x0EE8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_7775799248B687EFBE94E09F8BF572BA; // 0x0F38(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_F93FBE154C8AC2AAA16D86ABC4CAF308; // 0x0F80(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_402DD8DD49F201EF4D23DE897629783B; // 0x0FD0(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_1A4FEE8E4B4EC46EC5641C9981B2B7FD; // 0x1018(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_B54E08064C3E8B8C14944289661180E6; // 0x1068(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_2897829A48A7309CCB621D917FBED21D; // 0x10B0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_AC98B15D4481D6384C2D29BB5FEF1ADC; // 0x1100(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_8E2686A84E875215F8C0BEB018493FF4; // 0x1148(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_2C8A5F1B4C2AB09810A9B6BAF158B18D; // 0x1198(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_947C35394E96AC6DC5A747801ADFDAAF; // 0x11E0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_3B8671F34AE763231EAF6CBA6F260723; // 0x1230(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_AD6CFAEB4A33B1163725AF891911EF32; // 0x1278(0x0080)
		bool                                                       IsRunning;                                               // 0x12F8(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       ShowingGPS;                                              // 0x12F9(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       ShowingMap;                                              // 0x12FA(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       UseCompass;                                              // 0x12FB(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       InTransition;                                            // 0x12FC(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue;                        // 0x12FD(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue2;                       // 0x12FE(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue;                         // 0x12FF(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue3;                       // 0x1300(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue4;                       // 0x1301(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue2;                        // 0x1302(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue3;                        // 0x1303(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue5;                       // 0x1304(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue;                          // 0x1305(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue2;                         // 0x1306(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue6;                       // 0x1307(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue4;                        // 0x1308(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue7;                       // 0x1309(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue5;                        // 0x130A(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue6;                        // 0x130B(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue8;                       // 0x130C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue3;                         // 0x130D(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue9;                       // 0x130E(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue4;                         // 0x130F(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue10;                      // 0x1310(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue5;                         // 0x1311(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue11;                      // 0x1312(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue12;                      // 0x1313(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue6;                         // 0x1314(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_ZBYU[0x3];                                   // 0x1315(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      K2Node_Event_DeltaTimeX;                                 // 0x1318(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_S1BD[0x4];                                   // 0x131C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              CallFunc_GetOwningActor_ReturnValue;                     // 0x1320(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AShooterWeapon*                                      K2Node_DynamicCast_AsShooterWeapon;                      // 0x1328(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast_CastSuccess;                          // 0x1330(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_RR9B[0x7];                                   // 0x1331(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class APrimalWeaponGPS*                                    K2Node_DynamicCast_AsPrimalWeaponGPS;                    // 0x1338(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast2_CastSuccess;                         // 0x1340(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_QQ2W[0x7];                                   // 0x1341(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AShooterCharacter*                                   CallFunc_GetPawnOwner_ReturnValue;                       // 0x1348(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AShooterCharacter*                                   K2Node_DynamicCast_AsShooterCharacter;                   // 0x1350(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast3_CastSuccess;                         // 0x1358(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsRunning_ReturnValue;                          // 0x1359(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue13;                      // 0x135A(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue7;                        // 0x135B(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_WWRJ[0x4];                                   // 0x135C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              CallFunc_GetOwningActor_ReturnValue2;                    // 0x1360(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class APrimalWeaponGPS*                                    K2Node_DynamicCast_AsPrimalWeaponGPS2;                   // 0x1368(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast4_CastSuccess;                         // 0x1370(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue14;                      // 0x1371(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NotEqual_BoolBool_ReturnValue;                  // 0x1372(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NotEqual_BoolBool_ReturnValue2;                 // 0x1373(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NotEqual_BoolBool_ReturnValue3;                 // 0x1374(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue7;                         // 0x1375(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue8;                         // 0x1376(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue8;                        // 0x1377(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor

	public:
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_08AF22DA46003970A461128749A11F15();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_EAE19FFD4899C9C243F548B39D8F27D2();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_AEA7F918401C8648AE8250A68B5C452C();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_F275C1214128F61DFB3279B626EFBE39();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_7839A1F943204DA9D26189B81D108C51();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_731F73444D606F03870433A2179EF44A();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_E758020D472144D73CA75BB01C44B32F();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_FA67D78E42B3A3C44C75D7A7EAFD97BC();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_A30AAAA64B873DC50AB224B96519328A();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_785D31DC41D63D3B97EA128933B28D67();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVMapGPSAnimBP_Base_AnimGraphNode_TransitionResult_352ABF16457B7F6291B4D1990BE5A767();
		void BlueprintUpdateAnimation(float DeltaTimeX);
		void BlueprintInitializeAnimation();
		void ExecuteUbergraph_FPVMapGPSAnimBP_Base(int32_t EntryPoint);
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
