#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass FPVThrowWeaponAnimBP_Base.FPVThrowWeaponAnimBP_Base_C
	 * Size -> 0x0931 (FullSize[0x0C71] - InheritedSize[0x0340])
	 */
	class UFPVThrowWeaponAnimBP_Base_C : public UAnimInstance
	{
	public:
		struct FAnimNode_Root                                      AnimGraphNode_Root_14F63B2A4A2C26EB25F4969D8485EB95;     // 0x0340(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_349286074B7C12CE1DDDB1A965C99A24;     // 0x0388(0x0058)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_4E9D50F742C66A7C09C5C69516953C34; // 0x03E0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_A3B5E1B24C5B995EA43D1CBDBE283811; // 0x0418(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_499199534896B9E39615789DD9F7C42D; // 0x0450(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_EA66187D4549A42301522EB102721240; // 0x0488(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_F00B811B4A3196F4C85E37AA7217616A; // 0x04C0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_FFF86BBA4D8F4F8CB4E56AAB6C3391A2; // 0x04F8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_196EE8D049A36493C8EDA9805ACF8712; // 0x0530(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_09287C9D42D6C39A303A1E89E0DE2A29; // 0x0568(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_B05C1AB84D8C4BF2DC9D21A46FC166AD; // 0x05A0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_8151B23247D427BEF093A2BFC2B7475C; // 0x05D8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1DF9F22D40C56BB5BE4EE1A4C1283498; // 0x0610(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_68A46BDB41A6E41A8AD81884EFC0673F; // 0x0648(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_A8D0A73D4E09341CDC4272BA5DB61762; // 0x0680(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_B4113F2A4AB28D8DD52DC1B06AAAB009; // 0x06B8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_D548778C4665849BAF7E6B997742F4E4; // 0x06F0(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_19E3103A4ABACC03A2A9CAB12B31C8D6; // 0x0728(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_90B27B61473FB28B96F80891D1F7F4BE; // 0x0778(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_C463F9C04B15D9A5E7E9C7826695D81C; // 0x07C0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_A63391BE419E53957057089D740A39AD; // 0x0810(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_10385CA34A32927AB1262CA1E61CE7E8; // 0x0858(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_030409DA466A8312005DB693D432A83F; // 0x08A8(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_772221504E7F6750A7043C8766CBB1CA; // 0x08F0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_81B8ED644B5A44ED0B5C45A482F334B2; // 0x0940(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_EA2D88994CEB060BDA03678D8E1F36CD; // 0x0988(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_91E347AC468A2344106401977E2F3712; // 0x09D8(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_2F82DE444AF0256FFFB34D9949781AB4; // 0x0A20(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_5C2BA4024B81957D363237BF71AED082; // 0x0A70(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_37D1DE9E426EBE94AE8C5E894A2525AD; // 0x0AB8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_918EF08A488C5AF4BBF055BA4AB71381; // 0x0B08(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_1131B1454FC08B42204A66A2F9FFD8A0; // 0x0B50(0x0080)
		bool                                                       IsRunning;                                               // 0x0BD0(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsPullingString;                                         // 0x0BD1(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsTargeting;                                             // 0x0BD2(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsMoving;                                                // 0x0BD3(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       DidFireWeapon;                                           // 0x0BD4(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       NoAmmoToReload;                                          // 0x0BD5(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       ReturnToIdle;                                            // 0x0BD6(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue;                        // 0x0BD7(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue;                          // 0x0BD8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue2;                       // 0x0BD9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue;                         // 0x0BDA(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue3;                       // 0x0BDB(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue2;                        // 0x0BDC(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue3;                        // 0x0BDD(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue4;                       // 0x0BDE(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue2;                         // 0x0BDF(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue5;                       // 0x0BE0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue4;                        // 0x0BE1(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue6;                       // 0x0BE2(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue3;                         // 0x0BE3(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue5;                        // 0x0BE4(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue7;                       // 0x0BE5(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue8;                       // 0x0BE6(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue6;                        // 0x0BE7(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue7;                        // 0x0BE8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue9;                       // 0x0BE9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue4;                         // 0x0BEA(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_0VG4[0x1];                                   // 0x0BEB(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue; // 0x0BEC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      K2Node_Event_DeltaTimeX;                                 // 0x0BF0(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue;                    // 0x0BF4(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_A62O[0x3];                                   // 0x0BF5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              CallFunc_GetOwningActor_ReturnValue;                     // 0x0BF8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AShooterWeapon*                                      K2Node_DynamicCast_AsShooterWeapon;                      // 0x0C00(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast_CastSuccess;                          // 0x0C08(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_GYP3[0x7];                                   // 0x0C09(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class APrimalWeaponBow*                                    K2Node_DynamicCast_AsPrimalWeaponBow;                    // 0x0C10(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast2_CastSuccess;                         // 0x0C18(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_4GWE[0x7];                                   // 0x0C19(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AShooterCharacter*                                   CallFunc_GetPawnOwner_ReturnValue;                       // 0x0C20(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AShooterCharacter*                                   K2Node_DynamicCast_AsShooterCharacter;                   // 0x0C28(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast3_CastSuccess;                         // 0x0C30(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_4L4K[0x3];                                   // 0x0C31(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             CallFunc_GetVelocity_ReturnValue;                        // 0x0C34(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_X;                                  // 0x0C40(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Y;                                  // 0x0C44(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Z;                                  // 0x0C48(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsTargeting_ReturnValue;                        // 0x0C4C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_X6SL[0x3];                                   // 0x0C4D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector2D                                           CallFunc_MakeVector2D_ReturnValue;                       // 0x0C50(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_VSize2D_ReturnValue;                            // 0x0C58(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsRunning_ReturnValue;                          // 0x0C5C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue;                 // 0x0C5D(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_5MJP[0x2];                                   // 0x0C5E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    CallFunc_Add_IntInt_ReturnValue;                         // 0x0C60(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_LessEqual_IntInt_ReturnValue;                   // 0x0C64(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue10;                      // 0x0C65(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_EJED[0x2];                                   // 0x0C66(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USkeletalMeshComponent*                              CallFunc_GetOwningComponent_ReturnValue;                 // 0x0C68(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NotEqual_BoolBool_ReturnValue;                  // 0x0C70(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor

	public:
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVThrowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_4E9D50F742C66A7C09C5C69516953C34();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVThrowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_499199534896B9E39615789DD9F7C42D();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVThrowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_FFF86BBA4D8F4F8CB4E56AAB6C3391A2();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVThrowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_196EE8D049A36493C8EDA9805ACF8712();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVThrowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_09287C9D42D6C39A303A1E89E0DE2A29();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVThrowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_B05C1AB84D8C4BF2DC9D21A46FC166AD();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVThrowWeaponAnimBP_Base_AnimGraphNode_TransitionResult_B4113F2A4AB28D8DD52DC1B06AAAB009();
		void BlueprintUpdateAnimation(float DeltaTimeX);
		void AnimNotify_EnterIdle();
		void AnimNotify_EnterTargetIdle();
		void AnimNotify_EndPullString();
		void ExecuteUbergraph_FPVThrowWeaponAnimBP_Base(int32_t EntryPoint);
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
