#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass FPVWeaponAnimBP_Base.FPVWeaponAnimBP_Base_C
	 * Size -> 0x1674 (FullSize[0x19B4] - InheritedSize[0x0340])
	 */
	class UFPVWeaponAnimBP_Base_C : public UAnimInstance
	{
	public:
		struct FAnimNode_Root                                      AnimGraphNode_Root_A11AD81847780160E1665C9911EB4B59;     // 0x0340(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_463D56654F424B44B742F1BEEDA4F197;     // 0x0388(0x0058)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_3A593C084F130C991CABE2A461E334CA; // 0x03E0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_44E02ED545CE6CBB00AC35AE05F42412; // 0x0418(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_596A116B415D86CBDC07A5A7C9C23C42; // 0x0450(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_A3170B8E46DAA62BE1376E89664C7A7C; // 0x0488(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_DB2D920F43BA392B037E2791094B2346; // 0x04C0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_D4303E7A416D2CDD6A71089778F1EEDE; // 0x04F8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_258611F6499D20B80824CBB0593462CD; // 0x0530(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_FFE8072045BC8D564F09B28C6141532F; // 0x0568(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_B2101A2546ECC2D3A85FC69231C6C9DF; // 0x05A0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_E04EC57A41A12C80ADE8D58D30201E6E; // 0x05D8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_6B2D0F234506C2AC185942BD7855858A; // 0x0610(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_06DB981845275E356771018FA5ED1655; // 0x0648(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_D95518054F5D5C07CBDF9BAC0651B7E6; // 0x0680(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_50FA270246AF28F8C03F0AA6E47368CC; // 0x06B8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_68ABD7E04FF9B6F9DC6776B56AB753B3; // 0x0708(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_B6347FC14A740618CB8483B9A7209DF4; // 0x0750(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_FED6634944225C11456B7090AB3BA86E; // 0x07A0(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9E2EF26C4CB30D337F043E87B850172D; // 0x07E8(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_724FCAE24EAC3D86015677B2BC34EFBC; // 0x0838(0x0080)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_AE34426541FF273E6ACB3FB0324F868F; // 0x08B8(0x0048)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_86AA74604FCFB3A9352C23965CFF476C; // 0x0900(0x0048)
		unsigned char                                              UnknownData_2YIE[0x8];                                   // 0x0948(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_DB2AC14C4F2D31E52E8413A4EB301BC5; // 0x0950(0x00D0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_2F12DC6C439B153D2A98A49ED808528C; // 0x0A20(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_44C3BA1141C1C89244660BACB32893DB; // 0x0A70(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_EB958199417E89F4872E55A01456EE90; // 0x0AF0(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_F26D76BB44E3977F1C75DBA494CF67FD; // 0x0B40(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_54F1252643B68DBC2D4C2682F4861E49; // 0x0BC0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_1AD446C7494EF93F7BACBFA824F03E2A; // 0x0C10(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_6C1D9A3D45715E78A051498246978F81; // 0x0C58(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_53DB1E7C47ABFE25AA237F814561A884; // 0x0CA8(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_0CC67AE7417E9092E446F4925EACEC4B; // 0x0CF0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_F0C851C844CD74E3968D608B6028E88A; // 0x0D40(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_52FD574041A6F45BDBAFAB974626D819; // 0x0D88(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_D333E8714F17EC6F04B0AAB8945BFDDC; // 0x0DD8(0x0080)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_04E71E404D1BF8C9E403B8A55B2598CF; // 0x0E58(0x0048)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_710423F34ABF7C808DB867AE35382D2D; // 0x0EA0(0x0048)
		unsigned char                                              UnknownData_SUOF[0x8];                                   // 0x0EE8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_299E41044CBCB2F66C0943922F96E7D1; // 0x0EF0(0x00D0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_A46D6893438DA2E33862C7BF4D25FDB7; // 0x0FC0(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_156B9C464BD3FDB812734D8BF77F0166; // 0x1010(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9D2FD8C44421D158C3A1C294EE4E5DE5; // 0x1090(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_4956329745EB0C4D7FCA6DA69697A3EC; // 0x10E0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_8470FE1F4D599C1ED21C3887BABAB3C9; // 0x1160(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_C038767C42E79638BB0166A005F8AFA1; // 0x11B0(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_97E0EFD2435D68B0006278AF9D811B3B; // 0x11F8(0x0080)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_D5B28844487B8C239FE3789C22462F71; // 0x1278(0x00A0)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9DED2075461A9975F43D16855CF83F21; // 0x1318(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2DF4F4DA4240527C724FA78B05AFF371; // 0x1350(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_CC1EF24A41E779C9A7047FA5AE46FBE4; // 0x1388(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_980F12C44042D39FC230A1830DA7538D; // 0x13D8(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_09D714824673EF21837900809B1DD518; // 0x1420(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_2BE7DBC14A2A4357939196BF042AFDC7; // 0x1470(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_85A81A754E903BCDE2FB03BE8E422FCA; // 0x14B8(0x0080)
		unsigned char                                              UnknownData_7IQX[0x8];                                   // 0x1538(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_7F7C23A64EC13555A97C519B87945B74; // 0x1540(0x00D0)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_6C812FDC4200B1AACD9A20AEFB7B6D41; // 0x1610(0x0048)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_1EE8C48742E2752EA6747694D67D6517; // 0x1658(0x0048)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_3E8D35FC447CEA4F644A579C82D6D35B; // 0x16A0(0x00D0)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_FBE626FD43821C2AE8D5D795DEE47C25; // 0x1770(0x0048)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_43CF7A724A1AAA7BFCA9E8960DECA81F; // 0x17B8(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_FE1E4680455A8ECF27C53DB0F1A17259;     // 0x1800(0x0058)
		bool                                                       IsRunning;                                               // 0x1858(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsTargeting;                                             // 0x1859(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsMoving;                                               // 0x185A(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseMoving;                                              // 0x185B(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      MovementAnimRate;                                        // 0x185C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsSwimming;                                             // 0x1860(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseSwimming;                                            // 0x1861(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_ZT7V[0x6];                                   // 0x1862(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		double                                                     LastSwimmingTime;                                        // 0x1868(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseInventory;                                           // 0x1870(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsInventory;                                            // 0x1871(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_67Q7[0x2];                                   // 0x1872(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             DefaultTranslation;                                      // 0x1874(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseNoClipAmmoIdle;                                      // 0x1880(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bHasClipAmmo;                                            // 0x1881(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsUsingShield;                                          // 0x1882(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_6LCI[0x1];                                   // 0x1883(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      UsingShieldWeight;                                       // 0x1884(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsBlockingWithShield;                                   // 0x1888(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_5TRW[0x3];                                   // 0x1889(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             BlockingShieldTranslation;                               // 0x188C(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      BlockingShieldWeight;                                    // 0x1898(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FRotator                                            BlockingShieldRotation;                                  // 0x189C(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue;                        // 0x18A8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue2;                       // 0x18A9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue;                         // 0x18AA(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue3;                       // 0x18AB(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue2;                        // 0x18AC(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue3;                        // 0x18AD(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue4;                        // 0x18AE(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue4;                       // 0x18AF(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue5;                        // 0x18B0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue5;                       // 0x18B1(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue6;                       // 0x18B2(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue6;                        // 0x18B3(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue7;                       // 0x18B4(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue7;                        // 0x18B5(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue8;                       // 0x18B6(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue8;                        // 0x18B7(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue9;                       // 0x18B8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue9;                        // 0x18B9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue10;                       // 0x18BA(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_ENWE[0x1];                                   // 0x18BB(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      K2Node_Event_DeltaTimeX;                                 // 0x18BC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue10;                      // 0x18C0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_WXM6[0x7];                                   // 0x18C1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              CallFunc_GetOwningActor_ReturnValue;                     // 0x18C8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AShooterWeapon*                                      K2Node_DynamicCast_AsShooterWeapon;                      // 0x18D0(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast_CastSuccess;                          // 0x18D8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_IUX3[0x7];                                   // 0x18D9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AShooterCharacter*                                   CallFunc_GetPawnOwner_ReturnValue;                       // 0x18E0(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_IntInt_ReturnValue;                     // 0x18E8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_7ELF[0x7];                                   // 0x18E9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AShooterCharacter*                                   K2Node_DynamicCast_AsShooterCharacter;                   // 0x18F0(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast2_CastSuccess;                         // 0x18F8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue;                          // 0x18F9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_RO6C[0x2];                                   // 0x18FA(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             CallFunc_GetBlockingShieldOffsets_OutBlockingShieldFPVTranslation; // 0x18FC(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FRotator                                            CallFunc_GetBlockingShieldOffsets_OutBlockingShieldFPVRotation; // 0x1908(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_GetBlockingShieldOffsets_ReturnValue;           // 0x1914(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsBlockingWithShield_ReturnValue;               // 0x1915(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsUsingShield_ReturnValue;                      // 0x1916(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_9XPI[0x1];                                   // 0x1917(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRotator                                            CallFunc_K2_GetActorRotation_ReturnValue;                // 0x1918(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_GetDefaultMovementSpeed_ReturnValue;            // 0x1924(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FVector                                             CallFunc_Conv_RotatorToVector_ReturnValue;               // 0x1928(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsTargeting_ReturnValue;                        // 0x1934(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_Q08Z[0x3];                                   // 0x1935(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             CallFunc_GetCurrentAcceleration_ReturnValue;             // 0x1938(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FVector                                             CallFunc_Normal_ReturnValue;                             // 0x1944(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Dot_VectorVector_ReturnValue;                   // 0x1950(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_X;                                  // 0x1954(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Y;                                  // 0x1958(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Z;                                  // 0x195C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue;                 // 0x1960(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue2;                // 0x1961(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue11;                       // 0x1962(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_EqualEqual_ByteByte_ReturnValue;                // 0x1963(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FVector2D                                           CallFunc_Conv_VectorToVector2D_ReturnValue;              // 0x1964(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_VSize_ReturnValue;                              // 0x196C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_VSize2D_ReturnValue;                            // 0x1970(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue3;                // 0x1974(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_3V3H[0x3];                                   // 0x1975(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_Divide_FloatFloat_ReturnValue;                  // 0x1978(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue11;                      // 0x197C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_HI35[0x3];                                   // 0x197D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_FClamp_ReturnValue;                             // 0x1980(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue2;                         // 0x1984(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue12;                       // 0x1985(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsRunning_ReturnValue;                          // 0x1986(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue13;                       // 0x1987(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		double                                                     CallFunc_GetGameTimeInSeconds_ReturnValue;               // 0x1988(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		double                                                     CallFunc_Subtract_DoubleDouble_ReturnValue;              // 0x1990(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Conv_DoubleToFloat_ReturnValue;                 // 0x1998(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue;                    // 0x199C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue14;                       // 0x199D(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue15;                       // 0x199E(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_TAS3[0x1];                                   // 0x199F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_FInterpTo_ReturnValue;                          // 0x19A0(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_FInterpTo_ReturnValue2;                         // 0x19A4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue12;                      // 0x19A8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue16;                       // 0x19A9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_AW8F[0x2];                                   // 0x19AA(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_FInterpTo_ReturnValue3;                         // 0x19AC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_FInterpTo_ReturnValue4;                         // 0x19B0(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor

	public:
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_AnimGraphNode_TransitionResult_3A593C084F130C991CABE2A461E334CA();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_AnimGraphNode_TransitionResult_44E02ED545CE6CBB00AC35AE05F42412();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_AnimGraphNode_TransitionResult_596A116B415D86CBDC07A5A7C9C23C42();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_AnimGraphNode_TransitionResult_D4303E7A416D2CDD6A71089778F1EEDE();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_AnimGraphNode_TransitionResult_258611F6499D20B80824CBB0593462CD();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_AnimGraphNode_TransitionResult_B2101A2546ECC2D3A85FC69231C6C9DF();
