#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass FPVWeaponAnimBP_Base_TekRifle.FPVWeaponAnimBP_Base_TekRifle_C
	 * Size -> 0x1824 (FullSize[0x1B64] - InheritedSize[0x0340])
	 */
	class UFPVWeaponAnimBP_Base_TekRifle_C : public UAnimInstance
	{
	public:
		struct FAnimNode_Root                                      AnimGraphNode_Root_AD2A7AE14836D769EA4AF683D832DDAB;     // 0x0340(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_A1AB282048B914A10FB9DDAF967ED8B7;     // 0x0388(0x0058)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_DC44F5E845DFD73C1389FE94B7A71EFE; // 0x03E0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_AD10F2AC437E82983C7439A4B0652571; // 0x0418(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2AA823AD451899D6EA91798A02359BF0; // 0x0450(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_0069BFBC47E4D187372ADB9BFFEDBD06; // 0x0488(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_B0FA025140BA19FD2CBFE3AAFAF1E567; // 0x04C0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_ADB1F3DE4E8C9F6D101D6B8AD06D72A1; // 0x04F8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_04D9EBB64C2F072BEBE1B7B056FDBC20; // 0x0530(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_55DAEE3A41310224418F3983E6E9E270; // 0x0568(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_50A5C10D4B314E95717B81BDD2F0D0F3; // 0x05A0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_761CDF134F4F5E3C8C7404A45191885C; // 0x05D8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_866F49A3421962A5C09C97A681041A05; // 0x0610(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_924717C24169FAD8089247B0E18E910A; // 0x0648(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_0455C349400D86461925B5BAC6AEA50F; // 0x0680(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_A1582EC047EA3CD593EE69A2CC9D3B61; // 0x06B8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_27A67CBC4BC710D9F838BFBC912EFA4D; // 0x0708(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_3CC4A95A43FFF919CB3400B07DE09927; // 0x0750(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_55068A4F432EED76E51454A61AAEEA48; // 0x07A0(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_020D344E4A4936B2018041A189184FED; // 0x07E8(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_069BDC4E4B6D21B1EDD9B283BB33EF18; // 0x0838(0x0080)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_EFDA0DAC4062633DAD1A25813831D04C; // 0x08B8(0x0048)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_334EF601444A72F6C8C7A38E4F7289B6; // 0x0900(0x0048)
		unsigned char                                              UnknownData_YGMS[0x8];                                   // 0x0948(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_FCD759E24C5C705A7059228D34AC97AC; // 0x0950(0x00D0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_DE99DDBA4836960244AB30848A471DF3; // 0x0A20(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_6F5B4160451997A10AF17F80E22A7FB9; // 0x0A70(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_6D91024B48FED7743D83C5A439C1D1AB; // 0x0AF0(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_5CF912C648828C27AC47558D6F57561B; // 0x0B40(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_809142104232347F828069B209D7C269; // 0x0BC0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_ADB33106413DEA4A5319DABCA9839C28; // 0x0C10(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9128A38141C4A787193A8F91ECA9EF24; // 0x0C58(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_2C6634AE4B8B9B63DF4D8BAB1E6FC6B3; // 0x0CA8(0x0048)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_5000ACE6413662228F2F50BC9A5CC599; // 0x0CF0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_A7D95C0E4CFDD49E34172F96700726A6; // 0x0D70(0x0050)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_3DE717AA4CF1D205BDB90284BD3579A5; // 0x0DC0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_2756B7F04AFB5A7A05AE14835A2DCCE7; // 0x0E10(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_BCD0F05747470D0C82FCEBBBB7207745; // 0x0E58(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_7FBC02B54313662343E3E7B0714ABD7D; // 0x0EA8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_0FD22A6241236DAF6BA21E96DAD58E56; // 0x0F28(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_434ABCAC4F30592ADB328AB5AA652695; // 0x0F78(0x0080)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_6E0C38C149834F17F5DAB1A8C51684C7; // 0x0FF8(0x0048)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_3BD41EAF4D71960B6E2C03A1A02030C2; // 0x1040(0x0048)
		unsigned char                                              UnknownData_HUVE[0x8];                                   // 0x1088(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_EE005AB54FAEB2E950AB3FB56F293456; // 0x1090(0x00D0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_6A0926824E06630F0940FABBE05EAB07; // 0x1160(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_E10C5B6247836870E18B91804111F039; // 0x11B0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_338AFDEA4929BC32F0A95CA2C274B843; // 0x1230(0x0050)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_AD6578BE41CFD5A7391309A0A79D6A52; // 0x1280(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_AD9CB92C4C8F873B4D93018E35C6220F; // 0x1300(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_69B40A754805C58F004329AD06275747; // 0x1350(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_D8EA6BAE4A6D661F136249A6E6548DA7; // 0x1398(0x0080)
		struct FAnimNode_LayeredBoneBlend                          AnimGraphNode_LayeredBoneBlend_EFEFBF8A45FFB25B2B260FB306DD2AED; // 0x1418(0x00A0)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_31A5DCF94F7B6EE76530C7A47ECD7DCD; // 0x14B8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_C410AB744B5A1B6E332ED29F8C6AC6C9; // 0x14F0(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_3894432743D091DB392374AF341DACD0; // 0x1528(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_2266FF034131065A93F5FCA1EBFB0349; // 0x1578(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_660B67FF497C28A3E3DF04BF1F36D15A; // 0x15C0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_B3D9626F4F3557FCA722BF82996C79C7; // 0x1610(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_A095648E4AF5654FA03EB6A320E47AE7; // 0x1658(0x0080)
		unsigned char                                              UnknownData_D9XN[0x8];                                   // 0x16D8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_3FF8326C4B3D440B25E3509F10F1F359; // 0x16E0(0x00D0)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_AC38C70F447FAB1767F733B9FA8E9F6C; // 0x17B0(0x0048)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_A99C51A34C2B6D972DAA90894805244C; // 0x17F8(0x0048)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_BB51624F484964AFA6A08F951934465E; // 0x1840(0x00D0)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_AFB22DA44465C1A11DF0769CCD643E9C; // 0x1910(0x0048)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_6CD09323455D9EF4293DD0A02F2CB150; // 0x1958(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_B57596F34D4454F9094926AE1C026080;     // 0x19A0(0x0058)
		bool                                                       IsRunning;                                               // 0x19F8(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsTargeting;                                             // 0x19F9(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsMoving;                                               // 0x19FA(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseMoving;                                              // 0x19FB(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      MovementAnimRate;                                        // 0x19FC(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsSwimming;                                             // 0x1A00(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseSwimming;                                            // 0x1A01(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_WB61[0x6];                                   // 0x1A02(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		double                                                     LastSwimmingTime;                                        // 0x1A08(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseInventory;                                           // 0x1A10(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsInventory;                                            // 0x1A11(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_MMUP[0x2];                                   // 0x1A12(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             DefaultTranslation;                                      // 0x1A14(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUseNoClipAmmoIdle;                                      // 0x1A20(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bHasClipAmmo;                                            // 0x1A21(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsUsingShield;                                          // 0x1A22(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_0G89[0x1];                                   // 0x1A23(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      UsingShieldWeight;                                       // 0x1A24(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsBlockingWithShield;                                   // 0x1A28(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_RWZZ[0x3];                                   // 0x1A29(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             BlockingShieldTranslation;                               // 0x1A2C(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      BlockingShieldWeight;                                    // 0x1A38(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FRotator                                            BlockingShieldRotation;                                  // 0x1A3C(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsOverheated;                                           // 0x1A48(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue;                        // 0x1A49(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue2;                       // 0x1A4A(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue;                         // 0x1A4B(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue3;                       // 0x1A4C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue2;                        // 0x1A4D(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue3;                        // 0x1A4E(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue4;                        // 0x1A4F(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue4;                       // 0x1A50(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue5;                        // 0x1A51(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue5;                       // 0x1A52(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue6;                       // 0x1A53(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue7;                       // 0x1A54(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue6;                        // 0x1A55(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue7;                        // 0x1A56(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue8;                       // 0x1A57(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue8;                        // 0x1A58(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue9;                       // 0x1A59(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue9;                        // 0x1A5A(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue10;                       // 0x1A5B(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      K2Node_Event_DeltaTimeX;                                 // 0x1A5C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AActor*                                              CallFunc_GetOwningActor_ReturnValue;                     // 0x1A60(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AShooterWeapon*                                      K2Node_DynamicCast_AsShooterWeapon;                      // 0x1A68(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast_CastSuccess;                          // 0x1A70(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_1ORV[0x7];                                   // 0x1A71(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AWeapTekRifle_C*                                     K2Node_DynamicCast_AsWeapTekRifle_C;                     // 0x1A78(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast2_CastSuccess;                         // 0x1A80(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_GetIs_Overheated_bRetOverheated;                // 0x1A81(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_IntInt_ReturnValue;                     // 0x1A82(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_V3PT[0x5];                                   // 0x1A83(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AShooterCharacter*                                   CallFunc_GetPawnOwner_ReturnValue;                       // 0x1A88(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue;                          // 0x1A90(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_94AI[0x7];                                   // 0x1A91(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AShooterCharacter*                                   K2Node_DynamicCast_AsShooterCharacter;                   // 0x1A98(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast3_CastSuccess;                         // 0x1AA0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_K4JS[0x3];                                   // 0x1AA1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             CallFunc_GetBlockingShieldOffsets_OutBlockingShieldFPVTranslation; // 0x1AA4(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FRotator                                            CallFunc_GetBlockingShieldOffsets_OutBlockingShieldFPVRotation; // 0x1AB0(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_GetBlockingShieldOffsets_ReturnValue;           // 0x1ABC(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsBlockingWithShield_ReturnValue;               // 0x1ABD(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsUsingShield_ReturnValue;                      // 0x1ABE(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_LJBO[0x1];                                   // 0x1ABF(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRotator                                            CallFunc_K2_GetActorRotation_ReturnValue;                // 0x1AC0(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FVector                                             CallFunc_Conv_RotatorToVector_ReturnValue;               // 0x1ACC(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_GetDefaultMovementSpeed_ReturnValue;            // 0x1AD8(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsTargeting_ReturnValue;                        // 0x1ADC(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_SQ5R[0x3];                                   // 0x1ADD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             CallFunc_GetCurrentAcceleration_ReturnValue;             // 0x1AE0(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FVector                                             CallFunc_Normal_ReturnValue;                             // 0x1AEC(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Dot_VectorVector_ReturnValue;                   // 0x1AF8(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_X;                                  // 0x1AFC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Y;                                  // 0x1B00(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Z;                                  // 0x1B04(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue;                 // 0x1B08(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue2;                // 0x1B09(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue11;                       // 0x1B0A(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_EqualEqual_ByteByte_ReturnValue;                // 0x1B0B(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FVector2D                                           CallFunc_Conv_VectorToVector2D_ReturnValue;              // 0x1B0C(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_VSize_ReturnValue;                              // 0x1B14(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_VSize2D_ReturnValue;                            // 0x1B18(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue3;                // 0x1B1C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_G7ZX[0x3];                                   // 0x1B1D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_Divide_FloatFloat_ReturnValue;                  // 0x1B20(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue10;                      // 0x1B24(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue2;                         // 0x1B25(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsRunning_ReturnValue;                          // 0x1B26(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue12;                       // 0x1B27(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue11;                      // 0x1B28(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_NH4N[0x7];                                   // 0x1B29(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		double                                                     CallFunc_GetGameTimeInSeconds_ReturnValue;               // 0x1B30(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		double                                                     CallFunc_Subtract_DoubleDouble_ReturnValue;              // 0x1B38(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Conv_DoubleToFloat_ReturnValue;                 // 0x1B40(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue;                    // 0x1B44(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue13;                       // 0x1B45(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_3582[0x2];                                   // 0x1B46(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_FInterpTo_ReturnValue;                          // 0x1B48(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue14;                       // 0x1B4C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_36PL[0x3];                                   // 0x1B4D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_FInterpTo_ReturnValue2;                         // 0x1B50(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue12;                      // 0x1B54(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue15;                       // 0x1B55(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_1T4C[0x2];                                   // 0x1B56(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_FInterpTo_ReturnValue3;                         // 0x1B58(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue16;                       // 0x1B5C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_QJ4G[0x3];                                   // 0x1B5D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_FInterpTo_ReturnValue4;                         // 0x1B60(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor

	public:
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_TekRifle_AnimGraphNode_TransitionResult_DC44F5E845DFD73C1389FE94B7A71EFE();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_TekRifle_AnimGraphNode_TransitionResult_AD10F2AC437E82983C7439A4B0652571();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_TekRifle_AnimGraphNode_TransitionResult_2AA823AD451899D6EA91798A02359BF0();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_TekRifle_AnimGraphNode_TransitionResult_ADB1F3DE4E8C9F6D101D6B8AD06D72A1();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_TekRifle_AnimGraphNode_TransitionResult_04D9EBB64C2F072BEBE1B7B056FDBC20();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_FPVWeaponAnimBP_Base_TekRifle_AnimGraphNode_TransitionResult_50A5C10D4B314E95717B81BDD2F0D0F3();
