#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * WidgetBlueprintGeneratedClass HostSession.HostSession_C
	 * Size -> 0x0CC1 (FullSize[0x1F09] - InheritedSize[0x1248])
	 */
	class UHostSession_C : public UUI_HostSession
	{
	public:
		class UWidgetAnimation*                                    Close;                                                   // 0x1248(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UWidgetAnimation*                                    Open;                                                    // 0x1250(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 AcceptPassword;                                          // 0x1258(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    ActiveEventTextBlock;                                    // 0x1260(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           AdminLogging;                                            // 0x1268(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    AdminTextField;                                          // 0x1270(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UButton*                                             AdvancedSettingsButton;                                  // 0x1278(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           AllowAnyoneBabyImprintCuddle;                            // 0x1280(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           AllowCaveBuildingPvE;                                    // 0x1288(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           AllowCustomRecipes;                                      // 0x1290(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           AllowFlyerCarryPvE;                                      // 0x1298(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           AllowFlyerSpeedLevelingCheckbox;                         // 0x12A0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           AllowMultiplePlatformFloorsCheckBox;                     // 0x12A8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           AllowRaidDinoFeeding;                                    // 0x12B0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           AllowUnlimitedRespecsCheckBox;                           // 0x12B8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 ARKModsButton;                                           // 0x12C0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             AutoPvEStartTimeSecondsSlider;                           // 0x12C8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    AutoPvEStartTimeSecondsValue;                            // 0x12D0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             AutoPvEStopTimeSecondsSlider;                            // 0x12D8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    AutoPvEStopTimeSecondsValue;                             // 0x12E0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           AutoPvETimer;                                            // 0x12E8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           AutoPvEUseSystemTime;                                    // 0x12F0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             BabyCuddleGracePeriodMultiplierSlider;                   // 0x12F8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    BabyCuddleGracePeriodMultiplierValue;                    // 0x1300(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             BabyCuddleIntervalMultiplierSlider;                      // 0x1308(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    BabyCuddleIntervalMultiplierValue;                       // 0x1310(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             BabyCuddleLoseImprintQualitySpeedMultiplierSlider;       // 0x1318(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    BabyCuddleLoseImprintQualitySpeedMultiplierValue;        // 0x1320(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             BabyFoodConsumptionSpeedSlider;                          // 0x1328(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    BabyFoodConsumptionSpeedValue;                           // 0x1330(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             BabyImprintingStatScaleMultiplierSlider;                 // 0x1338(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    BabyImprintingStatScaleMultiplierValue;                  // 0x1340(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             BabyMatureSpeedSlider;                                   // 0x1348(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    BabyMatureSpeedValue;                                    // 0x1350(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 CancelButton;                                            // 0x1358(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 CancelPassword;                                          // 0x1360(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UButton*                                             CancelUploadSaveFileButton;                              // 0x1368(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 ClearDediData;                                           // 0x1370(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             CorpseDecompositionTimeSlider;                           // 0x1378(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    CorpseDecompositionTimeValue;                            // 0x1380(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             CraftingSkillBonusSlider;                                // 0x1388(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    CraftingSkillBonusValue;                                 // 0x1390(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             CraftXPMultiplierSlider;                                 // 0x1398(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    CraftXPMultiplierValue;                                  // 0x13A0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              CreatureBottomBorder;                                    // 0x13A8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              CreatureTopBorder;                                       // 0x13B0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             CropDecaySpeedSlider;                                    // 0x13B8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    CropDecaySpeedValue;                                     // 0x13C0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             CropGrowthSpeedSlider;                                   // 0x13C8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    CropGrowthSpeedValue;                                    // 0x13D0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             CustomRecipeEffectivenessSlider;                         // 0x13D8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    CustomRecipeEffectivenessValue;                          // 0x13E0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             CustomRecipeSkillSlider;                                 // 0x13E8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    CustomRecipeSkillValue;                                  // 0x13F0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              DarkBackground;                                          // 0x13F8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             DayCycleSpeedSlider;                                     // 0x1400(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    DayCycleSpeedValue;                                      // 0x1408(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             DayTimeSpeedSlider;                                      // 0x1410(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    DayTimeSpeedValue;                                       // 0x1418(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UButton*                                             DeleteDedicatedSaveBackupButton;                         // 0x1420(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 DeleteSinglePlayerData;                                  // 0x1428(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           DestroyOldBiomeStructuresAndDinos;                       // 0x1430(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             DifficultySlider;                                        // 0x1438(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    DifficultyValue;                                         // 0x1440(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             DinoCharacterFoodDrainSlider;                            // 0x1448(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    DinoCharacterFoodDrainValue;                             // 0x1450(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             DinoCharacterHealthRecoverySlider;                       // 0x1458(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    DinoCharacterHealthRecoveryValue;                        // 0x1460(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             DinoCharacterStaminaDrainSlider;                         // 0x1468(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    DinoCharacterStaminaDrainValue;                          // 0x1470(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             DinoCountSlider;                                         // 0x1478(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    DinoCountValue;                                          // 0x1480(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             DinoDamageSlider;                                        // 0x1488(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    DinoDamageValue;                                         // 0x1490(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             DinoHarvestingDamageSlider;                              // 0x1498(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    DinoHarvestingDamageValue;                               // 0x14A0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             DinoResistanceSlider;                                    // 0x14A8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    DinoResistanceValue;                                     // 0x14B0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             DinoTurretDamageSlider;                                  // 0x14B8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    DinoTurretDamageValue;                                   // 0x14C0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           DisableDinoDecayPvE;                                     // 0x14C8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           DisableDinoRidingCheckbox;                               // 0x14D0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           DisableDinoTameCheckbox;                                 // 0x14D8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           DisableFriendlyFire;                                     // 0x14E0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           DisableImprintDinoBuff;                                  // 0x14E8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           DisableLootCrates;                                       // 0x14F0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           DisablePvEGamma;                                         // 0x14F8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           DisableStructureDecayPvE;                                // 0x1500(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           DisableStructurePlacementCollisionCheckbox;              // 0x1508(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             EggHatchSpeedSlider;                                     // 0x1510(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    EggHatchSpeedValue;                                      // 0x1518(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           EnableExtraStructurePreventionVolumes;                   // 0x1520(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           EnablePvPGamma;                                          // 0x1528(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UButton*                                             EngramsButton;                                           // 0x1530(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             FishingLootQualitySlider;                                // 0x1538(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    FishingLootQualityValue;                                 // 0x1540(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           FlyerPlatformAllowUnalignedDinoBasing;                   // 0x1548(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           ForceAllowCaveFlyers;                                    // 0x1550(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             FuelConsumptionIntervalMultiplierSlider;                 // 0x1558(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    FuelConsumptionIntervalMultiplierValue;                  // 0x1560(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UButton*                                             GeneralSettingsButton;                                   // 0x1568(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             GenericXPMultiplierSlider;                               // 0x1570(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    GenericXPMultiplierValue;                                // 0x1578(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 GetModsButton;                                           // 0x1580(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           GlobalVoiceChatCheckbox;                                 // 0x1588(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             HarvestAmountSlider;                                     // 0x1590(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    HarvestAmountValue;                                      // 0x1598(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             HarvestHealthSlider;                                     // 0x15A0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    HarvestHealthValue;                                      // 0x15A8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             HarvestXPMultiplierSlider;                               // 0x15B0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    HarvestXPMultiplierValue;                                // 0x15B8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 HostDedicatedButton;                                     // 0x15C0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 HostListenServerButton;                                  // 0x15C8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 HostSessionButton;                                       // 0x15D0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_1190;                                              // 0x15D8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_1191;                                              // 0x15E0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_133;                                               // 0x15E8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_1321;                                              // 0x15F0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_1322;                                              // 0x15F8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_152;                                               // 0x1600(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_153;                                               // 0x1608(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_160;                                               // 0x1610(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_161;                                               // 0x1618(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_162;                                               // 0x1620(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_172;                                               // 0x1628(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_1749;                                              // 0x1630(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_178;                                               // 0x1638(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_179;                                               // 0x1640(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_180;                                               // 0x1648(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_181;                                               // 0x1650(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_182;                                               // 0x1658(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_187;                                               // 0x1660(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_1928;                                              // 0x1668(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_1929;                                              // 0x1670(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_2047;                                              // 0x1678(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_2373;                                              // 0x1680(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_2712;                                              // 0x1688(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_2713;                                              // 0x1690(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_3195;                                              // 0x1698(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_321;                                               // 0x16A0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_3213;                                              // 0x16A8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_3214;                                              // 0x16B0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_3312;                                              // 0x16B8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_3313;                                              // 0x16C0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_3455;                                              // 0x16C8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_3513;                                              // 0x16D0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_3514;                                              // 0x16D8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_357;                                               // 0x16E0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_4196;                                              // 0x16E8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_43;                                                // 0x16F0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_4201;                                              // 0x16F8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_4202;                                              // 0x1700(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_4203;                                              // 0x1708(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_431;                                               // 0x1710(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_444;                                               // 0x1718(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_4615;                                              // 0x1720(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_4616;                                              // 0x1728(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_520;                                               // 0x1730(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_5469;                                              // 0x1738(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_5470;                                              // 0x1740(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_8081;                                              // 0x1748(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_8082;                                              // 0x1750(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_815;                                               // 0x1758(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Image_816;                                               // 0x1760(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           IncreasePvPRespawnInterval;                              // 0x1768(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             IncreasePvPRespawnIntervalBaseAmountSlider;              // 0x1770(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    IncreasePvPRespawnIntervalBaseAmountValue;               // 0x1778(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             IncreasePvPRespawnIntervalCheckPeriodSlider;             // 0x1780(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    IncreasePvPRespawnIntervalCheckPeriodValue;              // 0x1788(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             IncreasePvPRespawnIntervalSlider;                        // 0x1790(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    IncreasePvPRespawnIntervalValue;                         // 0x1798(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             ItemDecompositionTimeSlider;                             // 0x17A0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    ItemDecompositionTimeValue;                              // 0x17A8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             KillXPMultiplierSlider;                                  // 0x17B0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    KillXPMultiplierValue;                                   // 0x17B8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             LayEggIntervalSlider;                                    // 0x17C0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    LayEggIntervalValue;                                     // 0x17C8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    ListenServerTetherDistanceMultiplier;                    // 0x17D0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             ListenServerTetherDistanceMultiplierSlider;              // 0x17D8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              LockedImage;                                             // 0x17E0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              MapImage;                                                // 0x17E8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             MatingIntervalSlider;                                    // 0x17F0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    MatingIntervalValue;                                     // 0x17F8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           MaxDifficultyCheckbox;                                   // 0x1800(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    MaxExperienceDinoEditBox;                                // 0x1808(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    MaxExperiencePlayerEditBox;                              // 0x1810(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    MaxNumberOfPlayersInTribeEditBox;                        // 0x1818(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             MaxStructuresInRange;                                    // 0x1820(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    MaxStructuresInRangeValue;                               // 0x1828(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             NightTimeSpeedSlider;                                    // 0x1830(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    NightTimeSpeedValue;                                     // 0x1838(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           NonPermanentDiseases;                                    // 0x1840(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           NotifyPlayerJoinedCheckbox;                              // 0x1848(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           NotifyPlayerLeftCheckbox;                                // 0x1850(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           NoTributesDownloadsCheckbox;                             // 0x1858(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           OnlyAllowSpecifiedEngrams;                               // 0x1860(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           OverideStructurePlatformPrevention;                      // 0x1868(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           OverwriteMapWithBackupChkBox;                            // 0x1870(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UWidgetSwitcher*                                     PanelSwitcher;                                           // 0x1878(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           PassiveDefensesDamageRiderlessDinos;                     // 0x1880(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PasswordField;                                           // 0x1888(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamed_Damage_Slider;                    // 0x1890(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamed_Damage_Value;                     // 0x1898(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamed_Food_Slider;                      // 0x18A0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamed_Food_Value;                       // 0x18A8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamed_Health_Slider;                    // 0x18B0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamed_Health_Value;                     // 0x18B8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamed_Oxygen_Slider;                    // 0x18C0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamed_Oxygen_Value;                     // 0x18C8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamed_Speed_Slider;                     // 0x18D0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamed_Speed_Value;                      // 0x18D8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamed_Stamina_Slider;                   // 0x18E0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamed_Stamina_Value;                    // 0x18E8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamed_Temperature_Slider;               // 0x18F0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamed_Temperature_Value;                // 0x18F8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamed_TemperatureFortitude_Slider;      // 0x1900(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamed_TemperatureFortitude_Value;       // 0x1908(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamed_Torpidity_Slider;                 // 0x1910(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamed_Torpidity_Value;                  // 0x1918(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamed_Water_Slider;                     // 0x1920(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamed_Water_Value;                      // 0x1928(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamed_Weight_Slider;                    // 0x1930(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamed_Weight_Value;                     // 0x1938(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAdd_Damage_Slider;                 // 0x1940(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAdd_Damage_Value;                  // 0x1948(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAdd_Food_Slider;                   // 0x1950(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAdd_Food_Value;                    // 0x1958(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAdd_Health_Slider;                 // 0x1960(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAdd_Health_Value;                  // 0x1968(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAdd_Oxygen_Slider;                 // 0x1970(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAdd_Oxygen_Value;                  // 0x1978(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAdd_Speed_Slider;                  // 0x1980(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAdd_Speed_Value;                   // 0x1988(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAdd_Stamina_Slider;                // 0x1990(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAdd_Stamina_Value;                 // 0x1998(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAdd_Temperature_Slider;            // 0x19A0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAdd_Temperature_Value;             // 0x19A8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAdd_TemperatureFortitude_Slider;   // 0x19B0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAdd_TemperatureFortitude_Value;    // 0x19B8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAdd_Torpidity_Slider;              // 0x19C0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAdd_Torpidity_Value;               // 0x19C8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAdd_Water_Slider;                  // 0x19D0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAdd_Water_Value;                   // 0x19D8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAdd_Weight_Slider;                 // 0x19E0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAdd_Weight_Value;                  // 0x19E8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAff_Damage_Slider;                 // 0x19F0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAff_Damage_Value;                  // 0x19F8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAff_Food_Slider;                   // 0x1A00(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAff_Food_Value;                    // 0x1A08(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAff_Health_Slider;                 // 0x1A10(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAff_Health_Value;                  // 0x1A18(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAff_Oxygen_Slider;                 // 0x1A20(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAff_Oxygen_Value;                  // 0x1A28(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAff_Speed_Slider;                  // 0x1A30(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAff_Speed_Value;                   // 0x1A38(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAff_Stamina_Slider;                // 0x1A40(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAff_Stamina_Value;                 // 0x1A48(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAff_Temperature_Slider;            // 0x1A50(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAff_Temperature_Value;             // 0x1A58(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAff_TemperatureFortitude_Slider;   // 0x1A60(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAff_TemperatureFortitude_Value;    // 0x1A68(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAff_Torpidity_Slider;              // 0x1A70(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAff_Torpidity_Value;               // 0x1A78(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAff_Water_Slider;                  // 0x1A80(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAff_Water_Value;                   // 0x1A88(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoTamedAff_Weight_Slider;                 // 0x1A90(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoTamedAff_Weight_Value;                  // 0x1A98(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoWild_Damage_Slider;                     // 0x1AA0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoWild_Damage_Value;                      // 0x1AA8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoWild_Food_Slider;                       // 0x1AB0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoWild_Food_Value;                        // 0x1AB8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoWild_Health_Slider;                     // 0x1AC0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoWild_Health_Value;                      // 0x1AC8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoWild_Oxygen_Slider;                     // 0x1AD0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoWild_Oxygen_Value;                      // 0x1AD8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoWild_Speed_Slider;                      // 0x1AE0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoWild_Speed_Value;                       // 0x1AE8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoWild_Stamina_Slider;                    // 0x1AF0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoWild_Stamina_Value;                     // 0x1AF8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoWild_Temperature_Slider;                // 0x1B00(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoWild_Temperature_Value;                 // 0x1B08(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoWild_TemperatureFortitude_Slider;       // 0x1B10(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoWild_TemperatureFortitude_Value;        // 0x1B18(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoWild_Torpidity_Slider;                  // 0x1B20(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoWild_Torpidity_Value;                   // 0x1B28(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoWild_Water_Slider;                      // 0x1B30(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoWild_Water_Value;                       // 0x1B38(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsDinoWild_Weight_Slider;                     // 0x1B40(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsDinoWild_Weight_Value;                      // 0x1B48(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsPlayer_Damage_Slider;                       // 0x1B50(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsPlayer_Damage_Value;                        // 0x1B58(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsPlayer_Food_Slider;                         // 0x1B60(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsPlayer_Food_Value;                          // 0x1B68(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsPlayer_Health_Slider;                       // 0x1B70(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsPlayer_Health_Value;                        // 0x1B78(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsPlayer_Oxygen_Slider;                       // 0x1B80(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsPlayer_Oxygen_Value;                        // 0x1B88(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsPlayer_Speed_Slider;                        // 0x1B90(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsPlayer_Speed_Value;                         // 0x1B98(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsPlayer_Stamina_Slider;                      // 0x1BA0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsPlayer_Stamina_Value;                       // 0x1BA8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsPlayer_Temperature_Slider;                  // 0x1BB0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsPlayer_Temperature_Value;                   // 0x1BB8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsPlayer_TemperatureFortitude_Slider;         // 0x1BC0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsPlayer_TemperatureFortitude_Value;          // 0x1BC8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsPlayer_Torpidity_Slider;                    // 0x1BD0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsPlayer_Torpidity_Value;                     // 0x1BD8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsPlayer_Water_Slider;                        // 0x1BE0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsPlayer_Water_Value;                         // 0x1BE8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerLevelStatsPlayer_Weight_Slider;                       // 0x1BF0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerLevelStatsPlayer_Weight_Value;                        // 0x1BF8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PerPlatformMaxStructuresMultiplier_Slider;               // 0x1C00(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PerPlatformMaxStructuresMultiplier_Value;                // 0x1C08(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PlayerCharacterFoodDrainSlider;                          // 0x1C10(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PlayerCharacterFoodDrainValue;                           // 0x1C18(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PlayerCharacterHealthRecoverySlider;                     // 0x1C20(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PlayerCharacterHealthRecoveryValue;                      // 0x1C28(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PlayerCharacterStaminaDrainSlider;                       // 0x1C30(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PlayerCharacterStaminaDrainValue;                        // 0x1C38(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PlayerCharacterWaterDrainSlider;                         // 0x1C40(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PlayerCharacterWaterDrainValue;                          // 0x1C48(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PlayerDamageSlider;                                      // 0x1C50(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PlayerDamageValue;                                       // 0x1C58(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PlayerHarvestingDamageSlider;                            // 0x1C60(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PlayerHarvestingDamageValue;                             // 0x1C68(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PlayerResistanceSlider;                                  // 0x1C70(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PlayerResistanceValue;                                   // 0x1C78(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PoopIntervalSlider;                                      // 0x1C80(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PoopIntervalValue;                                       // 0x1C88(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 PopModBtn;                                               // 0x1C90(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           PreventDiseases;                                         // 0x1C98(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           PreventDownloadDinos;                                    // 0x1CA0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           PreventDownloadItems;                                    // 0x1CA8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           PreventDownloadSurvivors;                                // 0x1CB0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           PreventOfflinePvP;                                       // 0x1CB8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PreventOfflinePvPIntervalEditBox;                        // 0x1CC0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PreventOfflinePvPIntervalSlider;                         // 0x1CC8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           PreventTribeAlliances;                                   // 0x1CD0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           PrivateMatchCB;                                          // 0x1CD8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 ProceduralSettingButton;                                 // 0x1CE0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           ProximityChatCheckbox;                                   // 0x1CE8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 PushModBtn;                                              // 0x1CF0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           PvEAllowTribeWar;                                        // 0x1CF8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           PvEAllowTribeWarCancel;                                  // 0x1D00(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PvEDinoDecayPeriodSlider;                                // 0x1D08(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PvEDinoDecayPeriodValue;                                 // 0x1D10(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PvEStructureDecayPeriodSlider;                           // 0x1D18(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PvEStructureDecayPeriodValue;                            // 0x1D20(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           PvPDinoDecay;                                            // 0x1D28(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             PvPZoneStructureDamageSlider;                            // 0x1D30(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    PvPZoneStructureDamageValue;                             // 0x1D38(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             RaidDinoCharacterFoodDrainMultiplierSlider;              // 0x1D40(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    RaidDinoCharacterFoodDrainMultiplierValue;               // 0x1D48(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 ResetSettings;                                           // 0x1D50(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             ResourceNoReplenishRadiusPlayersSlider;                  // 0x1D58(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    ResourceNoReplenishRadiusPlayersValue;                   // 0x1D60(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             ResourceNoReplenishRadiusStructuresSlider;               // 0x1D68(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    ResourceNoReplenishRadiusStructuresValue;                // 0x1D70(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             ResourcesRespawnPeriodSlider;                            // 0x1D78(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    ResourcesRespawnPeriodValue;                             // 0x1D80(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UWidgetSwitcher*                                     RightPanelSwitcher;                                      // 0x1D88(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           ServerCrosshairCheckbox;                                 // 0x1D90(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           ServerForceNoHUDCheckbox;                                // 0x1D98(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           ServerHardcoreCheckbox;                                  // 0x1DA0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           ServerPvECheckbox;                                       // 0x1DA8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    SessionNameField;                                        // 0x1DB0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           ShowCreativeModeCheckbox;                                // 0x1DB8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           ShowFloatingDamageText;                                  // 0x1DC0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           ShowMapPlayerLocationCheckbox;                           // 0x1DC8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             SpecialXPMultiplierSlider;                               // 0x1DD0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    SpecialXPMultiplierValue;                                // 0x1DD8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             SpoilingTimeSlider;                                      // 0x1DE0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    SpoilingTimeValue;                                       // 0x1DE8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             StructureDamageRepairCooldownSlider;                     // 0x1DF0(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    StructureDamageRepairCooldownValue;                      // 0x1DF8(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             StructureDamageSlider;                                   // 0x1E00(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    StructureDamageValue;                                    // 0x1E08(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             StructurePreventResourceRadiusMultiplierSlider;          // 0x1E10(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    StructurePreventResourceRadiusMultiplierValue;           // 0x1E18(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             StructureResistanceSlider;                               // 0x1E20(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    StructureResistanceValue;                                // 0x1E28(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             SupplyCrateLootQualitySlider;                            // 0x1E30(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    SupplyCrateLootQualityValue;                             // 0x1E38(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Tab3_Crafting;                                           // 0x1E40(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Tab3_Creatures;                                          // 0x1E48(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UImage*                                              Tab3_Inventory;                                          // 0x1E50(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UWidgetSwitcher*                                     TabBgSwitcher;                                           // 0x1E58(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             TamingSpeedSlider;                                       // 0x1E60(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    TamingSpeedValue;                                        // 0x1E68(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           ThirdPersonCheckbox;                                     // 0x1E70(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCustomButtonWidget*                                 UpdateModsButton;                                        // 0x1E78(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           UseCorpseLocatorCheckbox;                                // 0x1E80(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UCheckBox*                                           UseSingleplayerSettingsCheckbox;                         // 0x1E88(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class USlider*                                             XPSlider;                                                // 0x1E90(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class UEditableTextBox*                                    XPValue;                                                 // 0x1E98(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		class AGameMode*                                           CallFunc_GetGameMode_ReturnValue;                        // 0x1EA0(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FGeometry                                           K2Node_Event_MyGeometry;                                 // 0x1EA8(0x0034) Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      K2Node_Event_InDeltaTime;                                // 0x1EDC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AShooterGame_Menu*                                   K2Node_DynamicCast_AsShooterGame_Menu;                   // 0x1EE0(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast_CastSuccess;                          // 0x1EE8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_Q8EV[0x7];                                   // 0x1EE9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AShooterGame_Menu*                                   K2Node_DynamicCast_AsShooterGame_Menu2;                  // 0x1EF0(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast2_CastSuccess;                         // 0x1EF8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_97PI[0x7];                                   // 0x1EF9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UUserWidget*                                         CallFunc_Create_ReturnValue;                             // 0x1F00(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NotEqual_ClassClass_ReturnValue;                // 0x1F08(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor

	public:
		void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
		void BndEvt__ARKModsButton_K2Node_ComponentBoundEvent_308_OnButtonClickedEvent__DelegateSignature();
		void ExecuteUbergraph_HostSession(int32_t EntryPoint);
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
