#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class ShooterGame.PrimalDinoAIController
	 * Size -> 0x0318 (FullSize[0x08B8] - InheritedSize[0x05A0])
	 */
	class APrimalDinoAIController : public AAIController
	{
	public:
		float                                                      DieIfLeftWaterWanderMinimumWaterHeightMultiplier;        // 0x05A0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      DieIfLeftWaterReachedRadiusDistanceCheckMultiplier;      // 0x05A4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      DieIfLeftWaterTargetUnsubmergedTimeout;                  // 0x05A8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      LandDinoMaxWaterTargetDepthCapsuleMultiplier;            // 0x05AC(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      ExtraCorpseTargetingRange;                               // 0x05B0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      FleeFromAttackCoolDownTime;                              // 0x05B4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      FleeFromAttackTimeLimit;                                 // 0x05B8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      ForceFleeUnderHealthPercentage;                          // 0x05BC(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bFleeOnCriticalHealth;                                   // 0x05C0(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_B2CX[0x3];                                   // 0x05C1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      DieIfLeftWaterTargetingRequiresFreeDepth;                // 0x05C4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		double                                                     LastBlockadeCheckTime;                                   // 0x05C8(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		double                                                     LastMovingAroundBlockadeTime;                            // 0x05D0(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		float                                                      MovingAroundBlockadeDirection;                           // 0x05D8(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		struct FVector                                             MovingAroundBlockadePoint;                               // 0x05DC(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		float                                                      LastBlockadeWidth;                                       // 0x05E8(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		struct FVector                                             LastBlockadeHitNormal;                                   // 0x05EC(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		struct FVector                                             LastBlockadeHitLocation;                                 // 0x05F8(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		struct FVector                                             StartMovingAroundBlockadeLocation;                       // 0x0604(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		class AActor*                                              LastMovingAroundBlockadeActor;                           // 0x0610(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		bool                                                       bForcedAggro : 1;                                        // 0x0618(0x0001) BIT_FIELD Edit, Transient, NoDestructor
		unsigned char                                              UnknownData_6QPZ[0x7];                                   // 0x0619(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              ForceTargetActor;                                        // 0x0620(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		class AActor*                                              Target;                                                  // 0x0628(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		float                                                      AttackDestinationOffset;                                 // 0x0630(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bUseOverlapTargetCheck;                                  // 0x0634(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bNotifyNeighborsWithoutDamage;                           // 0x0635(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bUseBPShouldNotifyNeighbor;                              // 0x0636(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bUseBPShouldNotifyAnyNeighbor;                           // 0x0637(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bRequireAbsoluteDamageForNeighborNotification;           // 0x0638(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_WQEH[0x3];                                   // 0x0639(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AboveDeltaZAttackRange;                                  // 0x063C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      BelowDeltaZAttackRange;                                  // 0x0640(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      WildAboveDeltaZTargetingRange;                           // 0x0644(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      WildBelowDeltaZTargetingRange;                           // 0x0648(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bWildUseDeltaZTargetingForFlyerPawnOrBigDino;            // 0x064C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_P5GS[0x13];                                  // 0x064D(0x0013) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bDontWander;                                             // 0x0660(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bOnlyOverlapTargetCorpsesUnlessHasTarget;                // 0x0661(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_3DJB[0x2];                                   // 0x0662(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      NaturalTargetingRange;                                   // 0x0664(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      TamedTargetingRange;                                     // 0x0668(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      TamedCorpseFoodTargetingRange;                           // 0x066C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      WanderRandomDistanceAmount;                              // 0x0670(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      FlyingWanderFixedDistanceAmount;                         // 0x0674(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      FlyingWanderRandomDistanceAmount;                        // 0x0678(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      MaxFlyingTargetDeltaZ;                                   // 0x067C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      WanderFlyingZScaler;                                     // 0x0680(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      WanderFlyingClampZHeightAboveGround;                     // 0x0684(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      WanderFlyingMinZHeightAboveGround;                       // 0x0688(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      WanderFixedDistanceAmount;                               // 0x068C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bUseAggro;                                               // 0x0690(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_5TNM[0x3];                                   // 0x0691(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinAggroValue;                                           // 0x0694(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AggroToAddUponRemovingTarget;                            // 0x0698(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AggroToAddUponAcquiringTarget;                           // 0x069C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AggroFactorDecreaseSpeed;                                // 0x06A0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AggroFactorDecreaseGracePeriod;                          // 0x06A4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AggroFactorDamagePercentageMultiplier;                   // 0x06A8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AggroNotifyNeighborsMultiplier;                          // 0x06AC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AggroNotifyNeighborsRange;                               // 0x06B0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AggroNotifyNeighborsRangeFalloff;                        // 0x06B4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      TargetingDistanceReductionFactorLinear;                  // 0x06B8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      TargetingDistanceReductionFactorExponent;                // 0x06BC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      BeyondTargetingRangeAggroAddition;                       // 0x06C0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AggroFactorDesirabilityMultiplier;                       // 0x06C4(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AttackRange;                                             // 0x06C8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AttackInterval;                                          // 0x06CC(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AttackRotationRangeDegrees;                              // 0x06D0(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      AttackRotationGroundSpeedMultiplier;                     // 0x06D4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      RangeTargetWildDinosMultiplier;                          // 0x06D8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FRotator                                            AttackRotationRate;                                      // 0x06DC(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bFocusOnTargetDuringAttack;                              // 0x06E8(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_HOXO[0x3];                                   // 0x06E9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             FlyingMoveTowardsTargetOffset;                           // 0x06EC(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector                                             CombatFlyingMoveTowardsTargetOffset;                     // 0x06F8(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector                                             FlyingTargetFocalPositionOffset;                         // 0x0704(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      FlyingReachedDestinationThresholdOffset;                 // 0x0710(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      SeekingIntervalCheckToFly;                               // 0x0714(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      SeekingPercentChanceToFly;                               // 0x0718(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      SeekingIntervalCheckToLand;                              // 0x071C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      SeekingPercentChanceToLand;                              // 0x0720(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      MinimumWanderGroundNormalZ;                              // 0x0724(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      FollowStoppingDistance;                                  // 0x0728(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bUseOverlapTargetCheckTraces;                            // 0x072C(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bUseAlternateMovePoint;                                  // 0x072D(0x0001) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		bool                                                       bTotallyIgnoreWaterTargets;                              // 0x072E(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bWaterDinoAllowUnsubmergedTargets;                       // 0x072F(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector                                             LastCheckAttackRangePawnLocation;                        // 0x0730(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		struct FVector                                             LastCheckAttackRangeClosestPoint;                        // 0x073C(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		struct FVector                                             LastCheckAttackRangeTargetLocation;                      // 0x0748(0x000C) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_BKG7[0x4];                                   // 0x0754(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              LastCheckAttackRangeTarget;                              // 0x0758(0x0008) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		bool                                                       HasAttackPriority;                                       // 0x0760(0x0001) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_WCX4[0x7];                                   // 0x0761(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<float>                                              TamedAITargetingRangeMultipliers;                        // 0x0768(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		float                                                      MateBoostAggroNotifyNeighborsMultiplier;                 // 0x0778(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_W2VE[0x4];                                   // 0x077C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UBehaviorTree*                                       BehaviourTree;                                           // 0x0780(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		class UBehaviorTree*                                       HasEnemyTree;                                            // 0x0788(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		class UBehaviorTree*                                       BabyHasEnemyTree;                                        // 0x0790(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		class UBehaviorTree*                                       ForcedAggroHasEnemyTree;                                 // 0x0798(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		class UBehaviorTree*                                       NoEnemyTree;                                             // 0x07A0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		class UBehaviorTree*                                       FleeFromAttackTree;                                      // 0x07A8(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		class UBehaviorTree*                                       TamedNoEnemyTree;                                        // 0x07B0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		class UBehaviorTree*                                       MissionTree;                                             // 0x07B8(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		TArray<class UClass*>                                      AggroNotifyNeighborsClasses;                             // 0x07C0(0x0010) Edit, ZeroConstructor
		bool                                                       bIgnoreMoveAroundBlockade : 1;                           // 0x07D0(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor
		bool                                                       bFlyingUseMoveAroundBlockade : 1;                        // 0x07D0(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor
		bool                                                       bUseGeometryInsteadOfStationObjForFreeDepthTest : 1;     // 0x07D0(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor
		bool                                                       bNotifyBPTargetSet : 1;                                  // 0x07D0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor
		bool                                                       bUseBPSetupFindTarget : 1;                               // 0x07D0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor
		bool                                                       bNotAllowedToFindTargets : 1;                            // 0x07D0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor
		bool                                                       bAllowForceFleeToSameTargetingTeam : 1;                  // 0x07D0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor
		bool                                                       bUseBPUpdateBestTarget : 1;                              // 0x07D0(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor
		unsigned char                                              UnknownData_UO9Z[0x3];                                   // 0x07D1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MoveAroundBlockadeAdditionalWidth;                       // 0x07D4(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      MoveAroundObjectMaxVelocity;                             // 0x07D8(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      ForcedAggroTimeCounter;                                  // 0x07DC(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      TamedMaxFollowDistance;                                  // 0x07E0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bTargetChanged : 1;                                      // 0x07E4(0x0001) BIT_FIELD BlueprintVisible, NoDestructor
		bool                                                       bAttackForcesRunning : 1;                                // 0x07E4(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor
		bool                                                       bUseFlyingTargetOffsets : 1;                             // 0x07E4(0x0001) BIT_FIELD Edit, NoDestructor
		bool                                                       bRidingDinoTargetPlayer : 1;                             // 0x07E4(0x0001) BIT_FIELD Edit, NoDestructor
		bool                                                       bRidingPlayerTargetDino : 1;                             // 0x07E4(0x0001) BIT_FIELD Edit, NoDestructor
		bool                                                       bIgnoreWaterOrAmphibiousTargets : 1;                     // 0x07E4(0x0001) BIT_FIELD Edit, NoDestructor
		bool                                                       bUseBPTargetingDesire : 1;                               // 0x07E4(0x0001) BIT_FIELD Edit, NoDestructor
		bool                                                       bDisableForceFlee : 1;                                   // 0x07E4(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bUseCombatMoveTowardsTargetOffset : 1;                   // 0x07E5(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bUseBPOverrideIgnoredByWildDino : 1;                     // 0x07E5(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bCanUseAttackStateOnTargetChange : 1;                    // 0x07E5(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       UnknownData_7NQ8 : 1;                                    // 0x07E5(0x0001) BIT_FIELD (PADDING)
		bool                                                       bForceOnlyTargetingPlayerOrTamed : 1;                    // 0x07E5(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bForceTargetingAllStructures : 1;                        // 0x07E5(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bForceTargetDinoRider : 1;                               // 0x07E5(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bFlyerAllowWaterTargeting : 1;                           // 0x07E5(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bUseBPForceTargetDinoRider : 1;                          // 0x07E6(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bAlwaysStartledWhenAggroedByNeighbor : 1;                // 0x07E6(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bForceOnlyTargetingPlayers : 1;                          // 0x07E6(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bIsMissionDino : 1;                                      // 0x07E6(0x0001) BIT_FIELD Edit, NoDestructor
		bool                                                       bUseImprovedAggroFalloffBehavior : 1;                    // 0x07E6(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor
		unsigned char                                              UnknownData_CK9Z[0x1];                                   // 0x07E7(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      BaseStructureTargetingDesire;                            // 0x07E8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      LandDinoMaxFlyerTargetDeltaZ;                            // 0x07EC(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      NaturalMaxDepthZ;                                        // 0x07F0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		TWeakObjectPtr<class AActor>                               ForcedAttackTarget;                                      // 0x07F4(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		int32_t                                                    ForcedAttackEnemyTeam;                                   // 0x07FC(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		double                                                     LastForcedAttackEnemyTeamTime;                           // 0x0800(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_DKIR[0x4];                                   // 0x0808(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ForcedFleeDuration;                                      // 0x080C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      MinAttackIntervalForFleeing;                             // 0x0810(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      MinLocChangeIntervalForFleeing;                          // 0x0814(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      PercentageTorporForFleeing;                              // 0x0818(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      DamagedForceAggroInterval;                               // 0x081C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		double                                                     ForceAggroUntilTime;                                     // 0x0820(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		double                                                     LastExecutedAttackTime;                                  // 0x0828(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		double                                                     LastForcedFleeTime;                                      // 0x0830(0x0008) BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		double                                                     LastFleeLocCheckTime;                                    // 0x0838(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_EDH2[0xC];                                   // 0x0840(0x000C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    NumAlliesToAttack;                                       // 0x084C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      FindLandingPositionZOffset;                              // 0x0850(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      TamedFollowAcceptanceRadiusOffset;                       // 0x0854(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      TamedFollowAcceptanceHeightOffset;                       // 0x0858(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      AIFlightMaxLandingZDistance;                             // 0x085C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		double                                                     ForcedMoveToUntilTime;                                   // 0x0860(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_LAS5[0x8];                                   // 0x0868(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bUseBP_TamedOverrideHorizontalLandingRange : 1;          // 0x0870(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bFlyerWanderDefaultToOrigin : 1;                         // 0x0870(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bCheckBuffTargetingDesireOverride : 1;                   // 0x0870(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bAllowSwimWanderingForLandDinos : 1;                     // 0x0870(0x0001) BIT_FIELD Edit, NoDestructor
		bool                                                       bUse_BPOverrideLandingLocation : 1;                      // 0x0870(0x0001) BIT_FIELD Edit, NoDestructor
		unsigned char                                              UnknownData_ICE9[0x7];                                   // 0x0871(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UClass*>                                      WildTargetingDesireMultiplierClasses;                    // 0x0878(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<float>                                              WildTargetingDesireMultiplierValues;                     // 0x0888(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class UClass*>                                      TamedTargetingDesireMultiplierClasses;                   // 0x0898(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<float>                                              TamedTargetingDesireMultiplierValues;                    // 0x08A8(0x0010) Edit, ZeroConstructor, DisableEditOnInstance

	public:
		bool WantsAttackPriority();
		void UpdateAggro();
		void StopBrainComponent(const class FString& Reason);
		struct FVector STATIC_StaticGetRandomWanderDestination(class APrimalDinoCharacter* TargetCharacter, class APrimalDinoAIController* TargetAIController, const struct FVector& locOverride, float randomOffsetMultiplier, bool bUseRandomNegativeXDir, bool bOrientRandOffsetByRotation, const struct FRotator& orientRandOffsetByRotation, float GroundCheckSpreadOverride);
		bool ShouldForceRunWhenAttacking();
		void SetTarget(class AActor* InTarget, bool bDontAddAggro, bool bOverlapFoundTarget);
		void SetHasAttackPriority(bool Value);
		void SetAttackRotationRate();
		void SetAttackGroundSpeed();
		void ResumeBrainComponent(const class FString& Reason);
		void RestartBrainComponent();
		void ResetRotationUseAcceleration();
		void ResetRotationRate();
		void ResetGroundSpeed();
		void ResetAccelerationFollowsRotation();
		void RecoverMovement();
		void RebootBrainComponent();
		void PlayStartledAnim();
		void PauseBrainComponent(const class FString& Reason);
		bool OrderedToLand();
		void OnLosingTargetEvent();
		bool IsWithinAttackRangeAndCalculateBestAttack(class AActor* Other, bool* bAttackChanged);
		bool IsWithinAttackRange(class AActor* Other, bool bForceUseLastAttackIndex);
		bool IsLogicPaused();
		bool IsForceTargetDinoRider(class AShooterCharacter* playerTarget);
		struct FVector GetWanderAroundActorDestination(class APrimalDinoCharacter* DinoCharacter, const struct FVector& originalDestination);
		class AActor* GetTarget();
		struct FVector GetRandomWanderDestination(const struct FVector& locOverride, float randomOffsetMultiplier, bool bUseRandomNegativeXDir, bool bOrientRandOffsetByRotation, const struct FRotator& orientRandOffsetByRotation);
		float GetMinAttackRange();
		struct FVector GetLandingLocation();
		bool GetHasAttackPriority();
		unsigned char GetCurrentAttackIndex();
		class APawn* GetControllerPawn();
		class APrimalDinoCharacter* GetControlledDino();
		class UStaticMeshComponent* GetClosestTree(struct FOverlapResult* OutHit);
		struct FRotator GetAttackRotationRate();
		float GetAttackRotationRangeDegrees();
		float GetAttackRotationGroundSpeedMultiplier();
		float GetAttackRange();
		float GetAttackInterval();
		float GetAggroNotifyNeighborsRange();
		bool GetAggroEntry(int32_t index, class AActor** OutAttacker, float* OutAggroFactor, double* OutLastAggroHitTime);
		int32_t GetAggroEntriesCount();
		class AActor* GetAggroEntriesAttackerAtIndex(int32_t index);
		float GetAggroDesirability(class AActor* InTarget);
		class AActor* FindTarget(bool bDontSet);
		class AActor* FindNewTarget(bool bDontSet);
		void ClearAggroEntries();
		void ChangedAITarget();
		bool CanLand();
		bool CalculateAndSetWonderingAIStateEvent(bool StateChanged);
		bool CalculateAndSetWonderingAIState(bool* StateChanged);
		class AActor* BPUpdateBestTarget(class AActor* bestTarget, bool dontSetIn, bool* dontSetOut);
		bool BPShouldNotifyNeighbor(class APrimalDinoCharacter* neighbor);
		bool BPShouldNotifyAnyNeighbor(class APrimalDinoCharacter* neighbor);
		void BPSetupFindTarget();
		struct FVector BPOverrideLandingLocation(float* outRadius);
		bool BPOverrideIgnoredByWildDino(class AActor* wildDinoToIgnore);
		void BPOnFleeEvent();
		void BPNotifyTargetSet();
		float BPGetTargetingDesire(class AActor* forTarget, float ForTargetingDesireValue);
		bool BPForceTargetDinoRider(class AShooterCharacter* playerTarget);
		struct FVector2D BP_TamedOverrideHorizontalLandingRange();
		void AvoidOutOfWater();
		void AvoidGenericToPoint(const struct FVector& TargetDestination);
		void AddToAggro(class AActor* Attacker, float DamagePercent, bool bNotifyNeighbors, bool SetValue, bool bIsFromDamage, bool skipTeamCheck);
		static UClass* StaticClass();
	};

	/**
	 * Class ShooterGame.AIAttackCoordinator
	 * Size -> 0x0020 (FullSize[0x0490] - InheritedSize[0x0470])
	 */
	class AAIAttackCoordinator : public AActor
	{
	public:
		int32_t                                                    MaxAttackersPerTarget;                                   // 0x0470(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      UpdateInterval;                                          // 0x0474(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		TArray<TWeakObjectPtr<class APrimalDinoAIController>>      Attackers;                                               // 0x0478(0x0010) ZeroConstructor, Transient, Protected
		unsigned char                                              UnknownData_N0JW[0x8];                                   // 0x0488(0x0008) MISSED OFFSET (PADDING)

	public:
		void UpdateAttackGroup(TArray<class APrimalDinoAIController*>* AttackGroup);
		void RemoveAttacker(class APrimalDinoAIController* Controller);
		int32_t GetNumAttackersWithPriorityForTarget(class AActor* Target);
		int32_t GetNumAttackersForTarget(class AActor* Target);
		void ClearAllAttackers();
		float CalculateAttackerPriorityWeight(class APrimalDinoAIController* Attacker);
		void AddAttackerCharacter(class APrimalDinoCharacter* Character);
		void AddAttacker(class APrimalDinoAIController* Controller);
		static UClass* StaticClass();
	};

	/**
	 * Class ShooterGame.CorruptedAvatarAttackCoordinator
	 * Size -> 0x0008 (FullSize[0x0498] - InheritedSize[0x0490])
	 */
	class ACorruptedAvatarAttackCoordinator : public AAIAttackCoordinator
	{
	public:
		unsigned char                                              UnknownData_3LM7[0x8];                                   // 0x0490(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ShooterGame.PrimalGlobals
	 * Size -> 0x0190 (FullSize[0x01B8] - InheritedSize[0x0028])
	 */
	class UPrimalGlobals : public UObject
	{
	public:
		class UPrimalGameData*                                     PrimalGameData;                                          // 0x0028(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		class UPrimalGameData*                                     PrimalGameDataOverride;                                  // 0x0030(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor
		struct FStringAssetReference                               PrimalGameDataAsset;                                     // 0x0038(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<struct FStringAssetReference>                       PrimalGameDataAssetExtended;                             // 0x0048(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		class UClass*                                              RagdollKinematicActorClass;                              // 0x0058(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class UClass*                                              GlobalGenericConfirmationDialog;                         // 0x0060(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		TArray<class UObject*>                                     ExtraResources;                                          // 0x0068(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		bool                                                       bAllowSingleplayer;                                      // 0x0078(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bAllowNonDedicatedHost;                                  // 0x0079(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_UBZW[0x6];                                   // 0x007A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FString>                                      UIOnlyShowMapFileNames;                                  // 0x0080(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class FString>                                      UIOnlyShowModIDs;                                        // 0x0090(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		bool                                                       bTotalConversionShowUnofficialServers;                   // 0x00A0(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_UBNF[0x7];                                   // 0x00A1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              CreditString;                                            // 0x00A8(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance
		struct FLinearColor                                        AlphaMissionColor;                                       // 0x00B8(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FLinearColor                                        BetaMissionColor;                                        // 0x00C8(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FLinearColor                                        GammaMissionColor;                                       // 0x00D8(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FLinearColor                                        MissionCompleteMultiUseWheelTextColor;                   // 0x00E8(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_BX44[0xC0];                                  // 0x00F8(0x00C0) MISSED OFFSET (PADDING)

	public:
		void OnConfirmationDialogClosed(bool bAccept);
		class ADayCycleManager* STATIC_GetDayCycleManager(class UWorld* World);
		void FinishedLoadingGameMedia();
		static UClass* StaticClass();
	};

	/**
	 * Class ShooterGame.DataListProviderInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UDataListProviderInterface : public UInterface
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ShooterGame.PrimalGameData
	 * Size -> 0x20B8 (FullSize[0x20E0] - InheritedSize[0x0028])
	 */
	class UPrimalGameData : public UObject
	{
	public:
		unsigned char                                              UnknownData_KCB3[0x30];                                  // 0x0028(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              ModName;                                                 // 0x0058(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		class FString                                              ModDescription;                                          // 0x0068(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		struct FPrimalCharacterStatusValueDefinition               StatusValueDefinitions[0xC];                             // 0x0078(0x0180) Edit, DisableEditOnInstance
		struct FPrimalCharacterStatusStateDefinition               StatusStateDefinitions[0xE];                             // 0x01F8(0x0460) Edit, DisableEditOnInstance
		struct FPrimalItemStatDefinition                           ItemStatDefinitions[0x8];                                // 0x0658(0x00C0) Edit, DisableEditOnInstance
		struct FPrimalItemDefinition                               ItemTypeDefinitions[0x9];                                // 0x0718(0x00D8) Edit, DisableEditOnInstance
		struct FPrimalEquipmentDefinition                          EquipmentTypeDefinitions[0xB];                           // 0x07F0(0x0108) Edit, DisableEditOnInstance
		TArray<class UClass*>                                      MasterItemList;                                          // 0x08F8(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<struct FPrimalItemQuality>                          ItemQualityDefinitions;                                  // 0x0908(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class UClass*>                                      EngramBlueprintClasses;                                  // 0x0918(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class UClass*>                                      AdditionalEngramBlueprintClasses;                        // 0x0928(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class UClass*>                                      RemoveEngramBlueprintClasses;                            // 0x0938(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<struct FStatusValueModifierDescription>             StatusValueModifierDescriptions;                         // 0x0948(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class FString>                                      PlayerSpawnRegions;                                      // 0x0958(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		class USoundBase*                                          TutorialDisplaySound;                                    // 0x0968(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_StartItemDrag;                                     // 0x0970(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_StopItemDrag;                                      // 0x0978(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class UTexture2D*                                          PreventGrindingIcon;                                     // 0x0980(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_CancelPlacingStructure;                            // 0x0988(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_ChooseStructureRotation;                           // 0x0990(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_FailPlacingStructure;                              // 0x0998(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_ConfirmPlacingStructure;                           // 0x09A0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_StartPlacingStructure;                             // 0x09A8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_CorpseDecompose;                                   // 0x09B0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_ApplyLevelUp;                                      // 0x09B8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_ApplyLevelPoint;                                   // 0x09C0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_LearnedEngram;                                     // 0x09C8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_ReconnectToCharacter;                              // 0x09D0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_DropAllItems;                                      // 0x09D8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_TransferAllItemsToRemote;                          // 0x09E0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_TransferAllItemsFromRemote;                        // 0x09E8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_TransferItemToRemote;                              // 0x09F0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_TransferItemFromRemote;                            // 0x09F8(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_AddItemToSlot;                                     // 0x0A00(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_RemoveItemFromSlot;                                // 0x0A08(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_ClearCraftQueue;                                   // 0x0A10(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_AddToCraftQueue;                                   // 0x0A18(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_SetRadioFrequency;                                 // 0x0A20(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_AddPinToMap;                                       // 0x0A28(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_RemovePinFromMap;                                  // 0x0A30(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_ApplyDye;                                          // 0x0A38(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_ApplyPaint;                                        // 0x0A40(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_SetTextGeneric;                                    // 0x0A48(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_SplitItemStack;                                    // 0x0A50(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_MergeItemStack;                                    // 0x0A58(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_InputPinDigit;                                     // 0x0A60(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_PinValidated;                                      // 0x0A68(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_PinRejected;                                       // 0x0A70(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_TribeWarBegin;                                     // 0x0A78(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_TribeWarEnd;                                       // 0x0A80(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_DropInventoryItem;                                 // 0x0A88(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class USoundBase*                                          Sound_RefillWaterContainer;                              // 0x0A90(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		TArray<struct FAppIDItem>                                  CoreAppIDItems;                                          // 0x0A98(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<struct FAppIDItem>                                  AppIDItems;                                              // 0x0AA8(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class UPrimalEngramEntry*>                          EngramBlueprintEntries;                                  // 0x0AB8(0x0010) ZeroConstructor, Transient
		TArray<class UPrimalDinoEntry*>                            DinoEntriesObjects;                                      // 0x0AC8(0x0010) ZeroConstructor, Transient
		TArray<class UGenericDataListEntry*>                       ExplorerNoteEntriesObjects;                              // 0x0AD8(0x0010) ZeroConstructor, Transient
		TArray<class UGenericDataListEntry*>                       HeadHairStylesEntriesObjects;                            // 0x0AE8(0x0010) ZeroConstructor, Transient
		TArray<class UGenericDataListEntry*>                       FacialHairStylesEntriesObjects;                          // 0x0AF8(0x0010) ZeroConstructor, Transient
		class UClass*                                              DefaultToolTipWidget;                                    // 0x0B08(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class UClass*                                              StarterNoteItem;                                         // 0x0B10(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		TArray<class UClass*>                                      PrimaryResources;                                        // 0x0B18(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		class UClass*                                              GenericDroppedItemTemplate;                              // 0x0B28(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class UMaterialInterface*                                  PostProcess_KnockoutBlur;                                // 0x0B30(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class UMaterialInterface*                                  AdditionalDeathPostProcessEffect;                        // 0x0B38(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		TArray<class UMaterialInterface*>                          BuffPostProcessEffects;                                  // 0x0B40(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class UMaterialInterface*>                          AdditionalBuffPostProcessEffects;                        // 0x0B50(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<struct FRangedValues>                               EngramPointPurchaseRanges;                               // 0x0B60(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		class UClass*                                              GenericDroppedItemTemplateLowQuality;                    // 0x0B70(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_UI0V[0x10];                                  // 0x0B78(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
