#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum ShooterGame.EMissionState
	 */
	enum class EMissionState : uint8_t
	{
		ServerSetup = 0,
		Activated   = 1,
		Suspended   = 2,
		Deactivated = 3,
		MAX         = 4
	};

	/**
	 * Enum ShooterGame.EMissionTimerMode
	 */
	enum class EMissionTimerMode : uint8_t
	{
		HideTimer                = 0,
		ShowTimeRemaining        = 1,
		ShowTimeElapsed          = 2,
		UseBPGetMissionTimerText = 3,
		MAX                      = 4
	};

	/**
	 * Enum ShooterGame.ESpawnPattern
	 */
	enum class ESpawnPattern : uint8_t
	{
		Circle = 0,
		Grid   = 1,
		Random = 2,
		MAX    = 3
	};

	/**
	 * Enum ShooterGame.EMissionRelatedPropertyUsage
	 */
	enum class EMissionRelatedPropertyUsage : uint8_t
	{
		Prefix      = 0,
		Suffix      = 1,
		Description = 2,
		MAX         = 3
	};

	/**
	 * Enum ShooterGame.EMissionRelatedPropertyType
	 */
	enum class EMissionRelatedPropertyType : uint8_t
	{
		Name_PropertyType    = 0,
		String_PropertyType  = 1,
		Boolean_PropertyType = 2,
		Integer_PropertyType = 3,
		Float_PropertyType   = 4,
		Double_PropertyType  = 5,
		MAX                  = 6
	};

	/**
	 * Enum ShooterGame.ESTOFNotificationType
	 */
	enum class ESTOFNotificationType : uint8_t
	{
		Death           = 0,
		TribeEliminated = 1,
		MatchVictory    = 2,
		MatchDraw       = 3,
		MAX             = 4,
		MAX01           = 5
	};

	/**
	 * Enum ShooterGame.EPrimalARKTributeDataType
	 */
	enum class EPrimalARKTributeDataType : uint8_t
	{
		Items         = 0,
		TamedDinos    = 1,
		CharacterData = 2,
		MAX           = 3,
		MAX01         = 4
	};

	/**
	 * Enum ShooterGame.EPrimalCharacterStatusValue
	 */
	enum class EPrimalCharacterStatusValue : uint8_t
	{
		Health                  = 0,
		Stamina                 = 1,
		Torpidity               = 2,
		Oxygen                  = 3,
		Food                    = 4,
		Water                   = 5,
		Temperature             = 6,
		Weight                  = 7,
		MeleeDamageMultiplier   = 8,
		SpeedMultiplier         = 9,
		TemperatureFortitude    = 10,
		CraftingSpeedMultiplier = 11,
		MAX                     = 12,
		MAX01                   = 13
	};

	/**
	 * Enum ShooterGame.EBoolExecResult
	 */
	enum class EBoolExecResult : uint8_t
	{
		Success = 0,
		Failed  = 1,
		MAX     = 2
	};

	/**
	 * Enum ShooterGame.ECameraStyle
	 */
	enum class ECameraStyle : uint8_t
	{
		Default     = 0,
		FirstPerson = 1,
		ThirdPerson = 2,
		FreeCam     = 3,
		Orbit       = 4,
		Spectator   = 5,
		MAX         = 6
	};

	/**
	 * Enum ShooterGame.ETargetingTeamBehavior
	 */
	enum class ETargetingTeamBehavior : uint8_t
	{
		ExactMatch              = 0,
		FriendlyWith            = 1,
		PrioritizeButIncludeAny = 2,
		MAX                     = 3
	};

	/**
	 * Enum ShooterGame.EChatMessageType
	 */
	enum class EChatMessageType : uint8_t
	{
		MyMessage            = 0,
		SameTeamMessage      = 1,
		DifferentTeamMessage = 2,
		SystemWideMessage    = 3,
		SameAllianceMessage  = 4,
		MAX                  = 5,
		MAX01                = 6
	};

	/**
	 * Enum ShooterGame.EChatType
	 */
	enum class EChatType : uint8_t
	{
		GlobalChat      = 0,
		ProximityChat   = 1,
		RadioChat       = 2,
		GlobalTribeChat = 3,
		AllianceChat    = 4,
		MAX             = 5,
		MAX01           = 6
	};

	/**
	 * Enum ShooterGame.EChatSendMode
	 */
	enum class EChatSendMode : uint8_t
	{
		GlobalChat      = 0,
		GlobalTribeChat = 1,
		LocalChat       = 2,
		AllianceChat    = 3,
		MAX             = 4,
		MAX01           = 5
	};

	/**
	 * Enum ShooterGame.EShooterPhysMaterialType
	 */
	enum class EShooterPhysMaterialType : uint8_t
	{
		Unknown    = 0,
		Concrete   = 1,
		Dirt       = 2,
		Water      = 3,
		Metal      = 4,
		Wood       = 5,
		Grass      = 6,
		Glass      = 7,
		Flesh      = 8,
		Leaves     = 9,
		Rock       = 10,
		Sand       = 11,
		Snow       = 12,
		Corruption = 13,
		Lava       = 14,
		Acid       = 15,
		MAX        = 16,
		MAX01      = 17
	};

	/**
	 * Enum ShooterGame.EPlayerActionIndex
	 */
	enum class EPlayerActionIndex : uint8_t
	{
		None                     = 0,
		WhistleFollow            = 1,
		WhistleFollowOne         = 2,
		WhistleStop              = 3,
		WhistleStopOne           = 4,
		WhistleAggressive        = 5,
		WhistleNeutral           = 6,
		WhistlePassive           = 7,
		WhistleAttackTarget      = 8,
		WhistleLandFlyerOne      = 9,
		ShowInventory            = 10,
		ShowCraftables           = 11,
		ShowTribeManager         = 12,
		Poop                     = 13,
		UnHideCompanion          = 14,
		ShowEmoteSelection       = 15,
		Emote_HatSwitch          = 16,
		Emote_Salute             = 17,
		Emote_Sorry              = 18,
		Emote_Thank              = 19,
		Emote_Wave               = 20,
		Emote_Laugh              = 21,
		Emote_Yes                = 22,
		Emote_No                 = 23,
		Emote_Taunt              = 24,
		Emote_Cheer              = 25,
		Emote_FriendlyLowerHands = 26,
		Emote_MAX                = 27,
		MAX                      = 28
	};

	/**
	 * Enum ShooterGame.EMissionAlertType
	 */
	enum class EMissionAlertType : uint8_t
	{
		Positive = 0,
		Neutral  = 1,
		Negative = 2,
		MAX      = 3
	};

	/**
	 * Enum ShooterGame.EPhaseRequirementWidgetVisualState
	 */
	enum class EPhaseRequirementWidgetVisualState : uint8_t
	{
		Neutral  = 0,
		Positive = 1,
		Negative = 2,
		Custom   = 3,
		MAX      = 4
	};

	/**
	 * Enum ShooterGame.ELootItemType
	 */
	enum class ELootItemType : uint8_t
	{
		None             = 0,
		Element          = 1,
		Hexagons         = 2,
		ResourceCommon   = 3,
		ResourceUncommon = 4,
		ResourceRare     = 5,
		ArmorTier1       = 6,
		ArmorTier2       = 7,
		ArmorTier3       = 8,
		ArmorTek         = 9,
		WeaponTier1      = 10,
		WeaponTier2      = 11,
		WeaponTier3      = 12,
		WeaponTek        = 13,
		AmmoTier1        = 14,
		AmmoTier2        = 15,
		AmmoTier3        = 16,
		Saddle           = 17,
		MAX              = 18
	};

	/**
	 * Enum ShooterGame.ESimpleCurve
	 */
	enum class ESimpleCurve : uint8_t
	{
		Linear       = 0,
		Pow0         = 1,
		Pow1         = 2,
		Pow101       = 3,
		Pow2         = 4,
		Pow201       = 5,
		Pow3         = 6,
		Pow301       = 7,
		PowCos0      = 8,
		PowCos1      = 9,
		PowCos101    = 10,
		PowCos2      = 11,
		PowCos201    = 12,
		PowCos3      = 13,
		PowCos301    = 14,
		PowSin0      = 15,
		PowSin1      = 16,
		PowSin101    = 17,
		PowSin2      = 18,
		PowSin201    = 19,
		PowSin3      = 20,
		PowSin301    = 21,
		PowMinCos0   = 22,
		PowMinCos1   = 23,
		PowMinCos101 = 24,
		PowMinCos2   = 25,
		PowMinCos201 = 26,
		PowMinCos3   = 27,
		PowMinCos301 = 28,
		PowMax0      = 29,
		PowMax1      = 30,
		PowMax101    = 31,
		PowMax2      = 32,
		PowMax201    = 33,
		PowMax3      = 34,
		PowMax301    = 35,
		MAX          = 36
	};

	/**
	 * Enum ShooterGame.EHUDElementType
	 */
	enum class EHUDElementType : uint8_t
	{
		Text        = 0,
		ProgressBar = 1,
		Image       = 2,
		MAX         = 3
	};

	/**
	 * Enum ShooterGame.EHUDElementAnchorMode
	 */
	enum class EHUDElementAnchorMode : uint8_t
	{
		Specified     = 0,
		QuickbarLeft  = 1,
		QuickbarRight = 2,
		QuickbarTop   = 3,
		MAX           = 4
	};

	/**
	 * Enum ShooterGame.EStencilAlliance
	 */
	enum class EStencilAlliance : uint8_t
	{
		None       = 0,
		Friendly   = 1,
		NPC        = 2,
		NPCFleeing = 3,
		Hostile    = 4,
		Ally       = 5,
		Element    = 6,
		MAX        = 7
	};

	/**
	 * Enum ShooterGame.EHUDElementHorizontalAlignment
	 */
	enum class EHUDElementHorizontalAlignment : uint8_t
	{
		Center = 0,
		Left   = 1,
		Right  = 2,
		MAX    = 3
	};

	/**
	 * Enum ShooterGame.EHUDElementVerticalAlignment
	 */
	enum class EHUDElementVerticalAlignment : uint8_t
	{
		Center = 0,
		Top    = 1,
		Bottom = 2,
		MAX    = 3
	};

	/**
	 * Enum ShooterGame.ELeaderboardColumnName
	 */
	enum class ELeaderboardColumnName : uint8_t
	{
		MissionTag   = 0,
		PlayerNetId  = 1,
		TribeId      = 2,
		TimestampUtc = 3,
		FloatValue   = 4,
		IntValue     = 5,
		NameValue    = 6,
		StringValue  = 7,
		MAX          = 8
	};

	/**
	 * Enum ShooterGame.ELeaderboardGroupByMode
	 */
	enum class ELeaderboardGroupByMode : uint8_t
	{
		None    = 0,
		First   = 1,
		Min     = 2,
		Max     = 3,
		Sum     = 4,
		Count   = 5,
		Average = 6,
		MAX     = 7
	};

	/**
	 * Enum ShooterGame.ELeaderboardOrdering
	 */
	enum class ELeaderboardOrdering : uint8_t
	{
		Ascending  = 0,
		Descending = 1,
		MAX        = 2
	};

	/**
	 * Enum ShooterGame.EMassTeleportState
	 */
	enum class EMassTeleportState : uint8_t
	{
		INITIATED         = 0,
		TRIGGERED_SUCCESS = 1,
		TRIGGERED_FAILED  = 2,
		COMPLETED         = 3,
		CANCELLED         = 4,
		MAX               = 5
	};

	/**
	 * Enum ShooterGame.PrimalGameData.EPrimalCharacterStatusState
	 */
	enum class EPrimalCharacterStatusState : uint8_t
	{
		Dead         = 0,
		Winded       = 1,
		Starvation   = 2,
		Dehydration  = 3,
		Suffocation  = 4,
		Encumbered   = 5,
		Hypothermia  = 6,
		Hyperthermia = 7,
		Injured      = 8,
		KnockedOut   = 9,
		Sleeping     = 10,
		Cold         = 11,
		Hot          = 12,
		Crafting     = 13,
		MAX          = 14,
		MAX01        = 15
	};

	/**
	 * Enum ShooterGame.PrimalGameData.EPrimalConsumableType
	 */
	enum class EPrimalConsumableType : uint8_t
	{
		Food     = 0,
		Water    = 1,
		Medicine = 2,
		Other    = 3,
		MAX      = 4,
		MAX01    = 5
	};

	/**
	 * Enum ShooterGame.PrimalGameData.ELevelExperienceRampType
	 */
	enum class ELevelExperienceRampType : uint8_t
	{
		Player     = 0,
		DinoEasy   = 1,
		DinoMedium = 2,
		DinoHard   = 3,
		MAX        = 4,
		MAX01      = 5
	};

	/**
	 * Enum ShooterGame.PrimalGameData.EPrimalItemType
	 */
	enum class EPrimalItemType : uint8_t
	{
		MiscConsumable   = 0,
		Equipment        = 1,
		Weapon           = 2,
		Ammo             = 3,
		Structure        = 4,
		Resource         = 5,
		Skin             = 6,
		WeaponAttachment = 7,
		Artifact         = 8,
		MAX              = 9,
		MAX01            = 10
	};

	/**
	 * Enum ShooterGame.PrimalGameData.EPrimalCharacterInputType
	 */
	enum class EPrimalCharacterInputType : uint8_t
	{
		PrimaryFire       = 0,
		Targeting         = 1,
		AltFire           = 2,
		SwitchWeapon      = 3,
		Reload            = 4,
		Crouch            = 5,
		Prone             = 6,
		CrouchProneToggle = 7,
		SwitchMap         = 8,
		DinoAttack        = 9,
		MAX               = 10
	};

	/**
	 * Enum ShooterGame.PrimalGameData.EPrimalItemStat
	 */
	enum class EPrimalItemStat : uint8_t
	{
		GenericQuality         = 0,
		Armor                  = 1,
		MaxDurability          = 2,
		WeaponDamagePercent    = 3,
		WeaponClipAmmo         = 4,
		HypothermalInsulation  = 5,
		Weight                 = 6,
		HyperthermalInsulation = 7,
		MAX                    = 8,
		MAX01                  = 9
	};

	/**
	 * Enum ShooterGame.PrimalGameData.EDinoTamedOrder
	 */
	enum class EDinoTamedOrder : uint8_t
	{
		SetAggressionPassive      = 0,
		SetAggressionNeutral      = 1,
		SetAggressionAggressive   = 2,
		SetAggressionAttackTarget = 3,
		ToggleFollowMe            = 4,
		FollowMe                  = 5,
		StopFollowing             = 6,
		CycleFollowDistance       = 7,
		SetAggressionPassiveFlee  = 8,
		LandingToMe               = 9,
		MAX                       = 10,
		MAX01                     = 11
	};

	/**
	 * Enum ShooterGame.PrimalGameData.EXPType
	 */
	enum class EXPType : uint8_t
	{
		XP_GENERIC   = 0,
		XP_KILL      = 1,
		XP_HARVEST   = 2,
		XP_CRAFT     = 3,
		XP_SPECIAL   = 4,
		XP_ALPHAKILL = 5,
		MAX          = 6,
		MAX01        = 7
	};

	/**
	 * Enum ShooterGame.PrimalGameData.ETribeGroupPermission
	 */
	enum class ETribeGroupPermission : uint8_t
	{
		STRUCTUREACTIVATE             = 0,
		INVENTORYACCESS               = 1,
		PET_ORDER                     = 2,
		PET_RIDE                      = 3,
		GENERAL_STRUCTUREDEMOLISH     = 4,
		GENERAL_STRUCTUREATTACHMENT   = 5,
		GENERAL_BUILDSTRUCTUREINRANGE = 6,
		INVITEMEMBER                  = 7,
		PROMOTEMEMBER                 = 8,
		DEMOTEMEMBER                  = 9,
		BANISHMEMBER                  = 10,
		PET_UNCLAIM                   = 11,
		TELEPORT_MEMBERS              = 12,
		TELEPORT_DINOS                = 13,
		MAX                           = 14
	};

	/**
	 * Enum ShooterGame.PrimalGameData.EBoneModifierType
	 */
	enum class EBoneModifierType : uint8_t
	{
		HEAD          = 0,
		NECK          = 1,
		NECKLENGTH    = 2,
		CHEST         = 3,
		SHOULDERS     = 4,
		ARMLENGTH     = 5,
		UPPERARM      = 6,
		LOWERARM      = 7,
		HAND          = 8,
		LEGLENGTH     = 9,
		UPPERLEG      = 10,
		LOWERLEG      = 11,
		FOOT          = 12,
		HIP           = 13,
		TORSO         = 14,
		UPPERFACESIZE = 15,
		LOWERFACESIZE = 16,
		TORSODEPTH    = 17,
		HEADHEIGHT    = 18,
		HEADWIDTH     = 19,
		HEADDEPTH     = 20,
		TORSOHEIGHT   = 21,
		MAX           = 22,
		MAX01         = 23
	};

	/**
	 * Enum ShooterGame.PrimalGameData.EEngramGroup
	 */
	enum class EEngramGroup : uint8_t
	{
		UnusedSpacer      = 0,
		UnusedSpacer01    = 1,
		ARK_PRIME         = 2,
		UnusedSpacer02    = 3,
		ARK_SCORCHEDEARTH = 4,
		UnusedSpacer03    = 5,
		UnusedSpacer04    = 6,
		UnusedSpacer05    = 7,
		ARK_TEK           = 8,
		UnusedSpacer06    = 9,
		UnusedSpacer07    = 10,
		UnusedSpacer08    = 11,
		UnusedSpacer09    = 12,
		UnusedSpacer10    = 13,
		UnusedSpacer11    = 14,
		UnusedSpacer12    = 15,
		ARK_UNLEARNED     = 16,
		UnusedSpacer13    = 17,
		UnusedSpacer14    = 18,
		UnusedSpacer15    = 19,
		UnusedSpacer16    = 20,
		UnusedSpacer17    = 21,
		UnusedSpacer18    = 22,
		UnusedSpacer19    = 23,
		UnusedSpacer20    = 24,
		UnusedSpacer21    = 25,
		UnusedSpacer22    = 26,
		UnusedSpacer23    = 27,
		UnusedSpacer24    = 28,
		UnusedSpacer25    = 29,
		UnusedSpacer26    = 30,
		UnusedSpacer27    = 31,
		ARK_ABERRATION    = 32,
		UnusedSpacer28    = 33,
		UnusedSpacer29    = 34,
		UnusedSpacer30    = 35,
		UnusedSpacer31    = 36,
		UnusedSpacer32    = 37,
		UnusedSpacer33    = 38,
		UnusedSpacer34    = 39,
		UnusedSpacer35    = 40,
		UnusedSpacer36    = 41,
		UnusedSpacer37    = 42,
		UnusedSpacer38    = 43,
		UnusedSpacer39    = 44,
		UnusedSpacer40    = 45,
		UnusedSpacer41    = 46,
		UnusedSpacer42    = 47,
		UnusedSpacer43    = 48,
		UnusedSpacer44    = 49,
		UnusedSpacer45    = 50,
		UnusedSpacer46    = 51,
		UnusedSpacer47    = 52,
		UnusedSpacer48    = 53,
		UnusedSpacer49    = 54,
		UnusedSpacer50    = 55,
		UnusedSpacer51    = 56,
		UnusedSpacer52    = 57,
		UnusedSpacer53    = 58,
		UnusedSpacer54    = 59,
		UnusedSpacer55    = 60,
		UnusedSpacer56    = 61,
		UnusedSpacer57    = 62,
		UnusedSpacer58    = 63,
		ARK_EXTINCTION    = 64,
		UnusedSpacer59    = 65,
		UnusedSpacer60    = 66,
		UnusedSpacer61    = 67,
		UnusedSpacer62    = 68,
		UnusedSpacer63    = 69,
		UnusedSpacer64    = 70,
		UnusedSpacer65    = 71,
		UnusedSpacer66    = 72,
		UnusedSpacer67    = 73,
		UnusedSpacer68    = 74,
		UnusedSpacer69    = 75,
		UnusedSpacer70    = 76,
		UnusedSpacer71    = 77,
		UnusedSpacer72    = 78,
		UnusedSpacer73    = 79,
		UnusedSpacer74    = 80,
		UnusedSpacer75    = 81,
		UnusedSpacer76    = 82,
		UnusedSpacer77    = 83,
		UnusedSpacer78    = 84,
		UnusedSpacer79    = 85,
		UnusedSpacer80    = 86,
		UnusedSpacer81    = 87,
		UnusedSpacer82    = 88,
		UnusedSpacer83    = 89,
		UnusedSpacer84    = 90,
		UnusedSpacer85    = 91,
		UnusedSpacer86    = 92,
		UnusedSpacer87    = 93,
		UnusedSpacer88    = 94,
		UnusedSpacer89    = 95,
		UnusedSpacer90    = 96,
		UnusedSpacer91    = 97,
		UnusedSpacer92    = 98,
		UnusedSpacer93    = 99,
		UnusedSpacer94    = 100,
		UnusedSpacer95    = 101,
		UnusedSpacer96    = 102,
		UnusedSpacer97    = 103,
		UnusedSpacer98    = 104,
		UnusedSpacer99    = 105,
		UnusedSpacer100   = 106,
		UnusedSpacer101   = 107,
		UnusedSpacer102   = 108,
		UnusedSpacer103   = 109,
		UnusedSpacer104   = 110,
		UnusedSpacer105   = 111,
		UnusedSpacer106   = 112,
		UnusedSpacer107   = 113,
		UnusedSpacer108   = 114,
		UnusedSpacer109   = 115,
		UnusedSpacer110   = 116,
		UnusedSpacer111   = 117,
		UnusedSpacer112   = 118,
		UnusedSpacer113   = 119,
		UnusedSpacer114   = 120,
		UnusedSpacer115   = 121,
		UnusedSpacer116   = 122,
		UnusedSpacer117   = 123,
		UnusedSpacer118   = 124,
		UnusedSpacer119   = 125,
		UnusedSpacer120   = 126,
		UnusedSpacer121   = 127,
		ARK_GENESIS       = 128,
		ARK_GEN2          = 129,
		MAX               = 130,
		MAX01             = 131
	};

	/**
	 * Enum ShooterGame.PrimalInventoryComponent.EPrimalItemMessage
	 */
	enum class EPrimalItemMessage : uint8_t
	{
		Broken   = 0,
		Repaired = 1,
		MAX      = 2,
		MAX01    = 3
	};

	/**
	 * Enum ShooterGame.ShooterPlayerController.EPrimalStatsValueTypes
	 */
	enum class EPrimalStatsValueTypes : uint8_t
	{
		TotalShots         = 0,
		Misses             = 1,
		HitsStructure      = 2,
		HitsDinoBody       = 3,
		HitsDinoCritical   = 4,
		HitsPlayerBody     = 5,
		HitsPlayerCritical = 6,
		MAX                = 7,
		MAX01              = 8
	};

	/**
	 * Enum ShooterGame.BiomeZoneVolume.EBiomeZone
	 */
	enum class EBiomeZone : uint8_t
	{
		None                  = 0,
		Beach                 = 1,
		Canyon                = 2,
		River                 = 3,
		Grassland             = 4,
		Swamp                 = 5,
		Jungle                = 6,
		RedwoodForest         = 7,
		Mountain              = 8,
		Snow                  = 9,
		Ocean                 = 10,
		Lava                  = 11,
		Surface               = 12,
		FertileChamber        = 13,
		BioluminescentChamber = 14,
		ElementChamber        = 15,
		Wasteland             = 16,
		MAX                   = 17
	};

	/**
	 * Enum ShooterGame.TerrainGenerator.EVoronoiBlendType
	 */
	enum class EVoronoiBlendType : uint8_t
	{
		Flat          = 0,
		Closest       = 1,
		SecondClosest = 2,
		Cellular      = 3,
		Organic       = 4,
		MAX           = 5
	};

	/**
	 * Enum ShooterGame.DataListEntryButton_PrimalFolder.FolderWidgetType
	 */
	enum class EFolderWidgetType : uint8_t
	{
		FolderWidgetTypeFWT_Back         = 0,
		FolderWidgetTypeFWT_Folder       = 1,
		FolderWidgetTypeFWT_CustomFolder = 2,
		FolderWidgetTypeFWT_MAX          = 3
	};

	/**
	 * Enum ShooterGame.FlockingBehavior.EBoidType
	 */
	enum class EBoidType : uint8_t
	{
		Follower  = 0,
		Leader    = 1,
		FreeAgent = 2,
		MAX       = 3
	};

	/**
	 * Enum ShooterGame.MissionMetaTagInfo.ENativeMissionMetaTag
	 */
	enum class ENativeMissionMetaTag : uint8_t
	{
		INVALID                = 0,
		GENESIS_VR_BOSS_UNLOCK = 1,
		ARCTIC_MISSION         = 2,
		BOG_MISSION            = 3,
		LUNAR_MISSION          = 4,
		OCEAN_MISSION          = 5,
		VOLCANIC_MISSION       = 6,
		NORMAL_DIFFICULTY      = 7,
		ALPHA_DIFFICULTY       = 8,
		BETA_DIFFICULTY        = 9,
		GAMMA_DIFFICULTY       = 10,
		MAX                    = 11,
		MAX01                  = 12
	};

	/**
	 * Enum ShooterGame.MissionDispatcher.EMissionDispatcherTriggerMode
	 */
	enum class EMissionDispatcherTriggerMode : uint8_t
	{
		AutoStartMission    = 0,
		Ignore              = 1,
		ActivateViaMultiUse = 2,
		MAX                 = 3
	};

	/**
	 * Enum ShooterGame.MissionType.EMissionDispatchMode
	 */
	enum class EMissionDispatchMode : uint8_t
	{
		StartAnywhere                  = 0,
		RequireNearbyMissionDispatcher = 1,
		RequireInsideMissionDispatcher = 2,
		UseBPStaticCanStartMission     = 3,
		RequireInsideDispatcherNoCheck = 4,
		MAX                            = 5
	};

	/**
	 * Enum ShooterGame.PrimalBuff_Companion.ECompanionState
	 */
	enum class ECompanionState : uint8_t
	{
		IDLE      = 0,
		FOCUSED   = 1,
		EVENT     = 2,
		MONOLOGUE = 3,
		ASLEEP    = 4,
		CUSTOM    = 5,
		MAX       = 6
	};

	/**
	 * Enum ShooterGame.PrimalDinoCharacter.EBabyCuddleType
	 */
	enum class EBabyCuddleType : uint8_t
	{
		PET   = 0,
		FOOD  = 1,
		WALK  = 2,
		MAX   = 3,
		MAX01 = 4
	};

	/**
	 * Enum ShooterGame.PrimalUI.ControlDirection
	 */
	enum class EControlDirection : uint8_t
	{
		None                 = 0,
		Up                   = 1,
		Down                 = 2,
		Left                 = 3,
		Right                = 4,
		ControlDirection_MAX = 5
	};

	/**
	 * Enum ShooterGame.PrimalUI.HighlightStartingPoint
	 */
	enum class EHighlightStartingPoint : uint8_t
	{
		TopLeft                    = 0,
		Center                     = 1,
		HighlightStartingPoint_MAX = 2
	};

	/**
	 * Enum ShooterGame.PrimalClimbingSettings.EClimbingAnimationType
	 */
	enum class EClimbingAnimationType : uint8_t
	{
		Up                   = 0,
		Down                 = 1,
		Right                = 2,
		Left                 = 3,
		MeleeUp              = 4,
		MeleeRight           = 5,
		MeleeLeft            = 6,
		FinishUp             = 7,
		FinishDown           = 8,
		HangingFwd           = 9,
		HangingMelee         = 10,
		HangingFinishUp      = 11,
		HangingFinishDown    = 12,
		JumpUp               = 13,
		JumpUpRight          = 14,
		JumpUpLeft           = 15,
		SlideDown            = 16,
		AttachUp             = 17,
		AttachDown           = 18,
		AttachHangingUp      = 19,
		AttachHangingDown    = 20,
		FlipLeft             = 21,
		FlipRight            = 22,
		FlipUp               = 23,
		FlipDown             = 24,
		TurnUp               = 25,
		TurnDown             = 26,
		TurnRight            = 27,
		TurnLeft             = 28,
		OpenInventory        = 29,
		OpenInventoryHanging = 30,
		QuakeFall            = 31,
		MAX                  = 32,
		MAX01                = 33
	};

	/**
	 * Enum ShooterGame.PrimalClimbingSettings.EClimbingType
	 */
	enum class EClimbingType : uint8_t
	{
		None       = 0,
		ClimbLook  = 1,
		ClimbInput = 2,
		Slide      = 3,
		MAX        = 4,
		MAX01      = 5
	};

	/**
	 * Enum ShooterGame.PrimalClimbingSettings.EClimbingMode
	 */
	enum class EClimbingMode : uint8_t
	{
		None       = 0,
		Attached   = 1,
		Finalizing = 2,
		MAX        = 3,
		MAX01      = 4
	};

	/**
	 * Enum ShooterGame.PrimalBuff_Grappled.EGrappleState
	 */
	enum class EGrappleState : uint8_t
	{
		GRAPPLE_Idle      = 0,
		GRAPPLE_Pulling   = 1,
		GRAPPLE_Releasing = 2,
		GRAPPLE_Custom    = 3,
		GRAPPLE_Max       = 4
	};

	/**
	 * Enum ShooterGame.PrimalStructureElevatorPlatform.EPrimalStructureElevatorState
	 */
	enum class EPrimalStructureElevatorState : uint8_t
	{
		PSLS_Down = 0,
		PSLS_Up   = 1,
		PSLS_MAX  = 2
	};

	/**
	 * Enum ShooterGame.PrimalWorldBuffData.EWorldBuffDifficultyType
	 */
	enum class EWorldBuffDifficultyType : uint8_t
	{
		GAMMA = 0,
		BETA  = 1,
		ALPHA = 2,
		OTHER = 3,
		MAX   = 4
	};

	/**
	 * Enum ShooterGame.PrimalWorldBuffData.EWorldBuffPropertyLocation
	 */
	enum class EWorldBuffPropertyLocation : uint8_t
	{
		GameMode  = 0,
		GameState = 1,
		MAX       = 2
	};

	/**
	 * Enum ShooterGame.VictoryCore.EEditorMessageLogLevel
	 */
	enum class EEditorMessageLogLevel : uint8_t
	{
		Error   = 0,
		Warning = 1,
		Info    = 2,
		Success = 3,
		MAX     = 4
	};

	/**
	 * Enum ShooterGame.VictoryCore.EServerOctreeGroup
	 */
	enum class EServerOctreeGroup : uint8_t
	{
		STASISCOMPONENTS                  = 0,
		PLAYERPAWNS                       = 1,
		DINOPAWNS                         = 2,
		PAWNS                             = 3,
		STRUCTURES                        = 4,
		TARGETABLEACTORS                  = 5,
		PLAYERS_CONNECTED                 = 6,
		SPATIALNETWORKEDACTORS            = 7,
		SPATIALNETWORKEDACTORS_DORMANT    = 8,
		ALL_SPATIAL                       = 9,
		THERMALSTRUCTURES                 = 10,
		STRUCTURES_CORE                   = 11,
		DINOPAWNS_TAMED                   = 12,
		PLAYERS_AND_TAMED_DINOS           = 13,
		PLAYERS_CONNECTED_AND_TAMED_DINOS = 14,
		DINOFOODCONTAINER                 = 15,
		GRENADES                          = 16,
		TREESAPTAPS                       = 17,
		LARGEUNSTASISRANGE                = 18,
		TRAPS                             = 19,
		MAX                               = 20,
		MAX01                             = 21
	};

	/**
	 * Enum ShooterGame.PrimalProjectileNetGun.ETraceType
	 */
	enum class ETraceType : uint8_t
	{
		TT_LineTrace = 0,
		TT_ArcTrace  = 1,
		TT_Max       = 2
	};

	/**
	 * Enum ShooterGame.StructuresPlus.EGlassTransparencyType
	 */
	enum class EGlassTransparencyType : uint8_t
	{
		TwoWay  = 0,
		OneWayA = 1,
		OneWayB = 2,
		Opaque  = 3,
		MAX     = 4
	};

	/**
	 * Enum ShooterGame.StructuresPlus.ESPMessageType
	 */
	enum class ESPMessageType : uint8_t
	{
		Default = 0,
		Error   = 1,
		Warning = 2,
		Helpful = 3,
		MAX     = 4
	};

	/**
	 * Enum ShooterGame.WaterVolumeWithFlow.EColorChannelTarget
	 */
	enum class EColorChannelTarget : uint8_t
	{
		Red   = 0,
		Green = 1,
		Blue  = 2,
		Alpha = 3,
		All   = 4,
		MAX   = 5
	};

	/**
	 * Enum ShooterGame.ContextMenuItem.UContextMenuItemSwitchMode
	 */
	enum class EUContextMenuItemSwitchMode : uint8_t
	{
		UContextMenuItemSwitchModeNone                           = 0,
		UContextMenuItemSwitchModeRadio                          = 1,
		UContextMenuItemSwitchModeCheckbox                       = 2,
		UContextMenuItemSwitchModeUContextMenuItemSwitchMode_MAX = 3
	};

	/**
	 * Enum ShooterGame.PrimalStructurePlacer.EPrimalStructurePlacerState
	 */
	enum class EPrimalStructurePlacerState : uint8_t
	{
		Default          = 0,
		FadeAway         = 1,
		PlacingStructure = 2,
		MAX              = 3
	};

	/**
	 * Enum ShooterGame.PrimalStructureItemContainer_CropPlot.ESeedCropPhase
	 */
	enum class ESeedCropPhase : uint8_t
	{
		Seedling   = 0,
		Midling    = 1,
		Growthling = 2,
		Fruiting   = 3,
		MAX        = 4,
		MAX01      = 5
	};

	/**
	 * Enum ShooterGame.UI_Inventory.EDropItemIconAction
	 */
	enum class EDropItemIconAction : uint8_t
	{
		DA_NoAction                = 0,
		DA_Equip                   = 1,
		DA_UnEquip                 = 2,
		DA_AddToSlot               = 3,
		DA_RemoveFromSlot          = 4,
		DA_ToRemoteInv             = 5,
		DA_FromRemoteInv           = 6,
		DA_RemoteEquip             = 7,
		DA_MergeItemStack          = 8,
		DA_SplitItemStack          = 9,
		DA_SwapItems               = 10,
		DA_UseWithItem             = 11,
		DA_UnEquipTransferToLocal  = 12,
		DA_RemoveItemSkin          = 13,
		DA_SplitItemStackOne       = 14,
		DA_RemoveWeaponAmmo        = 15,
		DA_FromRemoteInvToSlot     = 16,
		DA_ToRemoteInvFromSlot     = 17,
		DA_EquipLocalFromRemote    = 18,
		DA_EquipRemoteFromLocal    = 19,
		DA_UnequipRemote           = 20,
		DA_UnequipTransferToRemote = 21,
		DA_ToArkInv                = 22,
		DA_FromArkInv              = 23,
		MAX                        = 24,
		MAX01                      = 25
	};

	/**
	 * Enum ShooterGame.UI_MissionList.EDataDisplay
	 */
	enum class EDataDisplay : uint8_t
	{
		MISSION_INFO = 0,
		LEADERBOARDS = 1,
		MAX          = 2
	};

	/**
	 * Enum ShooterGame.UI_MissionList.EListDisplay
	 */
	enum class EListDisplay : uint8_t
	{
		MISSIONS = 0,
		EFFECTS  = 1,
		MAX      = 2
	};

	/**
	 * Enum ShooterGame.UI_Hub.EHubSubMenu
	 */
	enum class EHubSubMenu : uint8_t
	{
		Inventory       = 0,
		Engrams         = 1,
		TribeManager    = 2,
		TameGroups      = 3,
		TamingList      = 4,
		SurvivalProfile = 5,
		MissionList     = 6,
		MAX             = 7,
		MAX01           = 8
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct ShooterGame.PrimalGameData.PrimalCharacterStatusValueDefinition
	 * Size -> 0x0020
	 */
	struct FPrimalCharacterStatusValueDefinition
	{
	public:
		class UTexture2D*                                          StatusValueIcon;                                         // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class FString                                              StatusValueName;                                         // 0x0008(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		bool                                                       bLevelUpSetToMaxValue;                                   // 0x0018(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bDisplayHideCurrentValue;                                // 0x0019(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bDisplayAsPercent;                                       // 0x001A(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_TN8E[0x5];                                   // 0x001B(0x0005) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.PrimalCharacterStatusStateDefinition
	 * Size -> 0x0050
	 */
	struct FPrimalCharacterStatusStateDefinition
	{
	public:
		EPrimalCharacterStatusValue                                StatusValueType;                                         // 0x0000(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_4TR8[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    StatusValueThresholdIndex;                               // 0x0004(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class UTexture2D*                                          StatusStateIcon;                                         // 0x0008(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class FString                                              StatusStateName;                                         // 0x0010(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		class FString                                              StatusStateDescription;                                  // 0x0020(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		struct FColor                                              StatusStateNameColor;                                    // 0x0030(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bUsed;                                                   // 0x0034(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bDisplayHUDMessage;                                      // 0x0035(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_NIZG[0x2];                                   // 0x0036(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              HUDMessage;                                              // 0x0038(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		struct FColor                                              HUDMessageColor;                                         // 0x0048(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		int32_t                                                    BuffType;                                                // 0x004C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.PrimalItemStatDefinition
	 * Size -> 0x0018
	 */
	struct FPrimalItemStatDefinition
	{
	public:
		class UTexture2D*                                          ItemStatIcon;                                            // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class FString                                              ItemStatName;                                            // 0x0008(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.PrimalItemDefinition
	 * Size -> 0x0018
	 */
	struct FPrimalItemDefinition
	{
	public:
		class UTexture2D*                                          ItemTypeIcon;                                            // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class FString                                              ItemTypeName;                                            // 0x0008(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.PrimalEquipmentDefinition
	 * Size -> 0x0018
	 */
	struct FPrimalEquipmentDefinition
	{
	public:
		class UTexture2D*                                          EquipmentTypeIcon;                                       // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class FString                                              EquipmentTypeName;                                       // 0x0008(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.PrimalItemQuality
	 * Size -> 0x0030
	 */
	struct FPrimalItemQuality
	{
	public:
		struct FLinearColor                                        QualityColor;                                            // 0x0000(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class FString                                              QualityName;                                             // 0x0010(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		float                                                      QualityRandomMultiplierThreshold;                        // 0x0020(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      CraftingXPMultiplier;                                    // 0x0024(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      RepairingXPMultiplier;                                   // 0x0028(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      CraftingResourceRequirementsMultiplier;                  // 0x002C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.StatusValueModifierDescription
	 * Size -> 0x0050
	 */
	struct FStatusValueModifierDescription
	{
	public:
		class UTexture2D*                                          ModifierIcon;                                            // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class FString                                              ModifierName;                                            // 0x0008(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		class FString                                              ModifierDescription;                                     // 0x0018(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		struct FColor                                              ModifierColor;                                           // 0x0028(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bDisplayHUDMessage;                                      // 0x002C(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_NIQ2[0x3];                                   // 0x002D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              HUDMessage;                                              // 0x0030(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		struct FColor                                              HUDMessageColor;                                         // 0x0040(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bPreventDrawingBuffDescription;                          // 0x0044(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_QHWV[0x3];                                   // 0x0045(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    BuffType;                                                // 0x0048(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_9KT4[0x4];                                   // 0x004C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.AppIDItem
	 * Size -> 0x0060
	 */
	struct FAppIDItem
	{
	public:
		class FString                                              AchievementID;                                           // 0x0000(0x0010) Edit, ZeroConstructor
		TArray<class FString>                                      AchievementIDs;                                          // 0x0010(0x0010) Edit, ZeroConstructor
		class FName                                                GiveItemIfEmoteNameUnlocked;                             // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		int32_t                                                    AppID;                                                   // 0x0028(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		int32_t                                                    PlayerBadgeGroup;                                        // 0x002C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bForceNewDefaultCosmetic;                                // 0x0030(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_GLPX[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FString>                                      PlayerIDStrings;                                         // 0x0038(0x0010) Edit, ZeroConstructor
		class UClass*                                              ItemClass;                                               // 0x0048(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		TArray<class UClass*>                                      ItemClasses;                                             // 0x0050(0x0010) Edit, ZeroConstructor
	};

	/**
	 * ScriptStruct ShooterGame.RangedValues
	 * Size -> 0x0008
	 */
	struct FRangedValues
	{
	public:
		int32_t                                                    Range;                                                   // 0x0000(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		int32_t                                                    Value;                                                   // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.ColorDefinition
	 * Size -> 0x001C
	 */
	struct FColorDefinition
	{
	public:
		class FName                                                ColorName;                                               // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FLinearColor                                        ColorValue;                                              // 0x0008(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bHasOverridePriority;                                    // 0x0018(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_ZTIS[0x3];                                   // 0x0019(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.BoneModifierRange
	 * Size -> 0x003C
	 */
	struct FBoneModifierRange
	{
	public:
		class FName                                                BoneName;                                                // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector                                             MinScale;                                                // 0x0008(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector                                             MaxScale;                                                // 0x0014(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector                                             MinTranslation;                                          // 0x0020(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		struct FVector                                             MaxTranslation;                                          // 0x002C(0x000C) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       Recursive;                                               // 0x0038(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_M3N7[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.BoneModifierRangeArray
	 * Size -> 0x0020
	 */
	struct FBoneModifierRangeArray
	{
	public:
		bool                                                       bAffectsLegLength : 1;                                   // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor
		bool                                                       bUseExtraMax : 1;                                        // 0x0000(0x0001) BIT_FIELD Edit, NoDestructor
		unsigned char                                              UnknownData_N01C[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MinLegLengthMultiplier;                                  // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		float                                                      MaxLegLengthMultiplier;                                  // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_J4YO[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FBoneModifierRange>                          BoneArray;                                               // 0x0010(0x0010) Edit, ZeroConstructor
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.PlayerCharacterGenderDefinition
	 * Size -> 0x05F0
	 */
	struct FPlayerCharacterGenderDefinition
	{
	public:
		class FString                                              GenderString;                                            // 0x0000(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		class UClass*                                              CharacterBlueprint;                                      // 0x0010(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		TArray<struct FLinearColor>                                ColorSetBody;                                            // 0x0018(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<struct FLinearColor>                                ColorSetHair;                                            // 0x0028(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<struct FLinearColor>                                ColorSetEyes;                                            // 0x0038(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		class UMaterialInterface*                                  CharacterPreviewMaterial;                                // 0x0048(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		TArray<class FString>                                      DefaultCharacterNames;                                   // 0x0050(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<float>                                              DefaultCharacterNameWeights;                             // 0x0060(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		struct FBoneModifierRangeArray                             CharacterBoneModifierRanges[0x16];                       // 0x0070(0x02C0) Edit, DisableEditOnInstance
		struct FBoneModifierRangeArray                             ExtraCharacterBoneModifierMax[0x16];                     // 0x0330(0x02C0) Edit, DisableEditOnInstance
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.LevelExperienceRamp
	 * Size -> 0x0010
	 */
	struct FLevelExperienceRamp
	{
	public:
		TArray<float>                                              ExperiencePointsForLevel;                                // 0x0000(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.NamedTeamDefinition
	 * Size -> 0x0080
	 */
	struct FNamedTeamDefinition
	{
	public:
		class FName                                                TeamName;                                                // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bTargetingTeamExclusionList : 1;                         // 0x0008(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bTargetingTeamInclusionList : 1;                         // 0x0008(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bAllowTargetsOnOwnTeam : 1;                              // 0x0008(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bIsCarnivore : 1;                                        // 0x0008(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bTargetPlayersAndTamedOnly : 1;                          // 0x0008(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bForceTargetPlayersAndTamed : 1;                         // 0x0008(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		bool                                                       bIgnoredByAllTeams : 1;                                  // 0x0008(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		unsigned char                                              UnknownData_UWWI[0x7];                                   // 0x0009(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FName>                                        TeamNameList;                                            // 0x0010(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class FName>                                        TargetingMultiplierTeamNames;                            // 0x0020(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class FName>                                        DontGiveDamageTeamList;                                  // 0x0030(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class FName>                                        DontReceiveDamageTeamList;                               // 0x0040(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class FName>                                        MaximumTargetableDistanceTeams;                          // 0x0050(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<float>                                              MaximumTargetableDistances;                              // 0x0060(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<float>                                              TargetingMultiplierTeamWeights;                          // 0x0070(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.ExplorerNoteAchievement
	 * Size -> 0x0020
	 */
	struct FExplorerNoteAchievement
	{
	public:
		class FString                                              AchievementName;                                         // 0x0000(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<int32_t>                                            ExplorerNoteIndices;                                     // 0x0010(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.ClassRemapping
	 * Size -> 0x0010
	 */
	struct FClassRemapping
	{
	public:
		class UClass*                                              FromClass;                                               // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		class UClass*                                              ToClass;                                                 // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.ActiveEventSupplyCrateWeight
	 * Size -> 0x0028
	 */
	struct FActiveEventSupplyCrateWeight
	{
	public:
		TArray<class UClass*>                                      ReplacementCrateClasses;                                 // 0x0000(0x0010) Edit, ZeroConstructor
		TArray<float>                                              Weights;                                                 // 0x0010(0x0010) Edit, ZeroConstructor
		class FName                                                ActiveEvent;                                             // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.ClassAddition
	 * Size -> 0x0018
	 */
	struct FClassAddition
	{
	public:
		class UClass*                                              ForClass;                                                // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		TArray<class UClass*>                                      ClassAdditions;                                          // 0x0008(0x0010) Edit, ZeroConstructor
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.BuffAddition
	 * Size -> 0x0018
	 */
	struct FBuffAddition
	{
	public:
		class UClass*                                              ForClass;                                                // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		TArray<class UClass*>                                      BuffAdditions;                                           // 0x0008(0x0010) Edit, ZeroConstructor
	};

	/**
	 * ScriptStruct ShooterGame.AvailableMission
	 * Size -> 0x0018
	 */
	struct FAvailableMission
	{
	public:
		class UClass*                                              MissionClass;                                            // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_YUFN[0x10];                                  // 0x0008(0x0010) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.RandValueRange
	 * Size -> 0x000C
	 */
	struct FRandValueRange
	{
	public:
		float                                                      MinVal;                                                  // 0x0000(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      MaxVal;                                                  // 0x0004(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      RandPower;                                               // 0x0008(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.DinoBabySetup
	 * Size -> 0x0038
	 */
	struct FDinoBabySetup
	{
	public:
		class FName                                                DinoNameTag;                                             // 0x0000(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		TArray<struct FBoneModifierRangeArray>                     BabyBoneModifierRanges;                                  // 0x0008(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<float>                                              WildRandomScaleRangeWeights;                             // 0x0018(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<struct FRandValueRange>                             WildRandomScaleRanges;                                   // 0x0028(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.MultiAchievement
	 * Size -> 0x0020
	 */
	struct FMultiAchievement
	{
	public:
		class FString                                              UnlockAchievement;                                       // 0x0000(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class FString>                                      RequiredAchievements;                                    // 0x0010(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.ClassRemappingWeight
	 * Size -> 0x0038
	 */
	struct FClassRemappingWeight
	{
	public:
		class UClass*                                              FromClass;                                               // 0x0000(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		TArray<class UClass*>                                      ToClasses;                                               // 0x0008(0x0010) Edit, ZeroConstructor
		TArray<float>                                              Weights;                                                 // 0x0018(0x0010) Edit, ZeroConstructor
		class FName                                                ActiveEvent;                                             // 0x0028(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
		bool                                                       bExactMatch : 1;                                         // 0x0030(0x0001) BIT_FIELD Edit, NoDestructor
		unsigned char                                              UnknownData_P6F0[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.NPCDifficultyLevelRange
	 * Size -> 0x0030
	 */
	struct FNPCDifficultyLevelRange
	{
	public:
		TArray<float>                                              EnemyLevelsMin;                                          // 0x0000(0x0010) Edit, ZeroConstructor, DisableEditOnTemplate
		TArray<float>                                              EnemyLevelsMax;                                          // 0x0010(0x0010) Edit, ZeroConstructor, DisableEditOnTemplate
		TArray<float>                                              GameDifficulties;                                        // 0x0020(0x0010) Edit, ZeroConstructor, DisableEditOnTemplate
	};

	/**
	 * ScriptStruct ShooterGame.PrimalGameData.NPCSpawnEntry
	 * Size -> 0x0110
	 */
	struct FNPCSpawnEntry
	{
	public:
		class FString                                              AnEntryName;                                             // 0x0000(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class UClass*>                                      NPCsToSpawn;                                             // 0x0010(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<class FString>                                      NPCsToSpawnStrings;                                      // 0x0020(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<struct FClassRemappingWeight>                       NPCRandomSpawnClassWeights;                              // 0x0030(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<struct FVector>                                     NPCsSpawnOffsets;                                        // 0x0040(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<float>                                              NPCsToSpawnPercentageChance;                             // 0x0050(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<float>                                              NPCMinLevelOffset;                                       // 0x0060(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<float>                                              NPCMaxLevelOffset;                                       // 0x0070(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<float>                                              NPCMinLevelMultiplier;                                   // 0x0080(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		TArray<float>                                              NPCMaxLevelMultiplier;                                   // 0x0090(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		bool                                                       bAddLevelOffsetBeforeMultiplier : 1;                     // 0x00A0(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor
		unsigned char                                              UnknownData_LEJ2[0x7];                                   // 0x00A1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<unsigned char>                                      NPCOverrideLevel;                                        // 0x00A8(0x0010) Edit, ZeroConstructor, DisableEditOnInstance
		struct FVector                                             ExtentCheck;                                             // 0x00B8(0x000C) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FVector                                             GroupSpawnOffset;                                        // 0x00C4(0x000C) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      EntryWeight;                                             // 0x00D0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      ManualSpawnPointSpreadRadius;                            // 0x00D4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      WaterOnlySpawnMinimumWaterHeight;                        // 0x00D8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      MaximumWaterHeight;                                      // 0x00DC(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		class UClass*                                              ColorSets;                                               // 0x00E0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		TArray<struct FNPCDifficultyLevelRange>                    NPCDifficultyLevelRanges;                                // 0x00E8(0x0010) Edit, ZeroConstructor
		float                                                      LevelDifficultyTestOverride;                             // 0x00F8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor
