#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ShooterGame.PrimalDinoAIController.WantsAttackPriority
	 */
	struct APrimalDinoAIController_WantsAttackPriority_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.UpdateAggro
	 */
	struct APrimalDinoAIController_UpdateAggro_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.StopBrainComponent
	 */
	struct APrimalDinoAIController_StopBrainComponent_Params
	{
	public:
		class FString                                              Reason;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.StaticGetRandomWanderDestination
	 */
	struct APrimalDinoAIController_StaticGetRandomWanderDestination_Params
	{
	public:
		class APrimalDinoCharacter*                                TargetCharacter;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class APrimalDinoAIController*                             TargetAIController;                                      // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             locOverride;                                             // 0x0010(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      randomOffsetMultiplier;                                  // 0x001C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bUseRandomNegativeXDir;                                  // 0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bOrientRandOffsetByRotation;                             // 0x0021(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_KDMS[0x2];                                   // 0x0022(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FRotator                                            orientRandOffsetByRotation;                              // 0x0024(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      GroundCheckSpreadOverride;                               // 0x0030(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             ReturnValue;                                             // 0x0034(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.ShouldForceRunWhenAttacking
	 */
	struct APrimalDinoAIController_ShouldForceRunWhenAttacking_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.SetTarget
	 */
	struct APrimalDinoAIController_SetTarget_Params
	{
	public:
		class AActor*                                              InTarget;                                                // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bDontAddAggro;                                           // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bOverlapFoundTarget;                                     // 0x0009(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.SetHasAttackPriority
	 */
	struct APrimalDinoAIController_SetHasAttackPriority_Params
	{
	public:
		bool                                                       Value;                                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.SetAttackRotationRate
	 */
	struct APrimalDinoAIController_SetAttackRotationRate_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.SetAttackGroundSpeed
	 */
	struct APrimalDinoAIController_SetAttackGroundSpeed_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.ResumeBrainComponent
	 */
	struct APrimalDinoAIController_ResumeBrainComponent_Params
	{
	public:
		class FString                                              Reason;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.RestartBrainComponent
	 */
	struct APrimalDinoAIController_RestartBrainComponent_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.ResetRotationUseAcceleration
	 */
	struct APrimalDinoAIController_ResetRotationUseAcceleration_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.ResetRotationRate
	 */
	struct APrimalDinoAIController_ResetRotationRate_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.ResetGroundSpeed
	 */
	struct APrimalDinoAIController_ResetGroundSpeed_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.ResetAccelerationFollowsRotation
	 */
	struct APrimalDinoAIController_ResetAccelerationFollowsRotation_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.RecoverMovement
	 */
	struct APrimalDinoAIController_RecoverMovement_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.RebootBrainComponent
	 */
	struct APrimalDinoAIController_RebootBrainComponent_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.PlayStartledAnim
	 */
	struct APrimalDinoAIController_PlayStartledAnim_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.PauseBrainComponent
	 */
	struct APrimalDinoAIController_PauseBrainComponent_Params
	{
	public:
		class FString                                              Reason;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.OrderedToLand
	 */
	struct APrimalDinoAIController_OrderedToLand_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.OnLosingTargetEvent
	 */
	struct APrimalDinoAIController_OnLosingTargetEvent_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.IsWithinAttackRangeAndCalculateBestAttack
	 */
	struct APrimalDinoAIController_IsWithinAttackRangeAndCalculateBestAttack_Params
	{
	public:
		class AActor*                                              Other;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bAttackChanged;                                          // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0009(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.IsWithinAttackRange
	 */
	struct APrimalDinoAIController_IsWithinAttackRange_Params
	{
	public:
		class AActor*                                              Other;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bForceUseLastAttackIndex;                                // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0009(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.IsLogicPaused
	 */
	struct APrimalDinoAIController_IsLogicPaused_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.IsForceTargetDinoRider
	 */
	struct APrimalDinoAIController_IsForceTargetDinoRider_Params
	{
	public:
		class AShooterCharacter*                                   playerTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetWanderAroundActorDestination
	 */
	struct APrimalDinoAIController_GetWanderAroundActorDestination_Params
	{
	public:
		class APrimalDinoCharacter*                                DinoCharacter;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             originalDestination;                                     // 0x0008(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             ReturnValue;                                             // 0x0014(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetTarget
	 */
	struct APrimalDinoAIController_GetTarget_Params
	{
	public:
		class AActor*                                              ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetRandomWanderDestination
	 */
	struct APrimalDinoAIController_GetRandomWanderDestination_Params
	{
	public:
		struct FVector                                             locOverride;                                             // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      randomOffsetMultiplier;                                  // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bUseRandomNegativeXDir;                                  // 0x0010(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bOrientRandOffsetByRotation;                             // 0x0011(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_Y4EI[0x2];                                   // 0x0012(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FRotator                                            orientRandOffsetByRotation;                              // 0x0014(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             ReturnValue;                                             // 0x0020(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetMinAttackRange
	 */
	struct APrimalDinoAIController_GetMinAttackRange_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetLandingLocation
	 */
	struct APrimalDinoAIController_GetLandingLocation_Params
	{
	public:
		struct FVector                                             ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetHasAttackPriority
	 */
	struct APrimalDinoAIController_GetHasAttackPriority_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetCurrentAttackIndex
	 */
	struct APrimalDinoAIController_GetCurrentAttackIndex_Params
	{
	public:
		unsigned char                                              ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetControllerPawn
	 */
	struct APrimalDinoAIController_GetControllerPawn_Params
	{
	public:
		class APawn*                                               ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetControlledDino
	 */
	struct APrimalDinoAIController_GetControlledDino_Params
	{
	public:
		class APrimalDinoCharacter*                                ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetClosestTree
	 */
	struct APrimalDinoAIController_GetClosestTree_Params
	{
	public:
		struct FOverlapResult                                      OutHit;                                                  // 0x0000(0x0018)  (Parm, OutParm)
		class UStaticMeshComponent*                                ReturnValue;                                             // 0x0018(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetAttackRotationRate
	 */
	struct APrimalDinoAIController_GetAttackRotationRate_Params
	{
	public:
		struct FRotator                                            ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetAttackRotationRangeDegrees
	 */
	struct APrimalDinoAIController_GetAttackRotationRangeDegrees_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetAttackRotationGroundSpeedMultiplier
	 */
	struct APrimalDinoAIController_GetAttackRotationGroundSpeedMultiplier_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetAttackRange
	 */
	struct APrimalDinoAIController_GetAttackRange_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetAttackInterval
	 */
	struct APrimalDinoAIController_GetAttackInterval_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetAggroNotifyNeighborsRange
	 */
	struct APrimalDinoAIController_GetAggroNotifyNeighborsRange_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetAggroEntry
	 */
	struct APrimalDinoAIController_GetAggroEntry_Params
	{
	public:
		int32_t                                                    index;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_OJUM[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              OutAttacker;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      OutAggroFactor;                                          // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_FUH4[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		double                                                     OutLastAggroHitTime;                                     // 0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0020(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetAggroEntriesCount
	 */
	struct APrimalDinoAIController_GetAggroEntriesCount_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetAggroEntriesAttackerAtIndex
	 */
	struct APrimalDinoAIController_GetAggroEntriesAttackerAtIndex_Params
	{
	public:
		int32_t                                                    index;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_J924[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.GetAggroDesirability
	 */
	struct APrimalDinoAIController_GetAggroDesirability_Params
	{
	public:
		class AActor*                                              InTarget;                                                // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.FindTarget
	 */
	struct APrimalDinoAIController_FindTarget_Params
	{
	public:
		bool                                                       bDontSet;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_PSJF[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.FindNewTarget
	 */
	struct APrimalDinoAIController_FindNewTarget_Params
	{
	public:
		bool                                                       bDontSet;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_9FEO[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.ClearAggroEntries
	 */
	struct APrimalDinoAIController_ClearAggroEntries_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.ChangedAITarget
	 */
	struct APrimalDinoAIController_ChangedAITarget_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.CanLand
	 */
	struct APrimalDinoAIController_CanLand_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.CalculateAndSetWonderingAIStateEvent
	 */
	struct APrimalDinoAIController_CalculateAndSetWonderingAIStateEvent_Params
	{
	public:
		bool                                                       StateChanged;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.CalculateAndSetWonderingAIState
	 */
	struct APrimalDinoAIController_CalculateAndSetWonderingAIState_Params
	{
	public:
		bool                                                       StateChanged;                                            // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.BPUpdateBestTarget
	 */
	struct APrimalDinoAIController_BPUpdateBestTarget_Params
	{
	public:
		class AActor*                                              bestTarget;                                              // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       dontSetIn;                                               // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       dontSetOut;                                              // 0x0009(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_MNRB[0x6];                                   // 0x000A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AActor*                                              ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.BPShouldNotifyNeighbor
	 */
	struct APrimalDinoAIController_BPShouldNotifyNeighbor_Params
	{
	public:
		class APrimalDinoCharacter*                                neighbor;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.BPShouldNotifyAnyNeighbor
	 */
	struct APrimalDinoAIController_BPShouldNotifyAnyNeighbor_Params
	{
	public:
		class APrimalDinoCharacter*                                neighbor;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.BPSetupFindTarget
	 */
	struct APrimalDinoAIController_BPSetupFindTarget_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.BPOverrideLandingLocation
	 */
	struct APrimalDinoAIController_BPOverrideLandingLocation_Params
	{
	public:
		float                                                      outRadius;                                               // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             ReturnValue;                                             // 0x0004(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.BPOverrideIgnoredByWildDino
	 */
	struct APrimalDinoAIController_BPOverrideIgnoredByWildDino_Params
	{
	public:
		class AActor*                                              wildDinoToIgnore;                                        // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.BPOnFleeEvent
	 */
	struct APrimalDinoAIController_BPOnFleeEvent_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.BPNotifyTargetSet
	 */
	struct APrimalDinoAIController_BPNotifyTargetSet_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.BPGetTargetingDesire
	 */
	struct APrimalDinoAIController_BPGetTargetingDesire_Params
	{
	public:
		class AActor*                                              forTarget;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      ForTargetingDesireValue;                                 // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      ReturnValue;                                             // 0x000C(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.BPForceTargetDinoRider
	 */
	struct APrimalDinoAIController_BPForceTargetDinoRider_Params
	{
	public:
		class AShooterCharacter*                                   playerTarget;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.BP_TamedOverrideHorizontalLandingRange
	 */
	struct APrimalDinoAIController_BP_TamedOverrideHorizontalLandingRange_Params
	{
	public:
		struct FVector2D                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.AvoidOutOfWater
	 */
	struct APrimalDinoAIController_AvoidOutOfWater_Params
	{	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.AvoidGenericToPoint
	 */
	struct APrimalDinoAIController_AvoidGenericToPoint_Params
	{
	public:
		struct FVector                                             TargetDestination;                                       // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalDinoAIController.AddToAggro
	 */
	struct APrimalDinoAIController_AddToAggro_Params
	{
	public:
		class AActor*                                              Attacker;                                                // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      DamagePercent;                                           // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bNotifyNeighbors;                                        // 0x000C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       SetValue;                                                // 0x000D(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bIsFromDamage;                                           // 0x000E(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       skipTeamCheck;                                           // 0x000F(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.AIAttackCoordinator.UpdateAttackGroup
	 */
	struct AAIAttackCoordinator_UpdateAttackGroup_Params
	{
	public:
		TArray<class APrimalDinoAIController*>                     AttackGroup;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReferenceParm)
	};

	/**
	 * Function ShooterGame.AIAttackCoordinator.RemoveAttacker
	 */
	struct AAIAttackCoordinator_RemoveAttacker_Params
	{
	public:
		class APrimalDinoAIController*                             Controller;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.AIAttackCoordinator.GetNumAttackersWithPriorityForTarget
	 */
	struct AAIAttackCoordinator_GetNumAttackersWithPriorityForTarget_Params
	{
	public:
		class AActor*                                              Target;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.AIAttackCoordinator.GetNumAttackersForTarget
	 */
	struct AAIAttackCoordinator_GetNumAttackersForTarget_Params
	{
	public:
		class AActor*                                              Target;                                                  // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.AIAttackCoordinator.ClearAllAttackers
	 */
	struct AAIAttackCoordinator_ClearAllAttackers_Params
	{	};

	/**
	 * Function ShooterGame.AIAttackCoordinator.CalculateAttackerPriorityWeight
	 */
	struct AAIAttackCoordinator_CalculateAttackerPriorityWeight_Params
	{
	public:
		class APrimalDinoAIController*                             Attacker;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.AIAttackCoordinator.AddAttackerCharacter
	 */
	struct AAIAttackCoordinator_AddAttackerCharacter_Params
	{
	public:
		class APrimalDinoCharacter*                                Character;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.AIAttackCoordinator.AddAttacker
	 */
	struct AAIAttackCoordinator_AddAttacker_Params
	{
	public:
		class APrimalDinoAIController*                             Controller;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGlobals.OnConfirmationDialogClosed
	 */
	struct UPrimalGlobals_OnConfirmationDialogClosed_Params
	{
	public:
		bool                                                       bAccept;                                                 // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGlobals.GetDayCycleManager
	 */
	struct UPrimalGlobals_GetDayCycleManager_Params
	{
	public:
		class UWorld*                                              World;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class ADayCycleManager*                                    ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGlobals.FinishedLoadingGameMedia
	 */
	struct UPrimalGlobals_FinishedLoadingGameMedia_Params
	{	};

	/**
	 * Function ShooterGame.PrimalGameData.TickedWorld
	 */
	struct UPrimalGameData_TickedWorld_Params
	{
	public:
		class UWorld*                                              TheWorld;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      DeltaTime;                                               // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.LocalIsPerMapExplorerNoteUnlocked
	 */
	struct UPrimalGameData_LocalIsPerMapExplorerNoteUnlocked_Params
	{
	public:
		int32_t                                                    ExplorerNoteIndex;                                       // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.LocalIsGlobalExplorerNoteUnlocked
	 */
	struct UPrimalGameData_LocalIsGlobalExplorerNoteUnlocked_Params
	{
	public:
		int32_t                                                    ExplorerNoteIndex;                                       // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.LoadedWorld
	 */
	struct UPrimalGameData_LoadedWorld_Params
	{
	public:
		class UWorld*                                              TheWorld;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.GetXPMax
	 */
	struct UPrimalGameData_GetXPMax_Params
	{
	public:
		ELevelExperienceRampType                                   levelType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_ZD43[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.GetRedirectedClassFromRedirector
	 */
	struct UPrimalGameData_GetRedirectedClassFromRedirector_Params
	{
	public:
		struct FInvalidReferenceRedirector                         Redirector;                                              // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReferenceParm)
		class UClass*                                              ReturnValue;                                             // 0x0038(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.GetRedirectedClass
	 */
	struct UPrimalGameData_GetRedirectedClass_Params
	{
	public:
		class FString                                              Key;                                                     // 0x0000(0x0010)  (Parm, ZeroConstructor)
		class UObject*                                             WorldContextObject;                                      // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class UClass*                                              ReturnValue;                                             // 0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.GetLevelXP
	 */
	struct UPrimalGameData_GetLevelXP_Params
	{
	public:
		ELevelExperienceRampType                                   levelType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_W9ZU[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    forLevel;                                                // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      ReturnValue;                                             // 0x0008(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.GetLevelMax
	 */
	struct UPrimalGameData_GetLevelMax_Params
	{
	public:
		ELevelExperienceRampType                                   levelType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_OOTH[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.GetLevelExperienceRamp
	 */
	struct UPrimalGameData_GetLevelExperienceRamp_Params
	{
	public:
		ELevelExperienceRampType                                   levelType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_72NB[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FLevelExperienceRamp                                ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function ShooterGame.PrimalGameData.GetGenericCombatMusic
	 */
	struct UPrimalGameData_GetGenericCombatMusic_Params
	{
	public:
		class APrimalCharacter*                                    forCharacter;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class APrimalCharacter*                                    forEnemy;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class USoundBase*                                          ReturnValue;                                             // 0x0010(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.GetExplorerNoteDescription
	 */
	struct UPrimalGameData_GetExplorerNoteDescription_Params
	{
	public:
		int32_t                                                    ExplorerNoteIndex;                                       // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_4PGU[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FString                                              ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm)
	};

	/**
	 * Function ShooterGame.PrimalGameData.GetDinoEntry
	 */
	struct UPrimalGameData_GetDinoEntry_Params
	{
	public:
		class UClass*                                              DinoClass;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class UClass*                                              ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.GetColorForDefinition
	 */
	struct UPrimalGameData_GetColorForDefinition_Params
	{
	public:
		int32_t                                                    DefinitionIndex;                                         // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FLinearColor                                        ReturnValue;                                             // 0x0004(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.GetBuffsForBitmask
	 */
	struct UPrimalGameData_GetBuffsForBitmask_Params
	{
	public:
		int32_t                                                    mask;                                                    // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_2EM1[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<class UClass*>                                      ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm)
	};

	/**
	 * Function ShooterGame.PrimalGameData.GetBitmaskForBuffs
	 */
	struct UPrimalGameData_GetBitmaskForBuffs_Params
	{
	public:
		TArray<class APrimalBuff*>                                 ActiveBuffs;                                             // 0x0000(0x0010)  (Parm, ZeroConstructor)
		int32_t                                                    ReturnValue;                                             // 0x0010(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.BPMergeModGameData
	 */
	struct UPrimalGameData_BPMergeModGameData_Params
	{
	public:
		class UPrimalGameData*                                     AnotherGameData;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.BPInitializeGameData
	 */
	struct UPrimalGameData_BPInitializeGameData_Params
	{	};

	/**
	 * Function ShooterGame.PrimalGameData.BPGetItemQualityIndex
	 */
	struct UPrimalGameData_BPGetItemQualityIndex_Params
	{
	public:
		float                                                      ItemRating;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalGameData.BPGetGameData
	 */
	struct UPrimalGameData_BPGetGameData_Params
	{
	public:
		class UPrimalGameData*                                     ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.UseItemOntoItem
	 */
	struct UPrimalItem_UseItemOntoItem_Params
	{
	public:
		class UPrimalItem*                                         DestinationItem;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    AdditionalData;                                          // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.Use
	 */
	struct UPrimalItem_Use_Params
	{
	public:
		bool                                                       bOverridePlayerInput;                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.UpdatedItem
	 */
	struct UPrimalItem_UpdatedItem_Params
	{
	public:
		bool                                                       ResetUploadTime;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.UnequipWeapon
	 */
	struct UPrimalItem_UnequipWeapon_Params
	{
	public:
		bool                                                       bDelayedUnequip;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.StaticGetItemNameAndIcon
	 */
	struct UPrimalItem_StaticGetItemNameAndIcon_Params
	{
	public:
		class UClass*                                              ItemType;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class FString                                              OutItemName;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor)
		class UTexture2D*                                          OutItemIcon;                                             // 0x0018(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bShortName;                                              // 0x0020(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_FH12[0x7];                                   // 0x0021(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AShooterPlayerController*                            ForPC;                                                   // 0x0028(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ReturnValue;                                             // 0x0030(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.StaticGetDinoColorSetIndexForItemColorID
	 */
	struct UPrimalItem_StaticGetDinoColorSetIndexForItemColorID_Params
	{
	public:
		int32_t                                                    ID;                                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.StaticGetColorForItemColorID
	 */
	struct UPrimalItem_StaticGetColorForItemColorID_Params
	{
	public:
		int32_t                                                    ID;                                                      // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FLinearColor                                        ReturnValue;                                             // 0x0004(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.SlottedTick
	 */
	struct UPrimalItem_SlottedTick_Params
	{
	public:
		float                                                      DeltaSeconds;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.SkinEquippedBlueprintTick
	 */
	struct UPrimalItem_SkinEquippedBlueprintTick_Params
	{
	public:
		class UPrimalItem*                                         OwnerItem;                                               // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      DeltaSeconds;                                            // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.SetUnreplicatedEggData
	 */
	struct UPrimalItem_SetUnreplicatedEggData_Params
	{
	public:
		struct FUnreplicatedEggData                                EggData;                                                 // 0x0000(0x0058)  (ConstParm, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function ShooterGame.PrimalItem.SetQuantity
	 */
	struct UPrimalItem_SetQuantity_Params
	{
	public:
		int32_t                                                    NewQuantity;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       ShowHUDNotification;                                     // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.SetItemStatValues
	 */
	struct UPrimalItem_SetItemStatValues_Params
	{
	public:
		int32_t                                                    idx;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		int32_t                                                    val;                                                     // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.SetItemStatInfo
	 */
	struct UPrimalItem_SetItemStatInfo_Params
	{
	public:
		int32_t                                                    idx;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FItemStatInfo                                       val;                                                     // 0x0004(0x0024)  (ConstParm, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function ShooterGame.PrimalItem.SetItemColors
	 */
	struct UPrimalItem_SetItemColors_Params
	{
	public:
		TArray<int32_t>                                            ColorIDs;                                                // 0x0000(0x0010)  (Parm, ZeroConstructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.SetCustomItemData
	 */
	struct UPrimalItem_SetCustomItemData_Params
	{
	public:
		struct FCustomItemData                                     InData;                                                  // 0x0000(0x0078)  (ConstParm, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function ShooterGame.PrimalItem.ServerUpdatedWeaponClipAmmo
	 */
	struct UPrimalItem_ServerUpdatedWeaponClipAmmo_Params
	{	};

	/**
	 * Function ShooterGame.PrimalItem.ServerSendItemExecCommandToPlayer
	 */
	struct UPrimalItem_ServerSendItemExecCommandToPlayer_Params
	{
	public:
		class AShooterPlayerController*                            ToPC;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		class FName                                                CommandName;                                             // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FBPNetExecParams                                    ExecParams;                                              // 0x0010(0x0040)  (ConstParm, Parm, OutParm, ReferenceParm)
		bool                                                       bIsReliable;                                             // 0x0050(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bForceSendToLocalPlayer;                                 // 0x0051(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bIgnoreRelevancy;                                        // 0x0052(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.ServerSendItemExecCommandToEveryone
	 */
	struct UPrimalItem_ServerSendItemExecCommandToEveryone_Params
	{
	public:
		class FName                                                CommandName;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FBPNetExecParams                                    ExecParams;                                              // 0x0008(0x0040)  (ConstParm, Parm, OutParm, ReferenceParm)
		bool                                                       bIsReliable;                                             // 0x0048(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bForceSendToLocalPlayer;                                 // 0x0049(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bIgnoreRelevancy;                                        // 0x004A(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.ServerRemoveWeaponAccessoryOnly
	 */
	struct UPrimalItem_ServerRemoveWeaponAccessoryOnly_Params
	{	};

	/**
	 * Function ShooterGame.PrimalItem.ServerRemoveItemSkinOnly
	 */
	struct UPrimalItem_ServerRemoveItemSkinOnly_Params
	{	};

	/**
	 * Function ShooterGame.PrimalItem.ServerRemoveItemSkin
	 */
	struct UPrimalItem_ServerRemoveItemSkin_Params
	{	};

	/**
	 * Function ShooterGame.PrimalItem.SelectedCustomContextMenuItem
	 */
	struct UPrimalItem_SelectedCustomContextMenuItem_Params
	{
	public:
		class FName                                                ContextItem;                                             // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
		class AShooterPlayerController*                            ForPC;                                                   // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.RepairItem
	 */
	struct UPrimalItem_RepairItem_Params
	{
	public:
		bool                                                       bIgnoreInventoryRequirement;                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		unsigned char                                              UnknownData_C65Y[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      UseNextRepairPercentage;                                 // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      RepairSpeedMultiplier;                                   // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.RemoveWeaponAccessory
	 */
	struct UPrimalItem_RemoveWeaponAccessory_Params
	{	};

	/**
	 * Function ShooterGame.PrimalItem.RemoveFromSlot
	 */
	struct UPrimalItem_RemoveFromSlot_Params
	{
	public:
		bool                                                       bForce;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.RemovedSkinFromItem
	 */
	struct UPrimalItem_RemovedSkinFromItem_Params
	{
	public:
		class UPrimalItem*                                         FromOwnerItem;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bIsFirstTime;                                            // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.RemoveCustomItemData
	 */
	struct UPrimalItem_RemoveCustomItemData_Params
	{
	public:
		class FName                                                CustomDataName;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ShooterGame.PrimalItem.RemoveClipAmmo
	 */
	struct UPrimalItem_RemoveClipAmmo_Params
	{
	public:
