#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function SK_gliderPack_wings_AnimBlueprint.SK_gliderPack_wings_AnimBlueprint_C.UpdateWingOffsets
	 */
	struct USK_gliderPack_wings_AnimBlueprint_C_UpdateWingOffsets_Params
	{
	public:
		class AShooterCharacter*                                   ShooterCharacter;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SK_gliderPack_wings_AnimBlueprint.SK_gliderPack_wings_AnimBlueprint_C.UpdateVelocity
	 */
	struct USK_gliderPack_wings_AnimBlueprint_C_UpdateVelocity_Params
	{
	public:
		class AShooterCharacter*                                   ShooterCharacter;                                        // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      DeltaTime;                                               // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SK_gliderPack_wings_AnimBlueprint.SK_gliderPack_wings_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SK_gliderPack_wings_AnimBlueprint_AnimGraphNode_TransitionResult_39F5091F4B1ACC2793D1439328F94B59
	 */
	struct USK_gliderPack_wings_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_SK_gliderPack_wings_AnimBlueprint_AnimGraphNode_TransitionResult_39F5091F4B1ACC2793D1439328F94B59_Params
	{	};

	/**
	 * Function SK_gliderPack_wings_AnimBlueprint.SK_gliderPack_wings_AnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_SK_gliderPack_wings_AnimBlueprint_AnimGraphNode_TransitionResult_45BCAA304FAFD876B51609B0919C39DA
	 */
	struct USK_gliderPack_wings_AnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_SK_gliderPack_wings_AnimBlueprint_AnimGraphNode_TransitionResult_45BCAA304FAFD876B51609B0919C39DA_Params
	{	};

	/**
	 * Function SK_gliderPack_wings_AnimBlueprint.SK_gliderPack_wings_AnimBlueprint_C.BlueprintUpdateAnimation
	 */
	struct USK_gliderPack_wings_AnimBlueprint_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function SK_gliderPack_wings_AnimBlueprint.SK_gliderPack_wings_AnimBlueprint_C.ExecuteUbergraph_SK_gliderPack_wings_AnimBlueprint
	 */
	struct USK_gliderPack_wings_AnimBlueprint_C_ExecuteUbergraph_SK_gliderPack_wings_AnimBlueprint_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
