#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Task_SimpleMove.Task_SimpleMove_C.ReceiveExecute
	 */
	struct UTask_SimpleMove_C_ReceiveExecute_Params
	{
	public:
		class AActor*                                              OwnerActor;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Task_SimpleMove.Task_SimpleMove_C.ReceiveTick
	 */
	struct UTask_SimpleMove_C_ReceiveTick_Params
	{
	public:
		class AActor*                                              OwnerActor;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		float                                                      DeltaSeconds;                                            // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Task_SimpleMove.Task_SimpleMove_C.ExecuteUbergraph_Task_SimpleMove
	 */
	struct UTask_SimpleMove_C_ExecuteUbergraph_Task_SimpleMove_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Task_SimpleMove.Task_SimpleMove_C.MoveCompleted__DelegateSignature
	 */
	struct UTask_SimpleMove_C_MoveCompleted__DelegateSignature_Params
	{
	public:
		EPathFollowingRequestResult                                NewParam;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
