#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass TekBow_FPV_AnimBlueprint.TekBow_FPV_AnimBlueprint_C
	 * Size -> 0x110B (FullSize[0x144B] - InheritedSize[0x0340])
	 */
	class UTekBow_FPV_AnimBlueprint_C : public UAnimInstance
	{
	public:
		struct FAnimNode_Root                                      AnimGraphNode_Root_B7951BBA4970F8188767149317400A70;     // 0x0340(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_6DD0646C4B38D6C0B92AA58806D0DE73;     // 0x0388(0x0058)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_6D714E724BC24F2DD36134AB74A073E5; // 0x03E0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2ECB3AA14DD44E84A61F72B7CF427E20; // 0x0418(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_C9DAF79444022A7A4AA8319FEF67CE4D; // 0x0450(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_0C7B5BBA4DF56F77D1B1E89446C1C6E9; // 0x0488(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_11F426E048C03DDD0554DDBE906BCAE4; // 0x04C0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2CB8CC484788817EB5788D873EC96C96; // 0x04F8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_E226781541D9FEFDD396ADABF90C3A68; // 0x0530(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_B235FA1C488D5B5F7EB2659B6195386C; // 0x0568(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9AB00C284AD1674576735A8C75A60059; // 0x05A0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_395B848C47B26685EA03039F3EF9C35C; // 0x05D8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_712697594C356A481C39C8900CB75F0A; // 0x0610(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_8B510F8A42706B40F4F68D872D7AFAD9; // 0x0648(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1641A8BB4F3CA4DC53DE0FBD85B3C450; // 0x0680(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_213EDFCB4ACB0C436AA0738ACA32DC88; // 0x06B8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_97C0B5AA4D0DA11E1A0276A502623065; // 0x06F0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_5B518CD6456E89F8624E02A41F182390; // 0x0728(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_DA98135143720BBBB8F2F7A55F8BF9E1; // 0x0760(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1E81D8AC4EC30FE9F8997F84C04ED8DF; // 0x0798(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_E89767CE46872BC7B8DE11B5A6EB945A; // 0x07D0(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_EA33354A4C59FDB1D464B2AA016159DE; // 0x0808(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_0FA442174B00C16C815EDB97513A27B8; // 0x0858(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_616024084E8D976862E1469327254EE1; // 0x08A0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_143CB6B84498C12F5608508AFCDF372D; // 0x08F0(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_FAF658FE448CD0DD8A1383882BEDE577; // 0x0938(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_5C80B2D54790523321C3CB94269C187E; // 0x0988(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_E020512C4C49A1BF39A082BD8B5C79ED; // 0x09D0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_ECFCDE9941911B99FB979D81B72A0FC6; // 0x0A20(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_E438040E4E95FE5B7DBA35BB4E1A8E3E; // 0x0A68(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_173BC6AF4CF6AB1686C658AD2B2B089A; // 0x0AB8(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9B3D5A1243B47524AC3F0484C89BE978; // 0x0B00(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_C0988A5349E6E73F9536F0ADD1508A8B; // 0x0B50(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_B3CD40454867A20D7AD8F38785913E01; // 0x0B98(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_9044B1A247100C0AE150B68925F704BA; // 0x0BE8(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_BD5F7948463EF8EBFC8810B16C16BC01; // 0x0C30(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_D01602984E0C85C93DE5E9A17DE09B57; // 0x0C80(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_D174470249C0E4700ED5349102B81E6A; // 0x0CC8(0x0080)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_17EE06324DBF1AAF409C2BA3914D0DDC; // 0x0D48(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_802D53FA4AA27586E7A766A6989BADB1; // 0x0D80(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_BF9CEDBD49D168EC8C0E33AC99312A90; // 0x0DB8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2BC08052471B8A9557328285F64A280F; // 0x0DF0(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_3EE4A11B421D34FCFF13A5AFEBD524F7; // 0x0E28(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_E27E0E4840E0F4F90E71838B68DEA095; // 0x0E78(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_F4344645405F3FC107404B9A6654D28C; // 0x0EC0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_B115ABDC4372318A58A5DAA083BEA6A8; // 0x0F10(0x0048)
		struct FAnimNode_RefPose                                   AnimGraphNode_IdentityPose_242BDD5D487B84B620B032B75B8C8732; // 0x0F58(0x0038)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_8B5881EB44DDA06067FAE289F5D9CBFA; // 0x0F90(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_5A585CF74453007B3BC493AA44050ADE; // 0x0FD8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_F9C2C6A44B73DDD3CE16D7A56E178AA2; // 0x1028(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_EAA3077C4CFB1989046623AD5C445B14; // 0x1070(0x0080)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_8246DCDA43092AA6FAAB1CA609272F67; // 0x10F0(0x0060)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_B1DEA28E41636F1FFF2C3897A62F8DC4; // 0x1150(0x0070)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_D1781E004DF0E0E8140554B35B4DFC0B; // 0x11C0(0x0048)
		unsigned char                                              UnknownData_7JUJ[0x8];                                   // 0x1208(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_6B6F5D0E4044A1A4C475B29ED6D27138; // 0x1210(0x00D0)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_18D27F9D4402AE7CF06F758454DD2AF5; // 0x12E0(0x0048)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_FBF3DAEF4591B32DA1D5C6B058421378; // 0x1328(0x0048)
		bool                                                       IsRunning;                                               // 0x1370(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsPullingString;                                         // 0x1371(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsTargeting;                                             // 0x1372(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsMoving;                                                // 0x1373(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       DidFireWeapon;                                           // 0x1374(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       NoAmmoToReload;                                          // 0x1375(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       ReturnToIdle;                                            // 0x1376(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       IsLastArrow;                                             // 0x1377(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       HasPlayedReload;                                         // 0x1378(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       bIsExpanded;                                             // 0x1379(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_GS0L[0x6];                                   // 0x137A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		double                                                     LastPullStringTime;                                      // 0x1380(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      TimeToCollapse;                                          // 0x1388(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue;                        // 0x138C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue;                          // 0x138D(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue;                         // 0x138E(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue2;                        // 0x138F(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue2;                       // 0x1390(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue2;                         // 0x1391(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue3;                        // 0x1392(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue3;                       // 0x1393(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue4;                       // 0x1394(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue4;                        // 0x1395(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue5;                        // 0x1396(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue5;                       // 0x1397(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue6;                        // 0x1398(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue6;                       // 0x1399(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_BWQR[0x2];                                   // 0x139A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue; // 0x139C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue;                    // 0x13A0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue7;                       // 0x13A1(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue7;                        // 0x13A2(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue3;                         // 0x13A3(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue2; // 0x13A4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NearlyEqual_FloatFloat_ReturnValue;             // 0x13A8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue8;                       // 0x13A9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue8;                        // 0x13AA(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_T313[0x1];                                   // 0x13AB(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue3; // 0x13AC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue4;                         // 0x13B0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue2;                   // 0x13B1(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue9;                        // 0x13B2(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_0M2V[0x1];                                   // 0x13B3(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_GetAnimAssetPlayerTimeFromEndFraction_ReturnValue4; // 0x13B4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NearlyEqual_FloatFloat_ReturnValue2;            // 0x13B8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue9;                       // 0x13B9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue5;                         // 0x13BA(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue10;                      // 0x13BB(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue10;                       // 0x13BC(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue11;                      // 0x13BD(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue11;                       // 0x13BE(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue12;                      // 0x13BF(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue6;                         // 0x13C0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_8IAP[0x3];                                   // 0x13C1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      K2Node_Event_DeltaTimeX;                                 // 0x13C4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AActor*                                              CallFunc_GetOwningActor_ReturnValue;                     // 0x13C8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class UWorld*                                              CallFunc_K2_GetWorld_ReturnValue;                        // 0x13D0(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AShooterWeapon*                                      K2Node_DynamicCast_AsShooterWeapon;                      // 0x13D8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast_CastSuccess;                          // 0x13E0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_U70H[0x7];                                   // 0x13E1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class APrimalWeaponBow*                                    K2Node_DynamicCast_AsPrimalWeaponBow;                    // 0x13E8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast2_CastSuccess;                         // 0x13F0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_82GU[0x7];                                   // 0x13F1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AShooterCharacter*                                   CallFunc_GetPawnOwner_ReturnValue;                       // 0x13F8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class AShooterCharacter*                                   K2Node_DynamicCast_AsShooterCharacter;                   // 0x1400(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast3_CastSuccess;                         // 0x1408(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_LessEqual_IntInt_ReturnValue;                   // 0x1409(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_NJF3[0x2];                                   // 0x140A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             CallFunc_GetVelocity_ReturnValue;                        // 0x140C(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsTargeting_ReturnValue;                        // 0x1418(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_7136[0x3];                                   // 0x1419(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_BreakVector_X;                                  // 0x141C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Y;                                  // 0x1420(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Z;                                  // 0x1424(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FVector2D                                           CallFunc_MakeVector2D_ReturnValue;                       // 0x1428(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsRunning_ReturnValue;                          // 0x1430(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_1NRW[0x3];                                   // 0x1431(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_VSize2D_ReturnValue;                            // 0x1434(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue;                 // 0x1438(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BPWeaponCanFire_ReturnValue;                    // 0x1439(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue13;                      // 0x143A(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsPlayingWeaponAnimMontage_ReturnValue;         // 0x143B(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsPlayingWeaponAnimMontage_ReturnValue2;        // 0x143C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue14;                      // 0x143D(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_60S2[0x2];                                   // 0x143E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USkeletalMeshComponent*                              CallFunc_GetOwningComponent_ReturnValue;                 // 0x1440(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NotEqual_BoolBool_ReturnValue;                  // 0x1448(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsTimeSince_ReturnValue;                        // 0x1449(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue7;                         // 0x144A(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor

	public:
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2ECB3AA14DD44E84A61F72B7CF427E20();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_11F426E048C03DDD0554DDBE906BCAE4();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_2CB8CC484788817EB5788D873EC96C96();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_E226781541D9FEFDD396ADABF90C3A68();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_B235FA1C488D5B5F7EB2659B6195386C();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_9AB00C284AD1674576735A8C75A60059();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_395B848C47B26685EA03039F3EF9C35C();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_712697594C356A481C39C8900CB75F0A();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_8B510F8A42706B40F4F68D872D7AFAD9();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_1641A8BB4F3CA4DC53DE0FBD85B3C450();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_1E81D8AC4EC30FE9F8997F84C04ED8DF();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_17EE06324DBF1AAF409C2BA3914D0DDC();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_TekBow_FPV_AnimBlueprint_AnimGraphNode_TransitionResult_BF9CEDBD49D168EC8C0E33AC99312A90();
		void BlueprintUpdateAnimation(float DeltaTimeX);
		void AnimNotify_EnterIdle();
		void AnimNotify_EnterTargetIdle();
		void AnimNotify_EndPullString();
		void ExecuteUbergraph_TekBow_FPV_AnimBlueprint(int32_t EntryPoint);
		static UClass* StaticClass();
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
