#pragma once

/**
 * Name: ARK
 * Version: 1.0.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass TEKHoverSail_AnimBlueprint.TEKHoverSail_AnimBlueprint_C
	 * Size -> 0x24A1 (FullSize[0x27E1] - InheritedSize[0x0340])
	 */
	class UTEKHoverSail_AnimBlueprint_C : public UAnimInstance
	{
	public:
		struct FAnimNode_Root                                      AnimGraphNode_Root_D7BDDF31404F11704BAE00BE17AEAAB6;     // 0x0340(0x0048)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_41C692454757AD1057F4ED9ADFF525F6;     // 0x0388(0x0058)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_48B1D63B4ACA9BA21D4736B0EF3194E3;     // 0x03E0(0x0058)
		struct FAnimNode_Slot                                      AnimGraphNode_Slot_20CAE615498968894ABEFEA3EA0A541B;     // 0x0438(0x0058)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_3B6A9E8B43AFDC3B418EC38EB5A606E1; // 0x0490(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_916A580847DE72BBADDC8AA3A3129C0C; // 0x04C8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_0F5B6F1C4D56EE1905B3A080C21B8BCD; // 0x0500(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_6795F0204F22C038DEC873BACAC04E0C2; // 0x0538(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9687DDB849FF104DD027649F4CB82940; // 0x0570(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1AA32A1C48860825324F0AAE92852B88; // 0x05A8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_44136F40412C5DB994FBDCA6EA4F900C; // 0x05E0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1D50218E4A8D6044E25FF193EE9FC2CD2; // 0x0618(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_4AD8B1ED481FC54F4283A0BA91156E16; // 0x0650(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_4F3CFE7F4FAA6F31B2D56F9FD6712F862; // 0x0688(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_BC4A4C914ABF849AC4A3A1BA4DF1F823; // 0x06C0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_D01D8609465AE86A5EDD9A8A3BA9529B; // 0x06F8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_FF0AA5C4467B4E4B2D038F94304BC75F; // 0x0730(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_0B3854B54583AC77BD1F629953425AE2; // 0x0768(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_69C772BD4569598ADC503DA9A4A30FA7; // 0x07A0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_A78873ED47EEE58D8296CCB09FB04D8B; // 0x07D8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1CE651DB401B0C13914D60806AD249BF; // 0x0810(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1DE4549747BF853C5FBBCEABE2C06F6D; // 0x0848(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_64F40AE64B4724A6366624B2D691FFE5; // 0x0880(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_8E512D8C4523BA56983741AA4171A799; // 0x08B8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_DF4BD1B6468C60E559ED13B97B0B52CC; // 0x08F0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_0246241B4ABD7897716963800C58D9B7; // 0x0928(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_4D854CA74001E852966FCC9702B47298; // 0x0960(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_884723BF428A77E1D7155BBFE4410292; // 0x0998(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_AC4BA033489F2710D2B5A4BB5E630805; // 0x09D0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_EEC612B148D3A56882D7298F617CC5BE; // 0x0A08(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_D92074494DC686441F87AD81A6FD2221; // 0x0A40(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2FC50ECD49210F3F49742DAB5E98FEFB; // 0x0A78(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_B219E23C420DCF1E8A1E7387E631E9DE; // 0x0AB0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9C5F7CDF485A1E4051CE78926BF23C29; // 0x0AE8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_B265F55E4E7128118CC07FA478B25149; // 0x0B20(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_A83E200E41D0FC5955BCF08C2B7E6396; // 0x0B58(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_84EFADDA48F5C9C10AE8A2997508BF16; // 0x0B90(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1CFD5BF64F71023C5DE75EB47FDDF6D3; // 0x0BC8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_00B18487452DDA11961B5CB035511D9D; // 0x0C00(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_8123727E441916C4EB178CA87248E196; // 0x0C38(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1D50218E4A8D6044E25FF193EE9FC2CD; // 0x0C70(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_38414DAE4B4B0ACC7616E994D0BF677A; // 0x0CA8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_196BDA8A4A92A7AADE89F6A80562D120; // 0x0CE0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_4F3CFE7F4FAA6F31B2D56F9FD6712F86; // 0x0D18(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_21EFE5EF4EEAA63F537FF78323D979B2; // 0x0D50(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_27C5BB3D4498CCEF9927228FF7CB3581; // 0x0D88(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_6795F0204F22C038DEC873BACAC04E0C; // 0x0DC0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_F21EBE91419FE71B2F5EF6B6F5E3F392; // 0x0DF8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_5D9A4B454D65E694EBCD8EA20130C9B4; // 0x0E30(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_7C9BCA66447C61EBE5967792F3C3CEE4; // 0x0E68(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_F7352EF6412E5F7E7564BCABF36CE440; // 0x0EA0(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_00CBD4BC4C25CE82910B0CB1127E5CD4; // 0x0ED8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_E978182E4B053359AAE41580DD8AC76C; // 0x0F10(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_23827BA44EB7A5F59040A3B1B2F2325A; // 0x0F48(0x0038)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_083476524D37426D8714BA8D33282B42; // 0x0F80(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_AFDD14A84022F46E7CF774BA4AAA4A8C; // 0x0FC8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_6347056D4EEDFE247986F3A9A5DB7711; // 0x1018(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_5B7F79314604F36648644DAF83B4E9AA; // 0x1060(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F5; // 0x10B0(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_507D2CD9408D408B20DFF98D2EDD5250; // 0x10F8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F4; // 0x1148(0x0048)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_217055EF42AD1C8502897F970ED759F82; // 0x1190(0x0100)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_C11B6C6041F4B8327C3A8A9FE333CB922; // 0x1290(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_6744F1764DE401F068738FADF1E3ACD52; // 0x12D8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_AD08EF2A4E66F0A586A78293136F0B6F2; // 0x1328(0x0048)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_2F2C7F184E217FD468D9A694AB07408B2; // 0x1370(0x0100)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_01EFCC704C76ACBD9A5554B49B7426472; // 0x1470(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_E333A8694A60DCA8716C6C89F04319E62; // 0x14B8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_ADB74D3347E8B2D3826075A0A3E624852; // 0x1508(0x0048)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1FA063D5422D9F7F150146A3F71550EF; // 0x1550(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_1F4628174687604DE3923DA933B4BCB7; // 0x1588(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_8D6823204D7182B45F240E8AE9ED34E4; // 0x15C0(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_57A16E8643D816D0F46037AB5BB3964E; // 0x15F8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F3; // 0x1648(0x0048)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_860614D6439D00AD15C1A197E26090762; // 0x1690(0x0038)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_55AA521A42A70933A7B24C8F0721B4EC; // 0x16C8(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F2; // 0x1718(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_6CB13C274D943274D22BFB9367513D98; // 0x1760(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_21795736438E786B4C9D02BF8DD0129F; // 0x17B0(0x0048)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9679F85D486320A711DD4DAC035F205C; // 0x17F8(0x0038)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_860614D6439D00AD15C1A197E2609076; // 0x1830(0x0038)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_2F2C7F184E217FD468D9A694AB07408B; // 0x1868(0x0100)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_01EFCC704C76ACBD9A5554B49B742647; // 0x1968(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_E333A8694A60DCA8716C6C89F04319E6; // 0x19B0(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_ADB74D3347E8B2D3826075A0A3E62485; // 0x1A00(0x0048)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_217055EF42AD1C8502897F970ED759F8; // 0x1A48(0x0100)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_C11B6C6041F4B8327C3A8A9FE333CB92; // 0x1B48(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_6744F1764DE401F068738FADF1E3ACD5; // 0x1B90(0x0050)
		struct FAnimNode_Root                                      AnimGraphNode_StateResult_AD08EF2A4E66F0A586A78293136F0B6F; // 0x1BE0(0x0048)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine_177C931A40C9713794DBA7A8C4F1B5CF; // 0x1C28(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_479EE9EA4EC687A623E28D975CF18AE0; // 0x1CA8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9FFB8FAB4474DCF774DC968F5CE7D19C; // 0x1D28(0x0050)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_E27DCCCF441FF1DDC82981BE165F1C80; // 0x1D78(0x0050)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_8E6996CB4B567A5EFD39608F52C58CB8; // 0x1DC8(0x0070)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_B72EFD8C489AFAEBAD9B5894CFE13804; // 0x1E38(0x0060)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_F0B2D0664612E018672E6BB4192F0D22; // 0x1E98(0x0070)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_3739EDC44CE4717786B111A3AA929569; // 0x1F08(0x0080)
		struct FAnimNode_ApplyAdditive                             AnimGraphNode_ApplyAdditive_97FC1BDF4C41ED7BD659F682613ED95B; // 0x1F88(0x0070)
		struct FAnimNode_SaveCachedPose                            AnimGraphNode_SaveCachedPose_111DABF446F91C8B0ED2639EFE460D24; // 0x1FF8(0x0060)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_096512C543E6068A30551AA46B44C2CA; // 0x2058(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_CA2A8100469508E0F4EE84948EF07BEE; // 0x20A0(0x0048)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_1CB775D54501020B2B28FAB002E35557; // 0x20E8(0x0050)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_45F41D7349EA2A6AD53E939B08F10EF5; // 0x2138(0x0100)
		unsigned char                                              UnknownData_Q6KV[0x8];                                   // 0x2238(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_E3B37B4F4C4A85535014F999CF63CAE8; // 0x2240(0x00D0)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_DAB6C6884312BE94869F25ABAB7EF35B; // 0x2310(0x0048)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_D8FBE1704564695BE61B40977FD0EF67; // 0x2358(0x0048)
		struct FAnimNode_UseCachedPose                             AnimGraphNode_UseCachedPose_329736D342C4E87E2D66E78AAAB03CF1; // 0x23A0(0x0048)
		bool                                                       SailIsOpen;                                              // 0x23E8(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_8EIB[0x3];                                   // 0x23E9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      VerticalAnimBlendInterpSpeed;                            // 0x23EC(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FVector                                             MovementAnimBlendAxes;                                   // 0x23F0(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_F1E9[0x4];                                   // 0x23FC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		double                                                     timesincestatechange;                                    // 0x2400(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      VelocityDeltaPitchUp_MaxPitch;                           // 0x2408(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      VelocityPitchUp_RequiredForwardDot;                      // 0x240C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      VelocityDeltaPitchUp_Base;                               // 0x2410(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      VelocityDeltaPitchUp_RequiredAccelerationDifference;     // 0x2414(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      MeshRotationTurnAngle_Base;                              // 0x2418(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      RotateMeshWithTurnsAboveTurnRatio;                       // 0x241C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      TurningRatio;                                            // 0x2420(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      MeshRotationTurnAngle_Max;                               // 0x2424(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		E_HoverSkiffHoverState                                     CurrentHoverState;                                       // 0x2428(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_YAL2[0x3];                                   // 0x2429(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      FreeFallPitchAngle;                                      // 0x242C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      TurningRatioInterpSpeed_Up;                              // 0x2430(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      TurningRatioInterpSpeed_Down;                            // 0x2434(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      currTurningSpeed;                                        // 0x2438(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      BaseTurningSpeed;                                        // 0x243C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FRotator                                            MeshRotationOffsetLimits_IK;                             // 0x2440(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FVector2D                                           HoverIK_BlendOutAboveHoverHeightRange;                   // 0x244C(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      HoverIK_InterpSpeed_Rotation_Reset;                      // 0x2454(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      HoverIK_InterpSpeed_Rotation;                            // 0x2458(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FRotator                                            RootRotationOffset;                                      // 0x245C(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FVector                                             RootLocationOffset;                                      // 0x2468(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FRotator                                            MeshRotationOffsetLimits_Total;                          // 0x2474(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FTransform                                          RootOffsetTransform;                                     // 0x2480(0x0030) Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor
		struct FVector                                             FinalRootLocationOffset;                                 // 0x24B0(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      forwardaxisamountbeforemax;                              // 0x24BC(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      rightaxisamountbeforemax;                                // 0x24C0(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       DoingTrick1;                                             // 0x24C4(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       DEBUGTESTTRICKS;                                         // 0x24C5(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       DoingTrick2;                                             // 0x24C6(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       doinganytricksatall;                                     // 0x24C7(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       holdingjump;                                             // 0x24C8(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       usewobble;                                               // 0x24C9(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       usejump;                                                 // 0x24CA(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_TNRF[0x5];                                   // 0x24CB(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ATekHoverSail_Character_BP_C*                        sailref;                                                 // 0x24D0(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      remainingtricktime;                                      // 0x24D8(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      trick1duration;                                          // 0x24DC(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      trick2duration;                                          // 0x24E0(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       lasttrickwastrick1;                                      // 0x24E4(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       lasttrickwastrick2;                                      // 0x24E5(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_CMQC[0x2];                                   // 0x24E6(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		double                                                     availabletimesince;                                      // 0x24E8(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      Delta;                                                   // 0x24F0(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       DoingTrick3;                                             // 0x24F4(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       DoingTrick4;                                             // 0x24F5(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       lasttrickwastrick3;                                      // 0x24F6(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       lasttrickwastrick4;                                      // 0x24F7(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      trick3durationsetthisup;                                 // 0x24F8(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      trick4durationsetthisup;                                 // 0x24FC(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       resync;                                                  // 0x2500(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_WX2U[0x3];                                   // 0x2501(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      lastpitch;                                               // 0x2504(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      turnamount;                                              // 0x2508(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       iscliffdiving;                                           // 0x250C(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_SBQD[0x3];                                   // 0x250D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRotator                                            lastrelativerot;                                         // 0x2510(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      aerialpitchturntrate;                                    // 0x251C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      aerialpitchblendstrength;                                // 0x2520(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      aerialpitchblendstrengthsimpleollie;                     // 0x2524(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      holdingdriftdirection;                                   // 0x2528(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      angletoturnmeshwhenholdingdrift;                         // 0x252C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      holdingdriftblendrate;                                   // 0x2530(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       ismoving;                                                // 0x2534(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       haspassenger;                                            // 0x2535(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       recentlyspawned;                                         // 0x2536(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       hasrider;                                                // 0x2537(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      SingleRiderAdditiveAlpha;                                // 0x2538(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		float                                                      SailClosedClampPitch;                                    // 0x253C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_DoubleDouble_ReturnValue;                  // 0x2540(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_DoubleDouble_ReturnValue2;                 // 0x2541(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue;                        // 0x2542(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_YB55[0x1];                                   // 0x2543(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_BreakVector_X;                                  // 0x2544(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Y;                                  // 0x2548(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Z;                                  // 0x254C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue;                          // 0x2550(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_A3SH[0x3];                                   // 0x2551(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_MapRange_ReturnValue;                           // 0x2554(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue2;                         // 0x2558(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_76GM[0x3];                                   // 0x2559(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_Subtract_FloatFloat_ReturnValue;                // 0x255C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_MapRange_ReturnValue2;                          // 0x2560(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_FClamp_ReturnValue;                             // 0x2564(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_X2;                                 // 0x2568(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Y2;                                 // 0x256C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Z2;                                 // 0x2570(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_DoubleDouble_ReturnValue3;                 // 0x2574(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_DZ0A[0x3];                                   // 0x2575(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_MapRange_ReturnValue3;                          // 0x2578(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue2;                       // 0x257C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_F9S6[0x3];                                   // 0x257D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_Subtract_FloatFloat_ReturnValue2;               // 0x2580(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_MapRange_ReturnValue4;                          // 0x2584(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_X3;                                 // 0x2588(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Y3;                                 // 0x258C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Z3;                                 // 0x2590(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue;                // 0x2594(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_MapRange_ReturnValue5;                          // 0x2598(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue2;               // 0x259C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_MapRange_ReturnValue6;                          // 0x25A0(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_DoubleDouble_ReturnValue4;                 // 0x25A4(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue3;                         // 0x25A5(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue3;                       // 0x25A6(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue4;                         // 0x25A7(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_DoubleDouble_ReturnValue5;                 // 0x25A8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue4;                       // 0x25A9(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue5;                         // 0x25AA(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_DoubleDouble_ReturnValue6;                 // 0x25AB(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue6;                         // 0x25AC(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue5;                       // 0x25AD(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_NAQG[0x2];                                   // 0x25AE(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_BreakVector_X4;                                 // 0x25B0(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Y4;                                 // 0x25B4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Z4;                                 // 0x25B8(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue3;               // 0x25BC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_MapRange_ReturnValue7;                          // 0x25C0(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_MapRange_ReturnValue8;                          // 0x25C4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NearlyEqual_FloatFloat_ReturnValue;             // 0x25C8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_6JOQ[0x3];                                   // 0x25C9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_SelectFloat_ReturnValue;                        // 0x25CC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_SelectFloat_ReturnValue2;                       // 0x25D0(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      K2Node_Event_DeltaTimeX;                                 // 0x25D4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_SelectFloat_ReturnValue3;                       // 0x25D8(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_JURS[0x4];                                   // 0x25DC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class APawn*                                               CallFunc_TryGetPawnOwner_ReturnValue;                    // 0x25E0(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class ATekHoverSail_Character_BP_C*                        K2Node_DynamicCast_AsTekHoverSail_Character_BP_C;        // 0x25E8(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       K2Node_DynamicCast_CastSuccess;                          // 0x25F0(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_CAO6[0x3];                                   // 0x25F1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_BreakVector_X5;                                 // 0x25F4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Y5;                                 // 0x25F8(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Z5;                                 // 0x25FC(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Divide_FloatFloat_ReturnValue;                  // 0x2600(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_IsValid_ReturnValue;                            // 0x2604(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue6;                       // 0x2605(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue7;                         // 0x2606(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue8;                         // 0x2607(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_DoubleDouble_ReturnValue7;                 // 0x2608(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue7;                       // 0x2609(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_2QSG[0x2];                                   // 0x260A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_Abs_ReturnValue;                                // 0x260C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue;                 // 0x2610(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_ZFPM[0x3];                                   // 0x2611(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_SelectFloat_ReturnValue4;                       // 0x2614(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Divide_FloatFloat_ReturnValue2;                 // 0x2618(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_SelectFloat_ReturnValue5;                       // 0x261C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Abs_ReturnValue2;                               // 0x2620(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue2;                // 0x2624(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_8BJB[0x3];                                   // 0x2625(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_SelectFloat_ReturnValue6;                       // 0x2628(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_LessEqual_FloatFloat_ReturnValue;               // 0x262C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue;                    // 0x262D(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_DoubleDouble_ReturnValue8;                 // 0x262E(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_O7BR[0x1];                                   // 0x262F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_SelectFloat_ReturnValue7;                       // 0x2630(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_MapRange_ReturnValue9;                          // 0x2634(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_NearlyEqual_FloatFloat_ReturnValue2;            // 0x2638(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_M5HS[0x3];                                   // 0x2639(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CallFunc_Multiply_FloatFloat_ReturnValue4;               // 0x263C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_SelectFloat_ReturnValue8;                       // 0x2640(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_X6;                                 // 0x2644(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Y6;                                 // 0x2648(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_BreakVector_Z6;                                 // 0x264C(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_MapRange_ReturnValue10;                         // 0x2650(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_SelectFloat_ReturnValue9;                       // 0x2654(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue9;                         // 0x2658(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue8;                       // 0x2659(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue9;                       // 0x265A(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue;                         // 0x265B(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue10;                      // 0x265C(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue2;                        // 0x265D(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Is_Near_Ground_not_pure_ReturnValue;            // 0x265E(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue11;                      // 0x265F(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue12;                      // 0x2660(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue3;                        // 0x2661(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_DoubleDouble_ReturnValue9;                 // 0x2662(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue13;                      // 0x2663(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue4;                        // 0x2664(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue5;                        // 0x2665(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_LessEqual_FloatFloat_ReturnValue2;              // 0x2666(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue2;                   // 0x2667(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Not_PreBool_ReturnValue14;                      // 0x2668(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		ENetRole                                                   CallFunc_GetRole_ReturnValue;                            // 0x2669(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanOR_ReturnValue10;                        // 0x266A(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_EqualEqual_ByteByte_ReturnValue;                // 0x266B(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		struct FVector                                             CallFunc_GetActorForwardVector_ReturnValue;              // 0x266C(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		class UWorld*                                              CallFunc_K2_GetWorld_ReturnValue;                        // 0x2678(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_TimeSince_Network_ReturnValue;                  // 0x2680(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Less_FloatFloat_ReturnValue3;                   // 0x2684(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_S7KQ[0x3];                                   // 0x2685(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		double                                                     CallFunc_Conv_FloatToDouble_ReturnValue;                 // 0x2688(0x0008) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_BooleanAND_ReturnValue6;                        // 0x2690(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_Z1E8[0x3];                                   // 0x2691(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             CallFunc_GetActorRightVector_ReturnValue;                // 0x2694(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_Dot_VectorVector_ReturnValue;                   // 0x26A0(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		float                                                      CallFunc_GetMaxAcceleration_ReturnValue;                 // 0x26A4(0x0004) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		bool                                                       CallFunc_Greater_FloatFloat_ReturnValue3;                // 0x26A8(0x0001) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_KM85[0x3];                                   // 0x26A9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             CallFunc_SelectVector_ReturnValue;                       // 0x26AC(0x000C) ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor
